rtkconnectivity/hal_realtek_mainline/bee/soc/inc/rtl87x2j/pcc_reg.h
#ifndef PCC_REG_H
#define PCC_REG_H
#include <stdint.h>

/* ================================================================================ */
/* ================                PCC Register               ================ */
/* ===========     Reference: RL7019_SYSON_auto_gen_table_20251107A.xlsx     =========== */
/* ================================================================================ */
#define PCC_REG_PERION_CLK_REG0X        0x200
#define PCC_REG_PERION_CLK_REG1X        0x204
#define PCC_REG_PERION_CLK_REG2X        0x208
#define PCC_REG_PERION_CLK_REG3X        0x20C
#define PCC_REG_PERION_CLK_REG4X        0x210
#define PCC_REG_PERION_CLK_REG5X        0x214
#define PCC_REG_TRNG                    0x218
#define PCC_REG_CORE_WDT                0x21C
#define PCC_REG_AES                     0x220
#define PCC_REG_SHA256                  0x224
#define PCC_REG_MODEMRFCPI              0x228
#define PCC_REG_DMA                     0x22C
#define PCC_REG_SPIC                    0x230
#define PCC_REG_SPI0                    0x234
#define PCC_REG_SPI1                    0x238
#define PCC_REG_SPI2                    0x23C
#define PCC_REG_I2S0                    0x240
#define PCC_REG_TIMER0                  0x244
#define PCC_REG_TIMER1_A                0x248
#define PCC_REG_TIMER1_B                0x24C
#define PCC_REG_TIMER1_C                0x250
#define PCC_REG_TIMER2                  0x254
#define PCC_REG_TIMER2_PWM              0x258
#define PCC_REG_USB                     0x25C
#define PCC_REG_ADC_CONTROLLER          0x260
#define PCC_REG_I2C0                    0x264
#define PCC_REG_I2C1                    0x268
#define PCC_REG_Keyscan                 0x26C
#define PCC_REG_SPI3W                   0x270
#define PCC_REG_EFLASH                  0x274
#define PCC_REG_CAN                     0x278
#define PCC_REG_GPIO_DEBOUNCE_2P4G      0x27C
#define PCC_REG_UART0                   0x280
#define PCC_REG_UART1                   0x284
#define PCC_REG_UART2                   0x288
#define PCC_REG_UART3                   0x28C
#define PCC_REG_GPIOA                   0x290
#define PCC_REG_MODEM                   0x294
#define PCC_REG_PROPRIETARY             0x298
#define PCC_REG_IR                      0x29C
#define PCC_REG_BT_VDREG                0x2A0
#define PCC_REG_AUDIO                   0x2A4
#define PCC_REG_LXBUS                   0x2A8
#define PCC_REG_CAL32K                  0x2AC
#define PCC_REG_PLATFORM                0x2B0
#define PCC_REG_PCC                     0x2B4
#define PCC_REG_TMETER                  0x2B8
#define PCC_REG_TIMER1_D                0x2BC
#define PCC_REG_CAL80M                  0x8F0
#define PCC_REG_CAL10M                  0x8F4
#define PCC_REG_VDREG                   0x8F8
#define PCC_REG_CPU                     0x8FC
#define PCC_REG_SYSON                   0x900
#define PCC_REG_HCI                     0x904
#define PCC_REG_BT_OTHER0               0x908
#define PCC_REG_TIMER0_PCLK             0x90C
#define PCC_REG_TIMER1_PCLK             0x910
#define PCC_REG_ETIMER_PCLK             0x914
#define PCC_REG_OSC128K_CAL             0x918
#define PCC_REG_RXI300                  0x91C
#define PCC_REG_AON_DEB_TOP             0x920
#define PCC_REG_OTHERS                  0x924
#define PCC_REG_PERION_CLK_VPON_REG0X   0x3C4
#define PCC_REG_PERION_CLK_VPON_REG1X   0x3C8
#define PCC_REG_PERION_CLK_VPON_REG2X   0x3CC
#define PCC_REG_LPPWM                   0x3D0
#define PCC_REG_LPQDEC                  0x3D4
#define PCC_REG_GRTC                    0x3D8
#define PCC_REG_BLUEWIZ                 0x3DC
#define PCC_REG_USER_RTC                0x3E0
#define PCC_REG_RAP                     0x3E4
#define PCC_REG_GTC                     0x3E8
#define PCC_REG_SDM_VPON                0x3EC
#define PCC_REG_LPWDT_VPON              0x3F0
#define PCC_REG_PERION_CLK_AON_REG0X    0x3F4
#define PCC_REG_PCK600                  0x3F8
#define PCC_REG_LPC                     0x3FC
#define PCC_r_PMUX_GPIO_P0_0to3         0x2C0
#define PCC_r_PMUX_GPIO_P0_4to7         0x2C4
#define PCC_r_PMUX_GPIO_P1_0to7         0x2C8
#define PCC_r_PMUX_GPIO_P2_0to3         0x2CC
#define PCC_r_PMUX_GPIO_P2_4to7         0x2D0
#define PCC_r_PMUX_GPIO_P3_0to3         0x2D4
#define PCC_r_PMUX_GPIO_P3_4to6         0x2D8
#define PCC_r_PMUX_GPIO_P4_0to3         0x2DC
#define PCC_r_PMUX_GPIO_H_0to2          0x2E0
#define PCC_REG_PMUX_GPIO_6_0to3        0x2E4
#define PCC_REG_PMUX_GPIO_6_4to7        0x2E8
#define PCC_REG_PMUX_GPIO_7_0to1_SPIC_1 0x2EC
#define PCC_REG_PMUX_GPIO_SPIC_2        0x2F0
#define PCC_r_PMUX_TEST_MODE            0x2F4
#define PCC_REG_BC12_CTRL1              0x2F8
#define PCC_REG_BC12_CTRL2              0x2FC
#define PCC_REG_BC12_CTRL3              0x300
#define PCC_REG_BC12_CTRL4              0x304
#define PCC_REG_BC12_CTRL5              0x308
#define PCC_REG_BC12_CTRL6              0x30C
#define PCC_REG_DBG_MUX_CTRL            0x310
#define PCC_REG_RSVD_2D8                0x314
#define PCC_REG_SWITCH_PAR              0x318
#define PCC_REG_PINMUX_DBG_REG          0x31C
#define PCC_LDO_PA_SWR_AUTO_SW          0x320
#define PCC_CORE_SWR_PAR_TAB_0_0        0x324
#define PCC_CORE_SWR_PAR_TAB_4_0        0x328
#define PCC_CORE_SWR_PAR_TAB_5_0        0x32C
#define PCC_CORE_SWR_PAR_TAB_6_0        0x330
#define PCC_CORE_SWR_PAR_TAB_7_0        0x334
#define PCC_REG_CORE_PAR                0x338
#define PCC_PON_PERI_DLYSEL_CTRL        0x33C
#define PCC_REG_DSS_CTRL0               0x340
#define PCC_REG_DSS_CTRL1               0x344
#define PCC_REG_DSS_CTRL2               0x348
#define PCC_REG_OSC40_CTRL              0x34C
#define PCC_REG_AAC_0                   0x350
#define PCC_REG_AAC_1                   0x354
#define PCC_REG_XTAL_PLL                0x358
#define PCC_REG_XTALPDCK                0x35C
#define PCC_REG_PADMUX_AS_CFG0          0x360
#define PCC_REG_PADMUX_AS_CFG1          0x364
#define PCC_REG_PADMUX_AS_CFG2          0x368
#define PCC_REG_PADMUX_AS_CFG3          0x36C
#define PCC_REG_PADMUX_AS_CFG4          0x370
#define PCC_REG_PADMUX_AS_CFG5          0x374
#define PCC_REG_PADMUX_AS_CFG6          0x378
#define PCC_REG_PADMUX_AS_CFG7          0x37C
#define PCC_REG_PADMUX_AS_CFG8          0x380
#define PCC_REG_PADMUX_AS_CFG9          0x384
#define PCC_REG_PADMUX_AS_CFG10         0x388
#define PCC_REG_QCH_BUSY_FLAG1_PROC1    0x38C
#define PCC_REG_QCH_BUSY_FLAG1_PROC2    0x390
#define PCC_REG_QCH_BUSY_FLAG0_PROC0    0x394
#define PCC_REG_QCH_BUSY_FLAG0_PROC1    0x398
#define PCC_REG_QCH_BUSY_FLAG0_PROC2    0x39C
#define PCC_REG_QCH_BUSY_FLAG1          0x3A0
#define PCC_REG_QCH_BUSY_FLAG0          0x3A4
#define PCC_REG_USB_POW                 0x3A8
#define PCC_REG_DUMMY_3AC               0x3AC
#define PCC_REG_DUMMY_3B0               0x3B0
#define PCC_REG_DUMMY_3B4               0x3B4
#define PCC_REG_DBG_MUX_PCK             0x3B8
#define PCC_REG_DBG_MUX_GRP_CFG0        0x3BC
#define PCC_REG_DBG_MUX_GRP_CFG1        0x3C0

