rtkconnectivity/hal_realtek_mainline/bee/soc/inc/rtl87x2j/pcc_reg.h
/* 0x200    0x4000_0200
    0       R/W     RESERVED                                        1'b0
    1       W1O     REG_ZONE1_WRP_EN                                1'b0
    2       W1O     REG_ZONE2_WRP_EN                                1'b0
    3       W1O     REG_WRP_LOCK                                    1'b0
    9:4     R/W     R_BT_AHB_WAIT_CNT                               6'h0C
    10      R/W     R_AON_RD_OPT                                    1'b1
    11      R/W     R_BTAON_ACC_NO_BLOCK                            1'b0
    12      R       CLKEN_O_UART0                                   1'h0
    13      R       CLKEN_O_UART1                                   1'h0
    14      R       CLKEN_O_UART2                                   1'h0
    15      R       CLKEN_O_UART3                                   1'h0
    16      R       CLKEN_O_IRRC                                    1'h0
    17      R       CLKEN_O_AUDIO                                   1'h0
    18      R       CLKEN_O_TIMER1                                  1'h0
    19      R       CLKEN_O_TIMER2                                  1'h0
    20      R       CLKEN_O_TIMER3                                  1'h0
    21      R       CLKEN_O_TIMER4                                  1'h0
    22      R       CLKEN_O_TIMER5                                  1'h0
    23      R       CLKEN_O_TIMER6                                  1'h0
    24      R       CLKEN_O_TIMER7                                  1'h0
    25      R       CLKEN_O_TIMER8                                  1'h0
    26      R       CLKEN_O_TIMER9                                  1'h0
    27      R       CLKEN_O_TIMER10                                 1'h0
    28      R       CLKEN_O_TIMER11                                 1'h0
    29      R       CLKEN_O_ETIMER                                  1'h0
    30      R       CLKEN_O_RFC                                     1'h0
    31      R       CLKEN_O_MODEM                                   1'h0
 */
typedef union _PCC_REG_PERION_CLK_REG0X_TYPE
{
    uint32_t d32;
    struct
    {
        uint32_t RESERVED: 1;
        uint32_t REG_ZONE1_WRP_EN: 1;
        uint32_t REG_ZONE2_WRP_EN: 1;
        uint32_t REG_WRP_LOCK: 1;
        uint32_t R_BT_AHB_WAIT_CNT: 6;
        uint32_t R_AON_RD_OPT: 1;
        uint32_t R_BTAON_ACC_NO_BLOCK: 1;
        uint32_t CLKEN_O_UART0: 1;
        uint32_t CLKEN_O_UART1: 1;
        uint32_t CLKEN_O_UART2: 1;
        uint32_t CLKEN_O_UART3: 1;
        uint32_t CLKEN_O_IRRC: 1;
        uint32_t CLKEN_O_AUDIO: 1;
        uint32_t CLKEN_O_TIMER1: 1;
        uint32_t CLKEN_O_TIMER2: 1;
        uint32_t CLKEN_O_TIMER3: 1;
        uint32_t CLKEN_O_TIMER4: 1;
        uint32_t CLKEN_O_TIMER5: 1;
        uint32_t CLKEN_O_TIMER6: 1;
        uint32_t CLKEN_O_TIMER7: 1;
        uint32_t CLKEN_O_TIMER8: 1;
        uint32_t CLKEN_O_TIMER9: 1;
        uint32_t CLKEN_O_TIMER10: 1;
        uint32_t CLKEN_O_TIMER11: 1;
        uint32_t CLKEN_O_ETIMER: 1;
        uint32_t CLKEN_O_RFC: 1;
        uint32_t CLKEN_O_MODEM: 1;
    };
} PCC_REG_PERION_CLK_REG0X_TYPE;

/*0x4000_0200 PCC_REG_PERION_CLK_REG0X*/
#define PCC_REG_PERION_CLK_REG0X_RESERVED_Pos                                                    0U
#define PCC_REG_PERION_CLK_REG0X_RESERVED_Msk                                                    (0x1UL << PCC_REG_PERION_CLK_REG0X_RESERVED_Pos)

#define PCC_REG_PERION_CLK_REG0X_REG_ZONE1_WRP_EN_Pos                                            1U
#define PCC_REG_PERION_CLK_REG0X_REG_ZONE1_WRP_EN_Msk                                            (0x1UL << PCC_REG_PERION_CLK_REG0X_REG_ZONE1_WRP_EN_Pos)

#define PCC_REG_PERION_CLK_REG0X_REG_ZONE2_WRP_EN_Pos                                            2U
#define PCC_REG_PERION_CLK_REG0X_REG_ZONE2_WRP_EN_Msk                                            (0x1UL << PCC_REG_PERION_CLK_REG0X_REG_ZONE2_WRP_EN_Pos)

#define PCC_REG_PERION_CLK_REG0X_REG_WRP_LOCK_Pos                                                3U
#define PCC_REG_PERION_CLK_REG0X_REG_WRP_LOCK_Msk                                                (0x1UL << PCC_REG_PERION_CLK_REG0X_REG_WRP_LOCK_Pos)

#define PCC_REG_PERION_CLK_REG0X_R_BT_AHB_WAIT_CNT_Pos                                           4U
#define PCC_REG_PERION_CLK_REG0X_R_BT_AHB_WAIT_CNT_Msk                                           (0x3FUL << PCC_REG_PERION_CLK_REG0X_R_BT_AHB_WAIT_CNT_Pos)

#define PCC_REG_PERION_CLK_REG0X_R_AON_RD_OPT_Pos                                                10U
#define PCC_REG_PERION_CLK_REG0X_R_AON_RD_OPT_Msk                                                (0x1UL << PCC_REG_PERION_CLK_REG0X_R_AON_RD_OPT_Pos)

#define PCC_REG_PERION_CLK_REG0X_R_BTAON_ACC_NO_BLOCK_Pos                                        11U
#define PCC_REG_PERION_CLK_REG0X_R_BTAON_ACC_NO_BLOCK_Msk                                        (0x1UL << PCC_REG_PERION_CLK_REG0X_R_BTAON_ACC_NO_BLOCK_Pos)

#define PCC_REG_PERION_CLK_REG0X_CLKEN_O_UART0_Pos                                               12U
#define PCC_REG_PERION_CLK_REG0X_CLKEN_O_UART0_Msk                                               (0x1UL << PCC_REG_PERION_CLK_REG0X_CLKEN_O_UART0_Pos)

#define PCC_REG_PERION_CLK_REG0X_CLKEN_O_UART1_Pos                                               13U
#define PCC_REG_PERION_CLK_REG0X_CLKEN_O_UART1_Msk                                               (0x1UL << PCC_REG_PERION_CLK_REG0X_CLKEN_O_UART1_Pos)

#define PCC_REG_PERION_CLK_REG0X_CLKEN_O_UART2_Pos                                               14U
#define PCC_REG_PERION_CLK_REG0X_CLKEN_O_UART2_Msk                                               (0x1UL << PCC_REG_PERION_CLK_REG0X_CLKEN_O_UART2_Pos)

#define PCC_REG_PERION_CLK_REG0X_CLKEN_O_UART3_Pos                                               15U
#define PCC_REG_PERION_CLK_REG0X_CLKEN_O_UART3_Msk                                               (0x1UL << PCC_REG_PERION_CLK_REG0X_CLKEN_O_UART3_Pos)

#define PCC_REG_PERION_CLK_REG0X_CLKEN_O_IRRC_Pos                                                16U
#define PCC_REG_PERION_CLK_REG0X_CLKEN_O_IRRC_Msk                                                (0x1UL << PCC_REG_PERION_CLK_REG0X_CLKEN_O_IRRC_Pos)

