rtkconnectivity/hal_realtek_mainline/bee/soc/inc/rtl87x2j/pcc_reg.h
#define PCC_REG_PERION_CLK_REG0X_CLKEN_O_AUDIO_Pos                                               17U
#define PCC_REG_PERION_CLK_REG0X_CLKEN_O_AUDIO_Msk                                               (0x1UL << PCC_REG_PERION_CLK_REG0X_CLKEN_O_AUDIO_Pos)

#define PCC_REG_PERION_CLK_REG0X_CLKEN_O_TIMER1_Pos                                              18U
#define PCC_REG_PERION_CLK_REG0X_CLKEN_O_TIMER1_Msk                                              (0x1UL << PCC_REG_PERION_CLK_REG0X_CLKEN_O_TIMER1_Pos)

#define PCC_REG_PERION_CLK_REG0X_CLKEN_O_TIMER2_Pos                                              19U
#define PCC_REG_PERION_CLK_REG0X_CLKEN_O_TIMER2_Msk                                              (0x1UL << PCC_REG_PERION_CLK_REG0X_CLKEN_O_TIMER2_Pos)

#define PCC_REG_PERION_CLK_REG0X_CLKEN_O_TIMER3_Pos                                              20U
#define PCC_REG_PERION_CLK_REG0X_CLKEN_O_TIMER3_Msk                                              (0x1UL << PCC_REG_PERION_CLK_REG0X_CLKEN_O_TIMER3_Pos)

#define PCC_REG_PERION_CLK_REG0X_CLKEN_O_TIMER4_Pos                                              21U
#define PCC_REG_PERION_CLK_REG0X_CLKEN_O_TIMER4_Msk                                              (0x1UL << PCC_REG_PERION_CLK_REG0X_CLKEN_O_TIMER4_Pos)

#define PCC_REG_PERION_CLK_REG0X_CLKEN_O_TIMER5_Pos                                              22U
#define PCC_REG_PERION_CLK_REG0X_CLKEN_O_TIMER5_Msk                                              (0x1UL << PCC_REG_PERION_CLK_REG0X_CLKEN_O_TIMER5_Pos)

#define PCC_REG_PERION_CLK_REG0X_CLKEN_O_TIMER6_Pos                                              23U
#define PCC_REG_PERION_CLK_REG0X_CLKEN_O_TIMER6_Msk                                              (0x1UL << PCC_REG_PERION_CLK_REG0X_CLKEN_O_TIMER6_Pos)

#define PCC_REG_PERION_CLK_REG0X_CLKEN_O_TIMER7_Pos                                              24U
#define PCC_REG_PERION_CLK_REG0X_CLKEN_O_TIMER7_Msk                                              (0x1UL << PCC_REG_PERION_CLK_REG0X_CLKEN_O_TIMER7_Pos)

#define PCC_REG_PERION_CLK_REG0X_CLKEN_O_TIMER8_Pos                                              25U
#define PCC_REG_PERION_CLK_REG0X_CLKEN_O_TIMER8_Msk                                              (0x1UL << PCC_REG_PERION_CLK_REG0X_CLKEN_O_TIMER8_Pos)

#define PCC_REG_PERION_CLK_REG0X_CLKEN_O_TIMER9_Pos                                              26U
#define PCC_REG_PERION_CLK_REG0X_CLKEN_O_TIMER9_Msk                                              (0x1UL << PCC_REG_PERION_CLK_REG0X_CLKEN_O_TIMER9_Pos)

#define PCC_REG_PERION_CLK_REG0X_CLKEN_O_TIMER10_Pos                                             27U
#define PCC_REG_PERION_CLK_REG0X_CLKEN_O_TIMER10_Msk                                             (0x1UL << PCC_REG_PERION_CLK_REG0X_CLKEN_O_TIMER10_Pos)

#define PCC_REG_PERION_CLK_REG0X_CLKEN_O_TIMER11_Pos                                             28U
#define PCC_REG_PERION_CLK_REG0X_CLKEN_O_TIMER11_Msk                                             (0x1UL << PCC_REG_PERION_CLK_REG0X_CLKEN_O_TIMER11_Pos)

#define PCC_REG_PERION_CLK_REG0X_CLKEN_O_ETIMER_Pos                                              29U
#define PCC_REG_PERION_CLK_REG0X_CLKEN_O_ETIMER_Msk                                              (0x1UL << PCC_REG_PERION_CLK_REG0X_CLKEN_O_ETIMER_Pos)

#define PCC_REG_PERION_CLK_REG0X_CLKEN_O_RFC_Pos                                                 30U
#define PCC_REG_PERION_CLK_REG0X_CLKEN_O_RFC_Msk                                                 (0x1UL << PCC_REG_PERION_CLK_REG0X_CLKEN_O_RFC_Pos)

#define PCC_REG_PERION_CLK_REG0X_CLKEN_O_MODEM_Pos                                               31U
#define PCC_REG_PERION_CLK_REG0X_CLKEN_O_MODEM_Msk                                               (0x1UL << PCC_REG_PERION_CLK_REG0X_CLKEN_O_MODEM_Pos)

/* 0x204    0x4000_0204
    3:0     R       RF_RL_ID                                        4'd0
    7:4     R       RF_RTL_ID                                       4'd0
    27:8    R       RESERVED                                        20'h0
    30:28   R/W     DUMMY2                                          3'b0
    31      R/W     VCORE_STATUS_CHECK                              1'b0
 */
typedef union _PCC_REG_PERION_CLK_REG1X_TYPE
{
    uint32_t d32;
    struct
    {
        uint32_t RF_RL_ID: 4;
        uint32_t RF_RTL_ID: 4;
        uint32_t RESERVED: 20;
        uint32_t DUMMY2: 3;
        uint32_t VCORE_STATUS_CHECK: 1;
    };
} PCC_REG_PERION_CLK_REG1X_TYPE;

/*0x4000_0204 PCC_REG_PERION_CLK_REG1X*/
#define PCC_REG_PERION_CLK_REG1X_RF_RL_ID_Pos                                                    0U
#define PCC_REG_PERION_CLK_REG1X_RF_RL_ID_Msk                                                    (0xFUL << PCC_REG_PERION_CLK_REG1X_RF_RL_ID_Pos)

#define PCC_REG_PERION_CLK_REG1X_RF_RTL_ID_Pos                                                   4U
#define PCC_REG_PERION_CLK_REG1X_RF_RTL_ID_Msk                                                   (0xFUL << PCC_REG_PERION_CLK_REG1X_RF_RTL_ID_Pos)

#define PCC_REG_PERION_CLK_REG1X_RESERVED_Pos                                                    8U
#define PCC_REG_PERION_CLK_REG1X_RESERVED_Msk                                                    (0xFFFFFUL << PCC_REG_PERION_CLK_REG1X_RESERVED_Pos)

#define PCC_REG_PERION_CLK_REG1X_DUMMY2_Pos                                                      28U
#define PCC_REG_PERION_CLK_REG1X_DUMMY2_Msk                                                      (0x7UL << PCC_REG_PERION_CLK_REG1X_DUMMY2_Pos)

#define PCC_REG_PERION_CLK_REG1X_VCORE_STATUS_CHECK_Pos                                          31U
#define PCC_REG_PERION_CLK_REG1X_VCORE_STATUS_CHECK_Msk                                          (0x1UL << PCC_REG_PERION_CLK_REG1X_VCORE_STATUS_CHECK_Pos)

/* 0x208    0x4000_0208
    0       R/W     HCLK_AUTO_SLOW_EN                               1'b0
    8:1     R/W     HCLK_AUTO_SLOW_OP1_EVNT                         8'b0
    11:9    R/W     HCLK_DIV_SEL                                    3'h0
    12      R       MODEM_CLK_SWITCH_DONE                           1'h1
    13      R/W     MODEM_CK_40M_GATE_EN                            1'h0
    14      R/W     MODEM_CK_FORCE_LOW                              1'h0
    16:15   R/W     R_PLATFORM_DIV_SEL                              2'b00
    19:17   R/W     RESERVED_2                                      3'b000
    20      R/W     RESERVED_1                                      1'b0
    21      R/W     RESERVED                                        1'b0
    22      R/W     R_CLK_SYSTICK_EN                                1'b1
    23      R/W     R_10M_SYSTICK_CLK_SRC_SEL                       1'b1
    24      R/W     R_40M_AUDIO_CLK_SRC_SEL                         1'b1
    25      R/W     R_TIMER_CLK_F40M_SRC_SEL                        1'b1
    26      R/W     R_UART_CLK_SRC_SEL                              1'b1
    31:27   R/W     DUMMY3                                          5'b0
 */
typedef union _PCC_REG_PERION_CLK_REG2X_TYPE
{
    uint32_t d32;
    struct
    {
        uint32_t HCLK_AUTO_SLOW_EN: 1;
        uint32_t HCLK_AUTO_SLOW_OP1_EVNT: 8;
        uint32_t HCLK_DIV_SEL: 3;
        uint32_t MODEM_CLK_SWITCH_DONE: 1;
        uint32_t MODEM_CK_40M_GATE_EN: 1;
        uint32_t MODEM_CK_FORCE_LOW: 1;
        uint32_t R_PLATFORM_DIV_SEL: 2;
        uint32_t RESERVED_2: 3;
        uint32_t RESERVED_1: 1;
        uint32_t RESERVED: 1;
        uint32_t R_CLK_SYSTICK_EN: 1;
        uint32_t R_10M_SYSTICK_CLK_SRC_SEL: 1;
        uint32_t R_40M_AUDIO_CLK_SRC_SEL: 1;
        uint32_t R_TIMER_CLK_F40M_SRC_SEL: 1;
        uint32_t R_UART_CLK_SRC_SEL: 1;
        uint32_t DUMMY3: 5;
    };
} PCC_REG_PERION_CLK_REG2X_TYPE;

/*0x4000_0208 PCC_REG_PERION_CLK_REG2X*/
#define PCC_REG_PERION_CLK_REG2X_HCLK_AUTO_SLOW_EN_Pos                                           0U
#define PCC_REG_PERION_CLK_REG2X_HCLK_AUTO_SLOW_EN_Msk                                           (0x1UL << PCC_REG_PERION_CLK_REG2X_HCLK_AUTO_SLOW_EN_Pos)

