rtkconnectivity/hal_realtek_mainline/bee/soc/inc/rtl87x2j/pcc_reg.h
#define PCC_REG_PERION_CLK_REG2X_HCLK_AUTO_SLOW_OP1_EVNT_Pos                                     1U
#define PCC_REG_PERION_CLK_REG2X_HCLK_AUTO_SLOW_OP1_EVNT_Msk                                     (0xFFUL << PCC_REG_PERION_CLK_REG2X_HCLK_AUTO_SLOW_OP1_EVNT_Pos)

#define PCC_REG_PERION_CLK_REG2X_HCLK_DIV_SEL_Pos                                                9U
#define PCC_REG_PERION_CLK_REG2X_HCLK_DIV_SEL_Msk                                                (0x7UL << PCC_REG_PERION_CLK_REG2X_HCLK_DIV_SEL_Pos)

#define PCC_REG_PERION_CLK_REG2X_MODEM_CLK_SWITCH_DONE_Pos                                       12U
#define PCC_REG_PERION_CLK_REG2X_MODEM_CLK_SWITCH_DONE_Msk                                       (0x1UL << PCC_REG_PERION_CLK_REG2X_MODEM_CLK_SWITCH_DONE_Pos)

#define PCC_REG_PERION_CLK_REG2X_MODEM_CK_40M_GATE_EN_Pos                                        13U
#define PCC_REG_PERION_CLK_REG2X_MODEM_CK_40M_GATE_EN_Msk                                        (0x1UL << PCC_REG_PERION_CLK_REG2X_MODEM_CK_40M_GATE_EN_Pos)

#define PCC_REG_PERION_CLK_REG2X_MODEM_CK_FORCE_LOW_Pos                                          14U
#define PCC_REG_PERION_CLK_REG2X_MODEM_CK_FORCE_LOW_Msk                                          (0x1UL << PCC_REG_PERION_CLK_REG2X_MODEM_CK_FORCE_LOW_Pos)

#define PCC_REG_PERION_CLK_REG2X_R_PLATFORM_DIV_SEL_Pos                                          15U
#define PCC_REG_PERION_CLK_REG2X_R_PLATFORM_DIV_SEL_Msk                                          (0x3UL << PCC_REG_PERION_CLK_REG2X_R_PLATFORM_DIV_SEL_Pos)

#define PCC_REG_PERION_CLK_REG2X_RESERVED_2_Pos                                                  17U
#define PCC_REG_PERION_CLK_REG2X_RESERVED_2_Msk                                                  (0x7UL << PCC_REG_PERION_CLK_REG2X_RESERVED_2_Pos)

#define PCC_REG_PERION_CLK_REG2X_RESERVED_1_Pos                                                  20U
#define PCC_REG_PERION_CLK_REG2X_RESERVED_1_Msk                                                  (0x1UL << PCC_REG_PERION_CLK_REG2X_RESERVED_1_Pos)

#define PCC_REG_PERION_CLK_REG2X_RESERVED_Pos                                                    21U
#define PCC_REG_PERION_CLK_REG2X_RESERVED_Msk                                                    (0x1UL << PCC_REG_PERION_CLK_REG2X_RESERVED_Pos)

#define PCC_REG_PERION_CLK_REG2X_R_CLK_SYSTICK_EN_Pos                                            22U
#define PCC_REG_PERION_CLK_REG2X_R_CLK_SYSTICK_EN_Msk                                            (0x1UL << PCC_REG_PERION_CLK_REG2X_R_CLK_SYSTICK_EN_Pos)

#define PCC_REG_PERION_CLK_REG2X_R_10M_SYSTICK_CLK_SRC_SEL_Pos                                   23U
#define PCC_REG_PERION_CLK_REG2X_R_10M_SYSTICK_CLK_SRC_SEL_Msk                                   (0x1UL << PCC_REG_PERION_CLK_REG2X_R_10M_SYSTICK_CLK_SRC_SEL_Pos)

#define PCC_REG_PERION_CLK_REG2X_R_40M_AUDIO_CLK_SRC_SEL_Pos                                     24U
#define PCC_REG_PERION_CLK_REG2X_R_40M_AUDIO_CLK_SRC_SEL_Msk                                     (0x1UL << PCC_REG_PERION_CLK_REG2X_R_40M_AUDIO_CLK_SRC_SEL_Pos)

#define PCC_REG_PERION_CLK_REG2X_R_TIMER_CLK_F40M_SRC_SEL_Pos                                    25U
#define PCC_REG_PERION_CLK_REG2X_R_TIMER_CLK_F40M_SRC_SEL_Msk                                    (0x1UL << PCC_REG_PERION_CLK_REG2X_R_TIMER_CLK_F40M_SRC_SEL_Pos)

#define PCC_REG_PERION_CLK_REG2X_R_UART_CLK_SRC_SEL_Pos                                          26U
#define PCC_REG_PERION_CLK_REG2X_R_UART_CLK_SRC_SEL_Msk                                          (0x1UL << PCC_REG_PERION_CLK_REG2X_R_UART_CLK_SRC_SEL_Pos)

#define PCC_REG_PERION_CLK_REG2X_DUMMY3_Pos                                                      27U
#define PCC_REG_PERION_CLK_REG2X_DUMMY3_Msk                                                      (0x1FUL << PCC_REG_PERION_CLK_REG2X_DUMMY3_Pos)

/* 0x20C    0x4000_020c
    23:0    R/W     RESERVED                                        24'h0
    31:24   R/W     DUMMY4                                          8'h0
 */
typedef union _PCC_REG_PERION_CLK_REG3X_TYPE
{
    uint32_t d32;
    struct
    {
        uint32_t RESERVED: 24;
        uint32_t DUMMY4: 8;
    };
} PCC_REG_PERION_CLK_REG3X_TYPE;

/*0x4000_020c PCC_REG_PERION_CLK_REG3X*/
#define PCC_REG_PERION_CLK_REG3X_RESERVED_Pos                                                    0U
#define PCC_REG_PERION_CLK_REG3X_RESERVED_Msk                                                    (0xFFFFFFUL << PCC_REG_PERION_CLK_REG3X_RESERVED_Pos)

#define PCC_REG_PERION_CLK_REG3X_DUMMY4_Pos                                                      24U
#define PCC_REG_PERION_CLK_REG3X_DUMMY4_Msk                                                      (0xFFUL << PCC_REG_PERION_CLK_REG3X_DUMMY4_Pos)

/* 0x210    0x4000_0210
    0       R/W     R_LS_MCU_ROM                                    1'b0
    1       R/W     R_CODEC_STANDALONE                              1'b0
    11:2    R/W     RESERVED                                        10'h0
    12      R/W     FORCE_QACTIVE_UART0                             1'h0
    13      R/W     FORCE_QACTIVE_UART1                             1'h0
    14      R/W     FORCE_QACTIVE_UART2                             1'h0
    15      R/W     FORCE_QACTIVE_UART3                             1'h0
    16      R/W     FORCE_QACTIVE_IRRC                              1'h0
    17      R/W     FORCE_QACTIVE_AUDIO                             1'h0
    18      R/W     FORCE_QACTIVE_TIMER1                            1'h0
    19      R/W     FORCE_QACTIVE_TIMER2                            1'h0
    20      R/W     FORCE_QACTIVE_TIMER3                            1'h0
    21      R/W     FORCE_QACTIVE_TIMER4                            1'h0
    22      R/W     FORCE_QACTIVE_TIMER5                            1'h0
    23      R/W     FORCE_QACTIVE_TIMER6                            1'h0
    24      R/W     FORCE_QACTIVE_TIMER7                            1'h0
    25      R/W     FORCE_QACTIVE_TIMER8                            1'h0
    26      R/W     FORCE_QACTIVE_TIMER9                            1'h0
    27      R/W     FORCE_QACTIVE_TIMER10                           1'h0
    28      R/W     FORCE_QACTIVE_TIMER11                           1'h0
    29      R/W     FORCE_QACTIVE_ETIMER                            1'h0
    30      R/W     FORCE_QACTIVE_RFC                               1'h0
    31      R/W     FORCE_QACTIVE_MODEM                             1'h0
 */
typedef union _PCC_REG_PERION_CLK_REG4X_TYPE
{
    uint32_t d32;
    struct
    {
        uint32_t R_LS_MCU_ROM: 1;
        uint32_t R_CODEC_STANDALONE: 1;
        uint32_t RESERVED: 10;
        uint32_t FORCE_QACTIVE_UART0: 1;
        uint32_t FORCE_QACTIVE_UART1: 1;
        uint32_t FORCE_QACTIVE_UART2: 1;
        uint32_t FORCE_QACTIVE_UART3: 1;
        uint32_t FORCE_QACTIVE_IRRC: 1;
        uint32_t FORCE_QACTIVE_AUDIO: 1;
        uint32_t FORCE_QACTIVE_TIMER1: 1;
        uint32_t FORCE_QACTIVE_TIMER2: 1;
        uint32_t FORCE_QACTIVE_TIMER3: 1;
        uint32_t FORCE_QACTIVE_TIMER4: 1;
        uint32_t FORCE_QACTIVE_TIMER5: 1;
        uint32_t FORCE_QACTIVE_TIMER6: 1;
        uint32_t FORCE_QACTIVE_TIMER7: 1;
        uint32_t FORCE_QACTIVE_TIMER8: 1;
        uint32_t FORCE_QACTIVE_TIMER9: 1;
        uint32_t FORCE_QACTIVE_TIMER10: 1;
        uint32_t FORCE_QACTIVE_TIMER11: 1;
        uint32_t FORCE_QACTIVE_ETIMER: 1;
        uint32_t FORCE_QACTIVE_RFC: 1;
        uint32_t FORCE_QACTIVE_MODEM: 1;
    };
} PCC_REG_PERION_CLK_REG4X_TYPE;

/*0x4000_0210 PCC_REG_PERION_CLK_REG4X*/
#define PCC_REG_PERION_CLK_REG4X_R_LS_MCU_ROM_Pos                                                0U
#define PCC_REG_PERION_CLK_REG4X_R_LS_MCU_ROM_Msk                                                (0x1UL << PCC_REG_PERION_CLK_REG4X_R_LS_MCU_ROM_Pos)

#define PCC_REG_PERION_CLK_REG4X_R_CODEC_STANDALONE_Pos                                          1U
#define PCC_REG_PERION_CLK_REG4X_R_CODEC_STANDALONE_Msk                                          (0x1UL << PCC_REG_PERION_CLK_REG4X_R_CODEC_STANDALONE_Pos)

#define PCC_REG_PERION_CLK_REG4X_RESERVED_Pos                                                    2U
#define PCC_REG_PERION_CLK_REG4X_RESERVED_Msk                                                    (0x3FFUL << PCC_REG_PERION_CLK_REG4X_RESERVED_Pos)

#define PCC_REG_PERION_CLK_REG4X_FORCE_QACTIVE_UART0_Pos                                         12U
#define PCC_REG_PERION_CLK_REG4X_FORCE_QACTIVE_UART0_Msk                                         (0x1UL << PCC_REG_PERION_CLK_REG4X_FORCE_QACTIVE_UART0_Pos)

