rtkconnectivity/hal_realtek_mainline/bee/soc/inc/rtl87x2j/pcc_reg.h
#define PCC_REG_PERION_CLK_REG4X_FORCE_QACTIVE_UART1_Pos                                         13U
#define PCC_REG_PERION_CLK_REG4X_FORCE_QACTIVE_UART1_Msk                                         (0x1UL << PCC_REG_PERION_CLK_REG4X_FORCE_QACTIVE_UART1_Pos)

#define PCC_REG_PERION_CLK_REG4X_FORCE_QACTIVE_UART2_Pos                                         14U
#define PCC_REG_PERION_CLK_REG4X_FORCE_QACTIVE_UART2_Msk                                         (0x1UL << PCC_REG_PERION_CLK_REG4X_FORCE_QACTIVE_UART2_Pos)

#define PCC_REG_PERION_CLK_REG4X_FORCE_QACTIVE_UART3_Pos                                         15U
#define PCC_REG_PERION_CLK_REG4X_FORCE_QACTIVE_UART3_Msk                                         (0x1UL << PCC_REG_PERION_CLK_REG4X_FORCE_QACTIVE_UART3_Pos)

#define PCC_REG_PERION_CLK_REG4X_FORCE_QACTIVE_IRRC_Pos                                          16U
#define PCC_REG_PERION_CLK_REG4X_FORCE_QACTIVE_IRRC_Msk                                          (0x1UL << PCC_REG_PERION_CLK_REG4X_FORCE_QACTIVE_IRRC_Pos)

#define PCC_REG_PERION_CLK_REG4X_FORCE_QACTIVE_AUDIO_Pos                                         17U
#define PCC_REG_PERION_CLK_REG4X_FORCE_QACTIVE_AUDIO_Msk                                         (0x1UL << PCC_REG_PERION_CLK_REG4X_FORCE_QACTIVE_AUDIO_Pos)

#define PCC_REG_PERION_CLK_REG4X_FORCE_QACTIVE_TIMER1_Pos                                        18U
#define PCC_REG_PERION_CLK_REG4X_FORCE_QACTIVE_TIMER1_Msk                                        (0x1UL << PCC_REG_PERION_CLK_REG4X_FORCE_QACTIVE_TIMER1_Pos)

#define PCC_REG_PERION_CLK_REG4X_FORCE_QACTIVE_TIMER2_Pos                                        19U
#define PCC_REG_PERION_CLK_REG4X_FORCE_QACTIVE_TIMER2_Msk                                        (0x1UL << PCC_REG_PERION_CLK_REG4X_FORCE_QACTIVE_TIMER2_Pos)

#define PCC_REG_PERION_CLK_REG4X_FORCE_QACTIVE_TIMER3_Pos                                        20U
#define PCC_REG_PERION_CLK_REG4X_FORCE_QACTIVE_TIMER3_Msk                                        (0x1UL << PCC_REG_PERION_CLK_REG4X_FORCE_QACTIVE_TIMER3_Pos)

#define PCC_REG_PERION_CLK_REG4X_FORCE_QACTIVE_TIMER4_Pos                                        21U
#define PCC_REG_PERION_CLK_REG4X_FORCE_QACTIVE_TIMER4_Msk                                        (0x1UL << PCC_REG_PERION_CLK_REG4X_FORCE_QACTIVE_TIMER4_Pos)

#define PCC_REG_PERION_CLK_REG4X_FORCE_QACTIVE_TIMER5_Pos                                        22U
#define PCC_REG_PERION_CLK_REG4X_FORCE_QACTIVE_TIMER5_Msk                                        (0x1UL << PCC_REG_PERION_CLK_REG4X_FORCE_QACTIVE_TIMER5_Pos)

#define PCC_REG_PERION_CLK_REG4X_FORCE_QACTIVE_TIMER6_Pos                                        23U
#define PCC_REG_PERION_CLK_REG4X_FORCE_QACTIVE_TIMER6_Msk                                        (0x1UL << PCC_REG_PERION_CLK_REG4X_FORCE_QACTIVE_TIMER6_Pos)

#define PCC_REG_PERION_CLK_REG4X_FORCE_QACTIVE_TIMER7_Pos                                        24U
#define PCC_REG_PERION_CLK_REG4X_FORCE_QACTIVE_TIMER7_Msk                                        (0x1UL << PCC_REG_PERION_CLK_REG4X_FORCE_QACTIVE_TIMER7_Pos)

#define PCC_REG_PERION_CLK_REG4X_FORCE_QACTIVE_TIMER8_Pos                                        25U
#define PCC_REG_PERION_CLK_REG4X_FORCE_QACTIVE_TIMER8_Msk                                        (0x1UL << PCC_REG_PERION_CLK_REG4X_FORCE_QACTIVE_TIMER8_Pos)

#define PCC_REG_PERION_CLK_REG4X_FORCE_QACTIVE_TIMER9_Pos                                        26U
#define PCC_REG_PERION_CLK_REG4X_FORCE_QACTIVE_TIMER9_Msk                                        (0x1UL << PCC_REG_PERION_CLK_REG4X_FORCE_QACTIVE_TIMER9_Pos)

#define PCC_REG_PERION_CLK_REG4X_FORCE_QACTIVE_TIMER10_Pos                                       27U
#define PCC_REG_PERION_CLK_REG4X_FORCE_QACTIVE_TIMER10_Msk                                       (0x1UL << PCC_REG_PERION_CLK_REG4X_FORCE_QACTIVE_TIMER10_Pos)

#define PCC_REG_PERION_CLK_REG4X_FORCE_QACTIVE_TIMER11_Pos                                       28U
#define PCC_REG_PERION_CLK_REG4X_FORCE_QACTIVE_TIMER11_Msk                                       (0x1UL << PCC_REG_PERION_CLK_REG4X_FORCE_QACTIVE_TIMER11_Pos)

#define PCC_REG_PERION_CLK_REG4X_FORCE_QACTIVE_ETIMER_Pos                                        29U
#define PCC_REG_PERION_CLK_REG4X_FORCE_QACTIVE_ETIMER_Msk                                        (0x1UL << PCC_REG_PERION_CLK_REG4X_FORCE_QACTIVE_ETIMER_Pos)

#define PCC_REG_PERION_CLK_REG4X_FORCE_QACTIVE_RFC_Pos                                           30U
#define PCC_REG_PERION_CLK_REG4X_FORCE_QACTIVE_RFC_Msk                                           (0x1UL << PCC_REG_PERION_CLK_REG4X_FORCE_QACTIVE_RFC_Pos)

#define PCC_REG_PERION_CLK_REG4X_FORCE_QACTIVE_MODEM_Pos                                         31U
#define PCC_REG_PERION_CLK_REG4X_FORCE_QACTIVE_MODEM_Msk                                         (0x1UL << PCC_REG_PERION_CLK_REG4X_FORCE_QACTIVE_MODEM_Pos)

/* 0x214    0x4000_0214
    6:0     R/W     R_PRO_AHB_WAIT_CNT                              7'h3
    26:7    R/W     RESERVED                                        20'b0
    31:27   R/W     DUMMY6                                          5'b0
 */
typedef union _PCC_REG_PERION_CLK_REG5X_TYPE
{
    uint32_t d32;
    struct
    {
        uint32_t R_PRO_AHB_WAIT_CNT: 7;
        uint32_t RESERVED: 20;
        uint32_t DUMMY6: 5;
    };
} PCC_REG_PERION_CLK_REG5X_TYPE;

/*0x4000_0214 PCC_REG_PERION_CLK_REG5X*/
#define PCC_REG_PERION_CLK_REG5X_R_PRO_AHB_WAIT_CNT_Pos                                          0U
#define PCC_REG_PERION_CLK_REG5X_R_PRO_AHB_WAIT_CNT_Msk                                          (0x7FUL << PCC_REG_PERION_CLK_REG5X_R_PRO_AHB_WAIT_CNT_Pos)

#define PCC_REG_PERION_CLK_REG5X_RESERVED_Pos                                                    7U
#define PCC_REG_PERION_CLK_REG5X_RESERVED_Msk                                                    (0xFFFFFUL << PCC_REG_PERION_CLK_REG5X_RESERVED_Pos)

#define PCC_REG_PERION_CLK_REG5X_DUMMY6_Pos                                                      27U
#define PCC_REG_PERION_CLK_REG5X_DUMMY6_Msk                                                      (0x1FUL << PCC_REG_PERION_CLK_REG5X_DUMMY6_Pos)

/* 0x218    0x4000_0218
    7:0     R/W     ENTRY_DELAY_CORE1_DEV_RNG                       8'b0
    8       R/W     RESERVED_12                                     1'b0
    9       R/W     RESERVED_11                                     1'b1
    10      R/W     RESERVED_10                                     1'b0
    11      R/W     RESERVED_9                                      1'b1
    12      R/W     RESERVED_8                                      1'b1
    13      R/W     RESERVED_7                                      1'b0
    14      R/W     RESERVED_6                                      1'b1
    15      R/W     RESERVED_5                                      1'b0
    16      R/W     R_CKE_RNG                                       1'b0
    17      R/W     RNG_CLK_FORCE                                   1'b0
    20:18   R/W     RSVD_1                                          3'b000
    21      R/W     RESERVED_4                                      1'b0
    22      R/W     RESERVED_3                                      1'b0
    23      R/W     RESERVED_2                                      1'b0
    24      R/W     RESERVED_1                                      1'b0
    27:25   R/W     R_RNG_SFOSC_DIV_SEL                             3'h0
    30:28   R/W     RSVD                                            3'b000
    31      R/W     RESERVED                                        1'b0
 */
typedef union _PCC_REG_TRNG_TYPE
{
    uint32_t d32;
    struct
    {
        uint32_t ENTRY_DELAY_CORE1_DEV_RNG: 8;
        uint32_t RESERVED_12: 1;
        uint32_t RESERVED_11: 1;
        uint32_t RESERVED_10: 1;
        uint32_t RESERVED_9: 1;
        uint32_t RESERVED_8: 1;
        uint32_t RESERVED_7: 1;
        uint32_t RESERVED_6: 1;
        uint32_t RESERVED_5: 1;
        uint32_t R_CKE_RNG: 1;
        uint32_t RNG_CLK_FORCE: 1;
        uint32_t RSVD_1: 3;
        uint32_t RESERVED_4: 1;
        uint32_t RESERVED_3: 1;
        uint32_t RESERVED_2: 1;
        uint32_t RESERVED_1: 1;
        uint32_t R_RNG_SFOSC_DIV_SEL: 3;
        uint32_t RSVD: 3;
        uint32_t RESERVED: 1;
    };
} PCC_REG_TRNG_TYPE;

/*0x4000_0218 PCC_REG_TRNG*/
#define PCC_REG_TRNG_ENTRY_DELAY_CORE1_DEV_RNG_Pos                                               0U
#define PCC_REG_TRNG_ENTRY_DELAY_CORE1_DEV_RNG_Msk                                               (0xFFUL << PCC_REG_TRNG_ENTRY_DELAY_CORE1_DEV_RNG_Pos)

#define PCC_REG_TRNG_RESERVED_12_Pos                                                             8U
#define PCC_REG_TRNG_RESERVED_12_Msk                                                             (0x1UL << PCC_REG_TRNG_RESERVED_12_Pos)

