rtkconnectivity/hal_realtek_mainline/bee/soc/inc/rtl87x2j/pcc_reg.h
#define PCC_REG_DMA_RESERVED_1_Pos                                                               22U
#define PCC_REG_DMA_RESERVED_1_Msk                                                               (0x1UL << PCC_REG_DMA_RESERVED_1_Pos)

#define PCC_REG_DMA_GDMA0_MANU_SEL_Pos                                                           23U
#define PCC_REG_DMA_GDMA0_MANU_SEL_Msk                                                           (0x1UL << PCC_REG_DMA_GDMA0_MANU_SEL_Pos)

#define PCC_REG_DMA_GDMA0_MANU_DAT_Pos                                                           24U
#define PCC_REG_DMA_GDMA0_MANU_DAT_Msk                                                           (0x1UL << PCC_REG_DMA_GDMA0_MANU_DAT_Pos)

#define PCC_REG_DMA_DMA_CG_CTRL_Pos                                                              25U
#define PCC_REG_DMA_DMA_CG_CTRL_Msk                                                              (0x3UL << PCC_REG_DMA_DMA_CG_CTRL_Pos)

#define PCC_REG_DMA_BZDMA_AUTOSLOW_ECO_DISABLE_Pos                                               27U
#define PCC_REG_DMA_BZDMA_AUTOSLOW_ECO_DISABLE_Msk                                               (0x1UL << PCC_REG_DMA_BZDMA_AUTOSLOW_ECO_DISABLE_Pos)

#define PCC_REG_DMA_RSVD_Pos                                                                     28U
#define PCC_REG_DMA_RSVD_Msk                                                                     (0x7UL << PCC_REG_DMA_RSVD_Pos)

#define PCC_REG_DMA_RESERVED_Pos                                                                 31U
#define PCC_REG_DMA_RESERVED_Msk                                                                 (0x1UL << PCC_REG_DMA_RESERVED_Pos)

/* 0x230    0x4000_0230
    7:0     R/W     ENTRY_DELAY_CORE1_DEV_SPIC0                     8'b0
    8       R/W     RESERVED_9                                      1'b1
    9       R/W     RESERVED_8                                      1'b1
    10      R/W     RESERVED_7                                      1'b1
    11      R/W     RESERVED_6                                      1'b1
    12      R/W     RESERVED_5                                      1'b1
    13      R/W     RESERVED_4                                      1'b1
    15:14   R/W     RESERVED_3                                      2'b0
    18:16   R/W     SPIC0_DIV_SEL                                   3'h0
    19      R/W     SPIC0_CLK_SRC_SEL                               1'b0
    20      R/W     FMC0_CLK_FORCE                                  1'b0
    21      R/W     RESERVED_2                                      1'b0
    22      R/W     RESERVED_1                                      1'b0
    28:23   R/W     R_PON_DLYSEL_FMC0                               6'h0
    29      R/W     SPIC0_MANU_SEL                                  1'b0
    30      R/W     SPIC0_MANU_DAT                                  1'b0
    31      R/W     RESERVED                                        1'b0
 */
typedef union _PCC_REG_SPIC_TYPE
{
    uint32_t d32;
    struct
    {
        uint32_t ENTRY_DELAY_CORE1_DEV_SPIC0: 8;
        uint32_t RESERVED_9: 1;
        uint32_t RESERVED_8: 1;
        uint32_t RESERVED_7: 1;
        uint32_t RESERVED_6: 1;
        uint32_t RESERVED_5: 1;
        uint32_t RESERVED_4: 1;
        uint32_t RESERVED_3: 2;
        uint32_t SPIC0_DIV_SEL: 3;
        uint32_t SPIC0_CLK_SRC_SEL: 1;
        uint32_t FMC0_CLK_FORCE: 1;
        uint32_t RESERVED_2: 1;
        uint32_t RESERVED_1: 1;
        uint32_t R_PON_DLYSEL_FMC0: 6;
        uint32_t SPIC0_MANU_SEL: 1;
        uint32_t SPIC0_MANU_DAT: 1;
        uint32_t RESERVED: 1;
    };
} PCC_REG_SPIC_TYPE;

/*0x4000_0230 PCC_REG_SPIC*/
#define PCC_REG_SPIC_ENTRY_DELAY_CORE1_DEV_SPIC0_Pos                                             0U
#define PCC_REG_SPIC_ENTRY_DELAY_CORE1_DEV_SPIC0_Msk                                             (0xFFUL << PCC_REG_SPIC_ENTRY_DELAY_CORE1_DEV_SPIC0_Pos)

#define PCC_REG_SPIC_RESERVED_9_Pos                                                              8U
#define PCC_REG_SPIC_RESERVED_9_Msk                                                              (0x1UL << PCC_REG_SPIC_RESERVED_9_Pos)

#define PCC_REG_SPIC_RESERVED_8_Pos                                                              9U
#define PCC_REG_SPIC_RESERVED_8_Msk                                                              (0x1UL << PCC_REG_SPIC_RESERVED_8_Pos)

#define PCC_REG_SPIC_RESERVED_7_Pos                                                              10U
#define PCC_REG_SPIC_RESERVED_7_Msk                                                              (0x1UL << PCC_REG_SPIC_RESERVED_7_Pos)

#define PCC_REG_SPIC_RESERVED_6_Pos                                                              11U
#define PCC_REG_SPIC_RESERVED_6_Msk                                                              (0x1UL << PCC_REG_SPIC_RESERVED_6_Pos)

#define PCC_REG_SPIC_RESERVED_5_Pos                                                              12U
#define PCC_REG_SPIC_RESERVED_5_Msk                                                              (0x1UL << PCC_REG_SPIC_RESERVED_5_Pos)

#define PCC_REG_SPIC_RESERVED_4_Pos                                                              13U
#define PCC_REG_SPIC_RESERVED_4_Msk                                                              (0x1UL << PCC_REG_SPIC_RESERVED_4_Pos)

#define PCC_REG_SPIC_RESERVED_3_Pos                                                              14U
#define PCC_REG_SPIC_RESERVED_3_Msk                                                              (0x3UL << PCC_REG_SPIC_RESERVED_3_Pos)

#define PCC_REG_SPIC_SPIC0_DIV_SEL_Pos                                                           16U
#define PCC_REG_SPIC_SPIC0_DIV_SEL_Msk                                                           (0x7UL << PCC_REG_SPIC_SPIC0_DIV_SEL_Pos)

#define PCC_REG_SPIC_SPIC0_CLK_SRC_SEL_Pos                                                       19U
#define PCC_REG_SPIC_SPIC0_CLK_SRC_SEL_Msk                                                       (0x1UL << PCC_REG_SPIC_SPIC0_CLK_SRC_SEL_Pos)

#define PCC_REG_SPIC_FMC0_CLK_FORCE_Pos                                                          20U
#define PCC_REG_SPIC_FMC0_CLK_FORCE_Msk                                                          (0x1UL << PCC_REG_SPIC_FMC0_CLK_FORCE_Pos)

#define PCC_REG_SPIC_RESERVED_2_Pos                                                              21U
#define PCC_REG_SPIC_RESERVED_2_Msk                                                              (0x1UL << PCC_REG_SPIC_RESERVED_2_Pos)

