rtkconnectivity/hal_realtek_mainline/bee/soc/inc/rtl87x2j/pcc_reg.h
#define PCC_REG_SPIC_RESERVED_1_Pos                                                              22U
#define PCC_REG_SPIC_RESERVED_1_Msk                                                              (0x1UL << PCC_REG_SPIC_RESERVED_1_Pos)

#define PCC_REG_SPIC_R_PON_DLYSEL_FMC0_Pos                                                       23U
#define PCC_REG_SPIC_R_PON_DLYSEL_FMC0_Msk                                                       (0x3FUL << PCC_REG_SPIC_R_PON_DLYSEL_FMC0_Pos)

#define PCC_REG_SPIC_SPIC0_MANU_SEL_Pos                                                          29U
#define PCC_REG_SPIC_SPIC0_MANU_SEL_Msk                                                          (0x1UL << PCC_REG_SPIC_SPIC0_MANU_SEL_Pos)

#define PCC_REG_SPIC_SPIC0_MANU_DAT_Pos                                                          30U
#define PCC_REG_SPIC_SPIC0_MANU_DAT_Msk                                                          (0x1UL << PCC_REG_SPIC_SPIC0_MANU_DAT_Pos)

#define PCC_REG_SPIC_RESERVED_Pos                                                                31U
#define PCC_REG_SPIC_RESERVED_Msk                                                                (0x1UL << PCC_REG_SPIC_RESERVED_Pos)

/* 0x234    0x4000_0234
    7:0     R/W     ENTRY_DELAY_CORE1_DEV_SPI0                      8'b0
    8       R/W     RESERVED_9                                      1'b1
    9       R/W     RESERVED_8                                      1'b1
    10      R/W     RESERVED_7                                      1'b1
    11      R/W     RESERVED_6                                      1'b1
    12      R/W     RESERVED_5                                      1'b1
    13      R/W     RESERVED_4                                      1'b1
    14      R/W     RESERVED_3                                      1'b1
    15      R/W     RESERVED_2                                      1'b0
    18:16   R/W     R_SPI0_CLK_DIV_SEL                              3'h0
    19      R/W     R_SPI0_CLK_SRC_SEL                              1'b0
    20      R/W     RESERVED_1                                      1'b0
    21      R/W     SPI0_CLK_FORCE                                  1'b0
    22      R/W     PON_SPI0_MST                                    1'b0
    23      R/W     PON_SPI0_H2S_BRG_EN                             1'b0
    24      R/W     PON_SPI0_BRG_EN                                 1'b0
    25      R/W     R_CPU_SLOW_OPT_SPI0                             1'b0
    26      W1O     R_SPI0_DIV_SEL_OPT                              1'b0
    27      W1O     R_SPI0_DIV_SEL_OPT1                             1'b0
    30:28   R/W     RSVD                                            3'b00
    31      R/W     RESERVED                                        1'b0
 */
typedef union _PCC_REG_SPI0_TYPE
{
    uint32_t d32;
    struct
    {
        uint32_t ENTRY_DELAY_CORE1_DEV_SPI0: 8;
        uint32_t RESERVED_9: 1;
        uint32_t RESERVED_8: 1;
        uint32_t RESERVED_7: 1;
        uint32_t RESERVED_6: 1;
        uint32_t RESERVED_5: 1;
        uint32_t RESERVED_4: 1;
        uint32_t RESERVED_3: 1;
        uint32_t RESERVED_2: 1;
        uint32_t R_SPI0_CLK_DIV_SEL: 3;
        uint32_t R_SPI0_CLK_SRC_SEL: 1;
        uint32_t RESERVED_1: 1;
        uint32_t SPI0_CLK_FORCE: 1;
        uint32_t PON_SPI0_MST: 1;
        uint32_t PON_SPI0_H2S_BRG_EN: 1;
        uint32_t PON_SPI0_BRG_EN: 1;
        uint32_t R_CPU_SLOW_OPT_SPI0: 1;
        uint32_t R_SPI0_DIV_SEL_OPT: 1;
        uint32_t R_SPI0_DIV_SEL_OPT1: 1;
        uint32_t RSVD: 3;
        uint32_t RESERVED: 1;
    };
} PCC_REG_SPI0_TYPE;

/*0x4000_0234 PCC_REG_SPI0*/
#define PCC_REG_SPI0_ENTRY_DELAY_CORE1_DEV_SPI0_Pos                                              0U
#define PCC_REG_SPI0_ENTRY_DELAY_CORE1_DEV_SPI0_Msk                                              (0xFFUL << PCC_REG_SPI0_ENTRY_DELAY_CORE1_DEV_SPI0_Pos)

#define PCC_REG_SPI0_RESERVED_9_Pos                                                              8U
#define PCC_REG_SPI0_RESERVED_9_Msk                                                              (0x1UL << PCC_REG_SPI0_RESERVED_9_Pos)

#define PCC_REG_SPI0_RESERVED_8_Pos                                                              9U
#define PCC_REG_SPI0_RESERVED_8_Msk                                                              (0x1UL << PCC_REG_SPI0_RESERVED_8_Pos)

#define PCC_REG_SPI0_RESERVED_7_Pos                                                              10U
#define PCC_REG_SPI0_RESERVED_7_Msk                                                              (0x1UL << PCC_REG_SPI0_RESERVED_7_Pos)

#define PCC_REG_SPI0_RESERVED_6_Pos                                                              11U
#define PCC_REG_SPI0_RESERVED_6_Msk                                                              (0x1UL << PCC_REG_SPI0_RESERVED_6_Pos)

#define PCC_REG_SPI0_RESERVED_5_Pos                                                              12U
#define PCC_REG_SPI0_RESERVED_5_Msk                                                              (0x1UL << PCC_REG_SPI0_RESERVED_5_Pos)

#define PCC_REG_SPI0_RESERVED_4_Pos                                                              13U
#define PCC_REG_SPI0_RESERVED_4_Msk                                                              (0x1UL << PCC_REG_SPI0_RESERVED_4_Pos)

#define PCC_REG_SPI0_RESERVED_3_Pos                                                              14U
#define PCC_REG_SPI0_RESERVED_3_Msk                                                              (0x1UL << PCC_REG_SPI0_RESERVED_3_Pos)

#define PCC_REG_SPI0_RESERVED_2_Pos                                                              15U
#define PCC_REG_SPI0_RESERVED_2_Msk                                                              (0x1UL << PCC_REG_SPI0_RESERVED_2_Pos)

#define PCC_REG_SPI0_R_SPI0_CLK_DIV_SEL_Pos                                                      16U
#define PCC_REG_SPI0_R_SPI0_CLK_DIV_SEL_Msk                                                      (0x7UL << PCC_REG_SPI0_R_SPI0_CLK_DIV_SEL_Pos)

