rtkconnectivity/hal_realtek_mainline/bee/soc/inc/rtl87x2j/pcc_reg.h
#define PCC_REG_SPI0_R_SPI0_CLK_SRC_SEL_Pos                                                      19U
#define PCC_REG_SPI0_R_SPI0_CLK_SRC_SEL_Msk                                                      (0x1UL << PCC_REG_SPI0_R_SPI0_CLK_SRC_SEL_Pos)

#define PCC_REG_SPI0_RESERVED_1_Pos                                                              20U
#define PCC_REG_SPI0_RESERVED_1_Msk                                                              (0x1UL << PCC_REG_SPI0_RESERVED_1_Pos)

#define PCC_REG_SPI0_SPI0_CLK_FORCE_Pos                                                          21U
#define PCC_REG_SPI0_SPI0_CLK_FORCE_Msk                                                          (0x1UL << PCC_REG_SPI0_SPI0_CLK_FORCE_Pos)

#define PCC_REG_SPI0_PON_SPI0_MST_Pos                                                            22U
#define PCC_REG_SPI0_PON_SPI0_MST_Msk                                                            (0x1UL << PCC_REG_SPI0_PON_SPI0_MST_Pos)

#define PCC_REG_SPI0_PON_SPI0_H2S_BRG_EN_Pos                                                     23U
#define PCC_REG_SPI0_PON_SPI0_H2S_BRG_EN_Msk                                                     (0x1UL << PCC_REG_SPI0_PON_SPI0_H2S_BRG_EN_Pos)

#define PCC_REG_SPI0_PON_SPI0_BRG_EN_Pos                                                         24U
#define PCC_REG_SPI0_PON_SPI0_BRG_EN_Msk                                                         (0x1UL << PCC_REG_SPI0_PON_SPI0_BRG_EN_Pos)

#define PCC_REG_SPI0_R_CPU_SLOW_OPT_SPI0_Pos                                                     25U
#define PCC_REG_SPI0_R_CPU_SLOW_OPT_SPI0_Msk                                                     (0x1UL << PCC_REG_SPI0_R_CPU_SLOW_OPT_SPI0_Pos)

#define PCC_REG_SPI0_R_SPI0_DIV_SEL_OPT_Pos                                                      26U
#define PCC_REG_SPI0_R_SPI0_DIV_SEL_OPT_Msk                                                      (0x1UL << PCC_REG_SPI0_R_SPI0_DIV_SEL_OPT_Pos)

#define PCC_REG_SPI0_R_SPI0_DIV_SEL_OPT1_Pos                                                     27U
#define PCC_REG_SPI0_R_SPI0_DIV_SEL_OPT1_Msk                                                     (0x1UL << PCC_REG_SPI0_R_SPI0_DIV_SEL_OPT1_Pos)

#define PCC_REG_SPI0_RSVD_Pos                                                                    28U
#define PCC_REG_SPI0_RSVD_Msk                                                                    (0x7UL << PCC_REG_SPI0_RSVD_Pos)

#define PCC_REG_SPI0_RESERVED_Pos                                                                31U
#define PCC_REG_SPI0_RESERVED_Msk                                                                (0x1UL << PCC_REG_SPI0_RESERVED_Pos)

/* 0x238    0x4000_0238
    7:0     R/W     ENTRY_DELAY_CORE1_DEV_SPI1                      8'b0
    8       R/W     RESERVED_8                                      1'b1
    9       R/W     RESERVED_7                                      1'b1
    10      R/W     RESERVED_6                                      1'b1
    11      R/W     RESERVED_5                                      1'b1
    12      R/W     RESERVED_4                                      1'b1
    13      R/W     RESERVED_3                                      1'b1
    14      R/W     RESERVED_2                                      1'b1
    17:15   R/W     R_SPI1_CLK_DIV_SEL                              3'h0
    18      R/W     R_SPI1_CLK_SRC_SEL                              1'b0
    19      R/W     SPI1_CLK_FORCE                                  1'b0
    23:20   R/W     RESERVED_1                                      4'b0
    24      R/W     PON_SPI1_H2S_BRG_EN                             1'b0
    25      R/W     PON_SPI1_BRG_EN                                 1'b0
    26      W1O     R_SPI1_DIV_SEL_OPT                              1'b0
    27      W1O     R_SPI1_DIV_SEL_OPT1                             1'b0
    30:28   R/W     RSVD                                            3'b0
    31      R/W     RESERVED                                        1'b0
 */
typedef union _PCC_REG_SPI1_TYPE
{
    uint32_t d32;
    struct
    {
        uint32_t ENTRY_DELAY_CORE1_DEV_SPI1: 8;
        uint32_t RESERVED_8: 1;
        uint32_t RESERVED_7: 1;
        uint32_t RESERVED_6: 1;
        uint32_t RESERVED_5: 1;
        uint32_t RESERVED_4: 1;
        uint32_t RESERVED_3: 1;
        uint32_t RESERVED_2: 1;
        uint32_t R_SPI1_CLK_DIV_SEL: 3;
        uint32_t R_SPI1_CLK_SRC_SEL: 1;
        uint32_t SPI1_CLK_FORCE: 1;
        uint32_t RESERVED_1: 4;
        uint32_t PON_SPI1_H2S_BRG_EN: 1;
        uint32_t PON_SPI1_BRG_EN: 1;
        uint32_t R_SPI1_DIV_SEL_OPT: 1;
        uint32_t R_SPI1_DIV_SEL_OPT1: 1;
        uint32_t RSVD: 3;
        uint32_t RESERVED: 1;
    };
} PCC_REG_SPI1_TYPE;

/*0x4000_0238 PCC_REG_SPI1*/
#define PCC_REG_SPI1_ENTRY_DELAY_CORE1_DEV_SPI1_Pos                                              0U
#define PCC_REG_SPI1_ENTRY_DELAY_CORE1_DEV_SPI1_Msk                                              (0xFFUL << PCC_REG_SPI1_ENTRY_DELAY_CORE1_DEV_SPI1_Pos)

#define PCC_REG_SPI1_RESERVED_8_Pos                                                              8U
#define PCC_REG_SPI1_RESERVED_8_Msk                                                              (0x1UL << PCC_REG_SPI1_RESERVED_8_Pos)

#define PCC_REG_SPI1_RESERVED_7_Pos                                                              9U
#define PCC_REG_SPI1_RESERVED_7_Msk                                                              (0x1UL << PCC_REG_SPI1_RESERVED_7_Pos)

#define PCC_REG_SPI1_RESERVED_6_Pos                                                              10U
#define PCC_REG_SPI1_RESERVED_6_Msk                                                              (0x1UL << PCC_REG_SPI1_RESERVED_6_Pos)

#define PCC_REG_SPI1_RESERVED_5_Pos                                                              11U
#define PCC_REG_SPI1_RESERVED_5_Msk                                                              (0x1UL << PCC_REG_SPI1_RESERVED_5_Pos)

#define PCC_REG_SPI1_RESERVED_4_Pos                                                              12U
#define PCC_REG_SPI1_RESERVED_4_Msk                                                              (0x1UL << PCC_REG_SPI1_RESERVED_4_Pos)

#define PCC_REG_SPI1_RESERVED_3_Pos                                                              13U
#define PCC_REG_SPI1_RESERVED_3_Msk                                                              (0x1UL << PCC_REG_SPI1_RESERVED_3_Pos)

#define PCC_REG_SPI1_RESERVED_2_Pos                                                              14U
#define PCC_REG_SPI1_RESERVED_2_Msk                                                              (0x1UL << PCC_REG_SPI1_RESERVED_2_Pos)

