rtkconnectivity/hal_realtek_mainline/bee/soc/inc/rtl87x2j/pcc_reg.h
#define PCC_REG_SPI1_R_SPI1_CLK_DIV_SEL_Pos                                                      15U
#define PCC_REG_SPI1_R_SPI1_CLK_DIV_SEL_Msk                                                      (0x7UL << PCC_REG_SPI1_R_SPI1_CLK_DIV_SEL_Pos)

#define PCC_REG_SPI1_R_SPI1_CLK_SRC_SEL_Pos                                                      18U
#define PCC_REG_SPI1_R_SPI1_CLK_SRC_SEL_Msk                                                      (0x1UL << PCC_REG_SPI1_R_SPI1_CLK_SRC_SEL_Pos)

#define PCC_REG_SPI1_SPI1_CLK_FORCE_Pos                                                          19U
#define PCC_REG_SPI1_SPI1_CLK_FORCE_Msk                                                          (0x1UL << PCC_REG_SPI1_SPI1_CLK_FORCE_Pos)

#define PCC_REG_SPI1_RESERVED_1_Pos                                                              20U
#define PCC_REG_SPI1_RESERVED_1_Msk                                                              (0xFUL << PCC_REG_SPI1_RESERVED_1_Pos)

#define PCC_REG_SPI1_PON_SPI1_H2S_BRG_EN_Pos                                                     24U
#define PCC_REG_SPI1_PON_SPI1_H2S_BRG_EN_Msk                                                     (0x1UL << PCC_REG_SPI1_PON_SPI1_H2S_BRG_EN_Pos)

#define PCC_REG_SPI1_PON_SPI1_BRG_EN_Pos                                                         25U
#define PCC_REG_SPI1_PON_SPI1_BRG_EN_Msk                                                         (0x1UL << PCC_REG_SPI1_PON_SPI1_BRG_EN_Pos)

#define PCC_REG_SPI1_R_SPI1_DIV_SEL_OPT_Pos                                                      26U
#define PCC_REG_SPI1_R_SPI1_DIV_SEL_OPT_Msk                                                      (0x1UL << PCC_REG_SPI1_R_SPI1_DIV_SEL_OPT_Pos)

#define PCC_REG_SPI1_R_SPI1_DIV_SEL_OPT1_Pos                                                     27U
#define PCC_REG_SPI1_R_SPI1_DIV_SEL_OPT1_Msk                                                     (0x1UL << PCC_REG_SPI1_R_SPI1_DIV_SEL_OPT1_Pos)

#define PCC_REG_SPI1_RSVD_Pos                                                                    28U
#define PCC_REG_SPI1_RSVD_Msk                                                                    (0x7UL << PCC_REG_SPI1_RSVD_Pos)

#define PCC_REG_SPI1_RESERVED_Pos                                                                31U
#define PCC_REG_SPI1_RESERVED_Msk                                                                (0x1UL << PCC_REG_SPI1_RESERVED_Pos)

/* 0x23C    0x4000_023c
    7:0     R/W     ENTRY_DELAY_CORE1_DEV_SPI2                      8'b0
    8       R/W     RESERVED_8                                      1'b0
    9       R/W     RESERVED_7                                      1'b1
    10      R/W     RESERVED_6                                      1'b1
    11      R/W     RESERVED_5                                      1'b1
    12      R/W     RESERVED_4                                      1'b1
    13      R/W     RESERVED_3                                      1'b1
    15:14   R/W     RESERVED_2                                      2'b0
    18:16   R/W     R_SPI2_CLK_DIV_SEL                              3'h0
    19      R/W     R_SPI2_CLK_SRC_SEL                              1'b0
    20      R/W     SPI2_CLK_FORCE                                  1'b0
    23:21   R/W     RESERVED_1                                      3'b0
    24      R/W     PON_SPI2_H2S_BRG_EN                             1'b0
    25      R/W     PON_SPI2_BRG_EN                                 1'b0
    26      W1O     R_SPI2_DIV_SEL_OPT                              1'b0
    27      W1O     R_SPI2_DIV_SEL_OPT1                             1'b0
    30:28   R/W     RSVD                                            3'b0
    31      R/W     RESERVED                                        1'b0
 */
typedef union _PCC_REG_SPI2_TYPE
{
    uint32_t d32;
    struct
    {
        uint32_t ENTRY_DELAY_CORE1_DEV_SPI2: 8;
        uint32_t RESERVED_8: 1;
        uint32_t RESERVED_7: 1;
        uint32_t RESERVED_6: 1;
        uint32_t RESERVED_5: 1;
        uint32_t RESERVED_4: 1;
        uint32_t RESERVED_3: 1;
        uint32_t RESERVED_2: 2;
        uint32_t R_SPI2_CLK_DIV_SEL: 3;
        uint32_t R_SPI2_CLK_SRC_SEL: 1;
        uint32_t SPI2_CLK_FORCE: 1;
        uint32_t RESERVED_1: 3;
        uint32_t PON_SPI2_H2S_BRG_EN: 1;
        uint32_t PON_SPI2_BRG_EN: 1;
        uint32_t R_SPI2_DIV_SEL_OPT: 1;
        uint32_t R_SPI2_DIV_SEL_OPT1: 1;
        uint32_t RSVD: 3;
        uint32_t RESERVED: 1;
    };
} PCC_REG_SPI2_TYPE;

/*0x4000_023c PCC_REG_SPI2*/
#define PCC_REG_SPI2_ENTRY_DELAY_CORE1_DEV_SPI2_Pos                                              0U
#define PCC_REG_SPI2_ENTRY_DELAY_CORE1_DEV_SPI2_Msk                                              (0xFFUL << PCC_REG_SPI2_ENTRY_DELAY_CORE1_DEV_SPI2_Pos)

#define PCC_REG_SPI2_RESERVED_8_Pos                                                              8U
#define PCC_REG_SPI2_RESERVED_8_Msk                                                              (0x1UL << PCC_REG_SPI2_RESERVED_8_Pos)

#define PCC_REG_SPI2_RESERVED_7_Pos                                                              9U
#define PCC_REG_SPI2_RESERVED_7_Msk                                                              (0x1UL << PCC_REG_SPI2_RESERVED_7_Pos)

#define PCC_REG_SPI2_RESERVED_6_Pos                                                              10U
#define PCC_REG_SPI2_RESERVED_6_Msk                                                              (0x1UL << PCC_REG_SPI2_RESERVED_6_Pos)

#define PCC_REG_SPI2_RESERVED_5_Pos                                                              11U
#define PCC_REG_SPI2_RESERVED_5_Msk                                                              (0x1UL << PCC_REG_SPI2_RESERVED_5_Pos)

#define PCC_REG_SPI2_RESERVED_4_Pos                                                              12U
#define PCC_REG_SPI2_RESERVED_4_Msk                                                              (0x1UL << PCC_REG_SPI2_RESERVED_4_Pos)

#define PCC_REG_SPI2_RESERVED_3_Pos                                                              13U
#define PCC_REG_SPI2_RESERVED_3_Msk                                                              (0x1UL << PCC_REG_SPI2_RESERVED_3_Pos)

#define PCC_REG_SPI2_RESERVED_2_Pos                                                              14U
#define PCC_REG_SPI2_RESERVED_2_Msk                                                              (0x3UL << PCC_REG_SPI2_RESERVED_2_Pos)

#define PCC_REG_SPI2_R_SPI2_CLK_DIV_SEL_Pos                                                      16U
#define PCC_REG_SPI2_R_SPI2_CLK_DIV_SEL_Msk                                                      (0x7UL << PCC_REG_SPI2_R_SPI2_CLK_DIV_SEL_Pos)

#define PCC_REG_SPI2_R_SPI2_CLK_SRC_SEL_Pos                                                      19U
#define PCC_REG_SPI2_R_SPI2_CLK_SRC_SEL_Msk                                                      (0x1UL << PCC_REG_SPI2_R_SPI2_CLK_SRC_SEL_Pos)

#define PCC_REG_SPI2_SPI2_CLK_FORCE_Pos                                                          20U
#define PCC_REG_SPI2_SPI2_CLK_FORCE_Msk                                                          (0x1UL << PCC_REG_SPI2_SPI2_CLK_FORCE_Pos)

#define PCC_REG_SPI2_RESERVED_1_Pos                                                              21U
#define PCC_REG_SPI2_RESERVED_1_Msk                                                              (0x7UL << PCC_REG_SPI2_RESERVED_1_Pos)

