rtkconnectivity/hal_realtek_mainline/bee/soc/inc/rtl87x2j/pcc_reg.h
#define PCC_REG_SPI2_PON_SPI2_H2S_BRG_EN_Pos                                                     24U
#define PCC_REG_SPI2_PON_SPI2_H2S_BRG_EN_Msk                                                     (0x1UL << PCC_REG_SPI2_PON_SPI2_H2S_BRG_EN_Pos)

#define PCC_REG_SPI2_PON_SPI2_BRG_EN_Pos                                                         25U
#define PCC_REG_SPI2_PON_SPI2_BRG_EN_Msk                                                         (0x1UL << PCC_REG_SPI2_PON_SPI2_BRG_EN_Pos)

#define PCC_REG_SPI2_R_SPI2_DIV_SEL_OPT_Pos                                                      26U
#define PCC_REG_SPI2_R_SPI2_DIV_SEL_OPT_Msk                                                      (0x1UL << PCC_REG_SPI2_R_SPI2_DIV_SEL_OPT_Pos)

#define PCC_REG_SPI2_R_SPI2_DIV_SEL_OPT1_Pos                                                     27U
#define PCC_REG_SPI2_R_SPI2_DIV_SEL_OPT1_Msk                                                     (0x1UL << PCC_REG_SPI2_R_SPI2_DIV_SEL_OPT1_Pos)

#define PCC_REG_SPI2_RSVD_Pos                                                                    28U
#define PCC_REG_SPI2_RSVD_Msk                                                                    (0x7UL << PCC_REG_SPI2_RSVD_Pos)

#define PCC_REG_SPI2_RESERVED_Pos                                                                31U
#define PCC_REG_SPI2_RESERVED_Msk                                                                (0x1UL << PCC_REG_SPI2_RESERVED_Pos)

/* 0x240    0x4000_0240
    7:0     R/W     ENTRY_DELAY_CORE1_DEV_I2S0                      8'b0
    8       R/W     RESERVED_7                                      1'b0
    9       R/W     RESERVED_6                                      1'b1
    10      R/W     RESERVED_5                                      1'b1
    11      R/W     RESERVED_4                                      1'b1
    12      R/W     RESERVED_3                                      1'b1
    15:13   R/W     RESERVED_2                                      3'b0
    17:16   R/W     MCLK_SEL                                        2'b00
    20:18   R/W     R_I2S_PLL_CLK_SEL                               3'h4
    21      R/W     RESERVED_1                                      1'b0
    22      R/W     I2S_CLK_FORCE                                   1'b0
    26:23   R/W     RSVD                                            4'b00
    27      R/W     R_SPORT0_EXT_CODEC                              1'b0
    31:28   R/W     RESERVED                                        4'b0
 */
typedef union _PCC_REG_I2S0_TYPE
{
    uint32_t d32;
    struct
    {
        uint32_t ENTRY_DELAY_CORE1_DEV_I2S0: 8;
        uint32_t RESERVED_7: 1;
        uint32_t RESERVED_6: 1;
        uint32_t RESERVED_5: 1;
        uint32_t RESERVED_4: 1;
        uint32_t RESERVED_3: 1;
        uint32_t RESERVED_2: 3;
        uint32_t MCLK_SEL: 2;
        uint32_t R_I2S_PLL_CLK_SEL: 3;
        uint32_t RESERVED_1: 1;
        uint32_t I2S_CLK_FORCE: 1;
        uint32_t RSVD: 4;
        uint32_t R_SPORT0_EXT_CODEC: 1;
        uint32_t RESERVED: 4;
    };
} PCC_REG_I2S0_TYPE;

/*0x4000_0240 PCC_REG_I2S0*/
#define PCC_REG_I2S0_ENTRY_DELAY_CORE1_DEV_I2S0_Pos                                              0U
#define PCC_REG_I2S0_ENTRY_DELAY_CORE1_DEV_I2S0_Msk                                              (0xFFUL << PCC_REG_I2S0_ENTRY_DELAY_CORE1_DEV_I2S0_Pos)

#define PCC_REG_I2S0_RESERVED_7_Pos                                                              8U
#define PCC_REG_I2S0_RESERVED_7_Msk                                                              (0x1UL << PCC_REG_I2S0_RESERVED_7_Pos)

#define PCC_REG_I2S0_RESERVED_6_Pos                                                              9U
#define PCC_REG_I2S0_RESERVED_6_Msk                                                              (0x1UL << PCC_REG_I2S0_RESERVED_6_Pos)

#define PCC_REG_I2S0_RESERVED_5_Pos                                                              10U
#define PCC_REG_I2S0_RESERVED_5_Msk                                                              (0x1UL << PCC_REG_I2S0_RESERVED_5_Pos)

#define PCC_REG_I2S0_RESERVED_4_Pos                                                              11U
#define PCC_REG_I2S0_RESERVED_4_Msk                                                              (0x1UL << PCC_REG_I2S0_RESERVED_4_Pos)

#define PCC_REG_I2S0_RESERVED_3_Pos                                                              12U
#define PCC_REG_I2S0_RESERVED_3_Msk                                                              (0x1UL << PCC_REG_I2S0_RESERVED_3_Pos)

#define PCC_REG_I2S0_RESERVED_2_Pos                                                              13U
#define PCC_REG_I2S0_RESERVED_2_Msk                                                              (0x7UL << PCC_REG_I2S0_RESERVED_2_Pos)

#define PCC_REG_I2S0_MCLK_SEL_Pos                                                                16U
#define PCC_REG_I2S0_MCLK_SEL_Msk                                                                (0x3UL << PCC_REG_I2S0_MCLK_SEL_Pos)

#define PCC_REG_I2S0_R_I2S_PLL_CLK_SEL_Pos                                                       18U
#define PCC_REG_I2S0_R_I2S_PLL_CLK_SEL_Msk                                                       (0x7UL << PCC_REG_I2S0_R_I2S_PLL_CLK_SEL_Pos)

#define PCC_REG_I2S0_RESERVED_1_Pos                                                              21U
#define PCC_REG_I2S0_RESERVED_1_Msk                                                              (0x1UL << PCC_REG_I2S0_RESERVED_1_Pos)

#define PCC_REG_I2S0_I2S_CLK_FORCE_Pos                                                           22U
#define PCC_REG_I2S0_I2S_CLK_FORCE_Msk                                                           (0x1UL << PCC_REG_I2S0_I2S_CLK_FORCE_Pos)

#define PCC_REG_I2S0_RSVD_Pos                                                                    23U
#define PCC_REG_I2S0_RSVD_Msk                                                                    (0xFUL << PCC_REG_I2S0_RSVD_Pos)

#define PCC_REG_I2S0_R_SPORT0_EXT_CODEC_Pos                                                      27U
#define PCC_REG_I2S0_R_SPORT0_EXT_CODEC_Msk                                                      (0x1UL << PCC_REG_I2S0_R_SPORT0_EXT_CODEC_Pos)

#define PCC_REG_I2S0_RESERVED_Pos                                                                28U
#define PCC_REG_I2S0_RESERVED_Msk                                                                (0xFUL << PCC_REG_I2S0_RESERVED_Pos)

/* 0x244    0x4000_0244
    7:0     R/W     ENTRY_DELAY_CORE1_DEV_TIMER0                    8'b0
    8       R/W     RESERVED_8                                      1'b1
    9       R/W     RESERVED_7                                      1'b1
    10      R/W     RESERVED_6                                      1'b1
    11      R/W     RESERVED_5                                      1'b1
    12      R/W     RESERVED_4                                      1'b1
    13      R/W     RESERVED_3                                      1'b1
    14      R/W     RESERVED_2                                      1'b1
    15      R/W     RESERVED_1                                      1'b1
    21:16   R/W     RESERVED                                        6'b0
    22      R/W     RSVD_1                                          1'b0
    23      R/W     RSVD                                            1'b0
    26:24   R/W     R_TIMER_1_CLK_DIV                               3'h0
    29:27   R/W     R_TIMER_2_CLK_DIV                               3'h0
    30      R/W     TIMER0_CH1_CLK_FORCE                            1'b0
    31      R/W     TIMER0_CH2_CLK_FORCE                            1'b0
 */
typedef union _PCC_REG_TIMER0_TYPE
{
    uint32_t d32;
    struct
    {
        uint32_t ENTRY_DELAY_CORE1_DEV_TIMER0: 8;
        uint32_t RESERVED_8: 1;
        uint32_t RESERVED_7: 1;
        uint32_t RESERVED_6: 1;
        uint32_t RESERVED_5: 1;
        uint32_t RESERVED_4: 1;
        uint32_t RESERVED_3: 1;
        uint32_t RESERVED_2: 1;
        uint32_t RESERVED_1: 1;
        uint32_t RESERVED: 6;
        uint32_t RSVD_1: 1;
        uint32_t RSVD: 1;
        uint32_t R_TIMER_1_CLK_DIV: 3;
        uint32_t R_TIMER_2_CLK_DIV: 3;
        uint32_t TIMER0_CH1_CLK_FORCE: 1;
        uint32_t TIMER0_CH2_CLK_FORCE: 1;
    };
} PCC_REG_TIMER0_TYPE;

