rtkconnectivity/hal_realtek_mainline/bee/soc/inc/rtl87x2j/pcc_reg.h
/*0x4000_0244 PCC_REG_TIMER0*/
#define PCC_REG_TIMER0_ENTRY_DELAY_CORE1_DEV_TIMER0_Pos                                          0U
#define PCC_REG_TIMER0_ENTRY_DELAY_CORE1_DEV_TIMER0_Msk                                          (0xFFUL << PCC_REG_TIMER0_ENTRY_DELAY_CORE1_DEV_TIMER0_Pos)

#define PCC_REG_TIMER0_RESERVED_8_Pos                                                            8U
#define PCC_REG_TIMER0_RESERVED_8_Msk                                                            (0x1UL << PCC_REG_TIMER0_RESERVED_8_Pos)

#define PCC_REG_TIMER0_RESERVED_7_Pos                                                            9U
#define PCC_REG_TIMER0_RESERVED_7_Msk                                                            (0x1UL << PCC_REG_TIMER0_RESERVED_7_Pos)

#define PCC_REG_TIMER0_RESERVED_6_Pos                                                            10U
#define PCC_REG_TIMER0_RESERVED_6_Msk                                                            (0x1UL << PCC_REG_TIMER0_RESERVED_6_Pos)

#define PCC_REG_TIMER0_RESERVED_5_Pos                                                            11U
#define PCC_REG_TIMER0_RESERVED_5_Msk                                                            (0x1UL << PCC_REG_TIMER0_RESERVED_5_Pos)

#define PCC_REG_TIMER0_RESERVED_4_Pos                                                            12U
#define PCC_REG_TIMER0_RESERVED_4_Msk                                                            (0x1UL << PCC_REG_TIMER0_RESERVED_4_Pos)

#define PCC_REG_TIMER0_RESERVED_3_Pos                                                            13U
#define PCC_REG_TIMER0_RESERVED_3_Msk                                                            (0x1UL << PCC_REG_TIMER0_RESERVED_3_Pos)

#define PCC_REG_TIMER0_RESERVED_2_Pos                                                            14U
#define PCC_REG_TIMER0_RESERVED_2_Msk                                                            (0x1UL << PCC_REG_TIMER0_RESERVED_2_Pos)

#define PCC_REG_TIMER0_RESERVED_1_Pos                                                            15U
#define PCC_REG_TIMER0_RESERVED_1_Msk                                                            (0x1UL << PCC_REG_TIMER0_RESERVED_1_Pos)

#define PCC_REG_TIMER0_RESERVED_Pos                                                              16U
#define PCC_REG_TIMER0_RESERVED_Msk                                                              (0x3FUL << PCC_REG_TIMER0_RESERVED_Pos)

#define PCC_REG_TIMER0_RSVD_1_Pos                                                                22U
#define PCC_REG_TIMER0_RSVD_1_Msk                                                                (0x1UL << PCC_REG_TIMER0_RSVD_1_Pos)

#define PCC_REG_TIMER0_RSVD_Pos                                                                  23U
#define PCC_REG_TIMER0_RSVD_Msk                                                                  (0x1UL << PCC_REG_TIMER0_RSVD_Pos)

#define PCC_REG_TIMER0_R_TIMER_1_CLK_DIV_Pos                                                     24U
#define PCC_REG_TIMER0_R_TIMER_1_CLK_DIV_Msk                                                     (0x7UL << PCC_REG_TIMER0_R_TIMER_1_CLK_DIV_Pos)

#define PCC_REG_TIMER0_R_TIMER_2_CLK_DIV_Pos                                                     27U
#define PCC_REG_TIMER0_R_TIMER_2_CLK_DIV_Msk                                                     (0x7UL << PCC_REG_TIMER0_R_TIMER_2_CLK_DIV_Pos)

#define PCC_REG_TIMER0_TIMER0_CH1_CLK_FORCE_Pos                                                  30U
#define PCC_REG_TIMER0_TIMER0_CH1_CLK_FORCE_Msk                                                  (0x1UL << PCC_REG_TIMER0_TIMER0_CH1_CLK_FORCE_Pos)

#define PCC_REG_TIMER0_TIMER0_CH2_CLK_FORCE_Pos                                                  31U
#define PCC_REG_TIMER0_TIMER0_CH2_CLK_FORCE_Msk                                                  (0x1UL << PCC_REG_TIMER0_TIMER0_CH2_CLK_FORCE_Pos)

/* 0x248    0x4000_0248
    7:0     R/W     ENTRY_DELAY_CORE1_DEV_TIMER1                    8'b0
    8       R/W     RESERVED_9                                      1'b1
    9       R/W     RESERVED_8                                      1'b1
    10      R/W     RESERVED_7                                      1'b1
    11      R/W     RESERVED_6                                      1'b1
    12      R/W     RESERVED_5                                      1'b1
    13      R/W     RESERVED_4                                      1'b1
    14      R/W     RESERVED_3                                      1'b1
    15      R/W     RESERVED_2                                      1'b1
    16      R/W     RESERVED_1                                      1'b1
    17      R/W     RESERVED                                        1'b1
    19:18   R/W     RSVD                                            2'b0
    22:20   R/W     R_TIMER_3_CLK_DIV                               3'h0
    25:23   R/W     R_TIMER_4_CLK_DIV                               3'h0
    28:26   R/W     R_TIMER_5_CLK_DIV                               3'h0
    29      R/W     TIMER1_CH3_CLK_FORCE                            1'b0
    30      R/W     TIMER1_CH4_CLK_FORCE                            1'b0
    31      R/W     TIMER1_CH5_CLK_FORCE                            1'b0
 */
typedef union _PCC_REG_TIMER1_A_TYPE
{
    uint32_t d32;
    struct
    {
        uint32_t ENTRY_DELAY_CORE1_DEV_TIMER1: 8;
        uint32_t RESERVED_9: 1;
        uint32_t RESERVED_8: 1;
        uint32_t RESERVED_7: 1;
        uint32_t RESERVED_6: 1;
        uint32_t RESERVED_5: 1;
        uint32_t RESERVED_4: 1;
        uint32_t RESERVED_3: 1;
        uint32_t RESERVED_2: 1;
        uint32_t RESERVED_1: 1;
        uint32_t RESERVED: 1;
        uint32_t RSVD: 2;
        uint32_t R_TIMER_3_CLK_DIV: 3;
        uint32_t R_TIMER_4_CLK_DIV: 3;
        uint32_t R_TIMER_5_CLK_DIV: 3;
        uint32_t TIMER1_CH3_CLK_FORCE: 1;
        uint32_t TIMER1_CH4_CLK_FORCE: 1;
        uint32_t TIMER1_CH5_CLK_FORCE: 1;
    };
} PCC_REG_TIMER1_A_TYPE;

/*0x4000_0248 PCC_REG_TIMER1_A*/
#define PCC_REG_TIMER1_A_ENTRY_DELAY_CORE1_DEV_TIMER1_Pos                                        0U
#define PCC_REG_TIMER1_A_ENTRY_DELAY_CORE1_DEV_TIMER1_Msk                                        (0xFFUL << PCC_REG_TIMER1_A_ENTRY_DELAY_CORE1_DEV_TIMER1_Pos)

#define PCC_REG_TIMER1_A_RESERVED_9_Pos                                                          8U
#define PCC_REG_TIMER1_A_RESERVED_9_Msk                                                          (0x1UL << PCC_REG_TIMER1_A_RESERVED_9_Pos)

#define PCC_REG_TIMER1_A_RESERVED_8_Pos                                                          9U
#define PCC_REG_TIMER1_A_RESERVED_8_Msk                                                          (0x1UL << PCC_REG_TIMER1_A_RESERVED_8_Pos)

#define PCC_REG_TIMER1_A_RESERVED_7_Pos                                                          10U
#define PCC_REG_TIMER1_A_RESERVED_7_Msk                                                          (0x1UL << PCC_REG_TIMER1_A_RESERVED_7_Pos)

