rtkconnectivity/hal_realtek_mainline/bee/soc/inc/rtl87x2j/pcc_reg.h
#define PCC_REG_TIMER1_B_RESERVED_9_Pos                                                          9U
#define PCC_REG_TIMER1_B_RESERVED_9_Msk                                                          (0x1UL << PCC_REG_TIMER1_B_RESERVED_9_Pos)

#define PCC_REG_TIMER1_B_RESERVED_8_Pos                                                          10U
#define PCC_REG_TIMER1_B_RESERVED_8_Msk                                                          (0x1UL << PCC_REG_TIMER1_B_RESERVED_8_Pos)

#define PCC_REG_TIMER1_B_RESERVED_7_Pos                                                          11U
#define PCC_REG_TIMER1_B_RESERVED_7_Msk                                                          (0x1UL << PCC_REG_TIMER1_B_RESERVED_7_Pos)

#define PCC_REG_TIMER1_B_RESERVED_6_Pos                                                          12U
#define PCC_REG_TIMER1_B_RESERVED_6_Msk                                                          (0x1UL << PCC_REG_TIMER1_B_RESERVED_6_Pos)

#define PCC_REG_TIMER1_B_RESERVED_5_Pos                                                          13U
#define PCC_REG_TIMER1_B_RESERVED_5_Msk                                                          (0x1UL << PCC_REG_TIMER1_B_RESERVED_5_Pos)

#define PCC_REG_TIMER1_B_RESERVED_4_Pos                                                          14U
#define PCC_REG_TIMER1_B_RESERVED_4_Msk                                                          (0x1UL << PCC_REG_TIMER1_B_RESERVED_4_Pos)

#define PCC_REG_TIMER1_B_RESERVED_3_Pos                                                          15U
#define PCC_REG_TIMER1_B_RESERVED_3_Msk                                                          (0x1UL << PCC_REG_TIMER1_B_RESERVED_3_Pos)

#define PCC_REG_TIMER1_B_RESERVED_2_Pos                                                          16U
#define PCC_REG_TIMER1_B_RESERVED_2_Msk                                                          (0x1UL << PCC_REG_TIMER1_B_RESERVED_2_Pos)

#define PCC_REG_TIMER1_B_RESERVED_1_Pos                                                          17U
#define PCC_REG_TIMER1_B_RESERVED_1_Msk                                                          (0x1UL << PCC_REG_TIMER1_B_RESERVED_1_Pos)

#define PCC_REG_TIMER1_B_RESERVED_Pos                                                            18U
#define PCC_REG_TIMER1_B_RESERVED_Msk                                                            (0x3UL << PCC_REG_TIMER1_B_RESERVED_Pos)

#define PCC_REG_TIMER1_B_R_TIMER_6_CLK_DIV_Pos                                                   20U
#define PCC_REG_TIMER1_B_R_TIMER_6_CLK_DIV_Msk                                                   (0x7UL << PCC_REG_TIMER1_B_R_TIMER_6_CLK_DIV_Pos)

#define PCC_REG_TIMER1_B_R_TIMER_7_CLK_DIV_Pos                                                   23U
#define PCC_REG_TIMER1_B_R_TIMER_7_CLK_DIV_Msk                                                   (0x7UL << PCC_REG_TIMER1_B_R_TIMER_7_CLK_DIV_Pos)

#define PCC_REG_TIMER1_B_R_TIMER_8_CLK_DIV_Pos                                                   26U
#define PCC_REG_TIMER1_B_R_TIMER_8_CLK_DIV_Msk                                                   (0x7UL << PCC_REG_TIMER1_B_R_TIMER_8_CLK_DIV_Pos)

#define PCC_REG_TIMER1_B_TIMER1_CH6_CLK_FORCE_Pos                                                29U
#define PCC_REG_TIMER1_B_TIMER1_CH6_CLK_FORCE_Msk                                                (0x1UL << PCC_REG_TIMER1_B_TIMER1_CH6_CLK_FORCE_Pos)

#define PCC_REG_TIMER1_B_TIMER1_CH7_CLK_FORCE_Pos                                                30U
#define PCC_REG_TIMER1_B_TIMER1_CH7_CLK_FORCE_Msk                                                (0x1UL << PCC_REG_TIMER1_B_TIMER1_CH7_CLK_FORCE_Pos)

#define PCC_REG_TIMER1_B_TIMER1_CH8_CLK_FORCE_Pos                                                31U
#define PCC_REG_TIMER1_B_TIMER1_CH8_CLK_FORCE_Msk                                                (0x1UL << PCC_REG_TIMER1_B_TIMER1_CH8_CLK_FORCE_Pos)

/* 0x250    0x4000_0250
    7:0     R/W     RESERVED_11                                     8'b0
    8       R/W     RESERVED_10                                     1'b0
    9       R/W     RESERVED_9                                      1'b1
    10      R/W     RESERVED_8                                      1'b1
    11      R/W     RESERVED_7                                      1'b1
    12      R/W     RESERVED_6                                      1'b1
    13      R/W     RESERVED_5                                      1'b1
    14      R/W     RESERVED_4                                      1'b1
    15      R/W     RESERVED_3                                      1'b1
    16      R/W     RESERVED_2                                      1'b1
    17      R/W     RESERVED_1                                      1'b1
    19:18   R/W     RESERVED                                        2'b0
    22:20   R/W     R_TIMER_9_CLK_DIV                               3'h0
    25:23   R/W     R_TIMER_10_CLK_DIV                              3'h0
    28:26   R/W     R_TIMER_11_CLK_DIV                              3'h0
    29      R/W     TIMER1_CH9_CLK_FORCE                            1'b0
    30      R/W     TIMER1_CH10_CLK_FORCE                           1'b0
    31      R/W     TIMER1_CH11_CLK_FORCE                           1'b0
 */
typedef union _PCC_REG_TIMER1_C_TYPE
{
    uint32_t d32;
    struct
    {
        uint32_t RESERVED_11: 8;
        uint32_t RESERVED_10: 1;
        uint32_t RESERVED_9: 1;
        uint32_t RESERVED_8: 1;
        uint32_t RESERVED_7: 1;
        uint32_t RESERVED_6: 1;
        uint32_t RESERVED_5: 1;
        uint32_t RESERVED_4: 1;
        uint32_t RESERVED_3: 1;
        uint32_t RESERVED_2: 1;
        uint32_t RESERVED_1: 1;
        uint32_t RESERVED: 2;
        uint32_t R_TIMER_9_CLK_DIV: 3;
        uint32_t R_TIMER_10_CLK_DIV: 3;
        uint32_t R_TIMER_11_CLK_DIV: 3;
        uint32_t TIMER1_CH9_CLK_FORCE: 1;
        uint32_t TIMER1_CH10_CLK_FORCE: 1;
        uint32_t TIMER1_CH11_CLK_FORCE: 1;
    };
} PCC_REG_TIMER1_C_TYPE;

