rtkconnectivity/hal_realtek_mainline/bee/soc/inc/rtl87x2j/pcc_reg.h
/*0x4000_0250 PCC_REG_TIMER1_C*/
#define PCC_REG_TIMER1_C_RESERVED_11_Pos                                                         0U
#define PCC_REG_TIMER1_C_RESERVED_11_Msk                                                         (0xFFUL << PCC_REG_TIMER1_C_RESERVED_11_Pos)

#define PCC_REG_TIMER1_C_RESERVED_10_Pos                                                         8U
#define PCC_REG_TIMER1_C_RESERVED_10_Msk                                                         (0x1UL << PCC_REG_TIMER1_C_RESERVED_10_Pos)

#define PCC_REG_TIMER1_C_RESERVED_9_Pos                                                          9U
#define PCC_REG_TIMER1_C_RESERVED_9_Msk                                                          (0x1UL << PCC_REG_TIMER1_C_RESERVED_9_Pos)

#define PCC_REG_TIMER1_C_RESERVED_8_Pos                                                          10U
#define PCC_REG_TIMER1_C_RESERVED_8_Msk                                                          (0x1UL << PCC_REG_TIMER1_C_RESERVED_8_Pos)

#define PCC_REG_TIMER1_C_RESERVED_7_Pos                                                          11U
#define PCC_REG_TIMER1_C_RESERVED_7_Msk                                                          (0x1UL << PCC_REG_TIMER1_C_RESERVED_7_Pos)

#define PCC_REG_TIMER1_C_RESERVED_6_Pos                                                          12U
#define PCC_REG_TIMER1_C_RESERVED_6_Msk                                                          (0x1UL << PCC_REG_TIMER1_C_RESERVED_6_Pos)

#define PCC_REG_TIMER1_C_RESERVED_5_Pos                                                          13U
#define PCC_REG_TIMER1_C_RESERVED_5_Msk                                                          (0x1UL << PCC_REG_TIMER1_C_RESERVED_5_Pos)

#define PCC_REG_TIMER1_C_RESERVED_4_Pos                                                          14U
#define PCC_REG_TIMER1_C_RESERVED_4_Msk                                                          (0x1UL << PCC_REG_TIMER1_C_RESERVED_4_Pos)

#define PCC_REG_TIMER1_C_RESERVED_3_Pos                                                          15U
#define PCC_REG_TIMER1_C_RESERVED_3_Msk                                                          (0x1UL << PCC_REG_TIMER1_C_RESERVED_3_Pos)

#define PCC_REG_TIMER1_C_RESERVED_2_Pos                                                          16U
#define PCC_REG_TIMER1_C_RESERVED_2_Msk                                                          (0x1UL << PCC_REG_TIMER1_C_RESERVED_2_Pos)

#define PCC_REG_TIMER1_C_RESERVED_1_Pos                                                          17U
#define PCC_REG_TIMER1_C_RESERVED_1_Msk                                                          (0x1UL << PCC_REG_TIMER1_C_RESERVED_1_Pos)

#define PCC_REG_TIMER1_C_RESERVED_Pos                                                            18U
#define PCC_REG_TIMER1_C_RESERVED_Msk                                                            (0x3UL << PCC_REG_TIMER1_C_RESERVED_Pos)

#define PCC_REG_TIMER1_C_R_TIMER_9_CLK_DIV_Pos                                                   20U
#define PCC_REG_TIMER1_C_R_TIMER_9_CLK_DIV_Msk                                                   (0x7UL << PCC_REG_TIMER1_C_R_TIMER_9_CLK_DIV_Pos)

#define PCC_REG_TIMER1_C_R_TIMER_10_CLK_DIV_Pos                                                  23U
#define PCC_REG_TIMER1_C_R_TIMER_10_CLK_DIV_Msk                                                  (0x7UL << PCC_REG_TIMER1_C_R_TIMER_10_CLK_DIV_Pos)

#define PCC_REG_TIMER1_C_R_TIMER_11_CLK_DIV_Pos                                                  26U
#define PCC_REG_TIMER1_C_R_TIMER_11_CLK_DIV_Msk                                                  (0x7UL << PCC_REG_TIMER1_C_R_TIMER_11_CLK_DIV_Pos)

#define PCC_REG_TIMER1_C_TIMER1_CH9_CLK_FORCE_Pos                                                29U
#define PCC_REG_TIMER1_C_TIMER1_CH9_CLK_FORCE_Msk                                                (0x1UL << PCC_REG_TIMER1_C_TIMER1_CH9_CLK_FORCE_Pos)

#define PCC_REG_TIMER1_C_TIMER1_CH10_CLK_FORCE_Pos                                               30U
#define PCC_REG_TIMER1_C_TIMER1_CH10_CLK_FORCE_Msk                                               (0x1UL << PCC_REG_TIMER1_C_TIMER1_CH10_CLK_FORCE_Pos)

#define PCC_REG_TIMER1_C_TIMER1_CH11_CLK_FORCE_Pos                                               31U
#define PCC_REG_TIMER1_C_TIMER1_CH11_CLK_FORCE_Msk                                               (0x1UL << PCC_REG_TIMER1_C_TIMER1_CH11_CLK_FORCE_Pos)

/* 0x254    0x4000_0254
    7:0     R/W     ENTRY_DELAY_CORE1_DEV_ENHANCED_TIMER            8'b0
    8       R/W     RESERVED_12                                     1'b0
    9       R/W     RESERVED_11                                     1'b1
    10      R/W     RESERVED_10                                     1'b1
    11      R/W     RESERVED_9                                      1'b1
    12      R/W     RESERVED_8                                      1'b1
    13      R/W     RESERVED_7                                      1'b0
    14      R/W     RESERVED_6                                      1'b1
    15      R/W     RESERVED_5                                      1'b0
    16      R/W     RESERVED_4                                      1'b0
    19:17   R/W     R_ETIMER_CLK_DIV_SEL                            3'h0
    20      R/W     RSVD_2                                          1'h0
    21      R/W     RESERVED_3                                      1'b0
    22      R/W     RESERVED_2                                      1'b0
    23      R/W     ENHANCED_TIMER_CLK_FORCE                        1'b0
    26:24   R/W     RSVD_1                                          3'b000
    27      R/W     RESERVED_1                                      1'b0
    30:28   R/W     RSVD                                            3'b000
    31      R/W     RESERVED                                        1'b0
 */
typedef union _PCC_REG_TIMER2_TYPE
{
    uint32_t d32;
    struct
    {
        uint32_t ENTRY_DELAY_CORE1_DEV_ENHANCED_TIMER: 8;
        uint32_t RESERVED_12: 1;
        uint32_t RESERVED_11: 1;
        uint32_t RESERVED_10: 1;
        uint32_t RESERVED_9: 1;
        uint32_t RESERVED_8: 1;
        uint32_t RESERVED_7: 1;
        uint32_t RESERVED_6: 1;
        uint32_t RESERVED_5: 1;
        uint32_t RESERVED_4: 1;
        uint32_t R_ETIMER_CLK_DIV_SEL: 3;
        uint32_t RSVD_2: 1;
        uint32_t RESERVED_3: 1;
        uint32_t RESERVED_2: 1;
        uint32_t ENHANCED_TIMER_CLK_FORCE: 1;
        uint32_t RSVD_1: 3;
        uint32_t RESERVED_1: 1;
        uint32_t RSVD: 3;
        uint32_t RESERVED: 1;
    };
} PCC_REG_TIMER2_TYPE;

/*0x4000_0254 PCC_REG_TIMER2*/
#define PCC_REG_TIMER2_ENTRY_DELAY_CORE1_DEV_ENHANCED_TIMER_Pos                                  0U
#define PCC_REG_TIMER2_ENTRY_DELAY_CORE1_DEV_ENHANCED_TIMER_Msk                                  (0xFFUL << PCC_REG_TIMER2_ENTRY_DELAY_CORE1_DEV_ENHANCED_TIMER_Pos)

#define PCC_REG_TIMER2_RESERVED_12_Pos                                                           8U
#define PCC_REG_TIMER2_RESERVED_12_Msk                                                           (0x1UL << PCC_REG_TIMER2_RESERVED_12_Pos)

#define PCC_REG_TIMER2_RESERVED_11_Pos                                                           9U
#define PCC_REG_TIMER2_RESERVED_11_Msk                                                           (0x1UL << PCC_REG_TIMER2_RESERVED_11_Pos)

#define PCC_REG_TIMER2_RESERVED_10_Pos                                                           10U
#define PCC_REG_TIMER2_RESERVED_10_Msk                                                           (0x1UL << PCC_REG_TIMER2_RESERVED_10_Pos)

#define PCC_REG_TIMER2_RESERVED_9_Pos                                                            11U
#define PCC_REG_TIMER2_RESERVED_9_Msk                                                            (0x1UL << PCC_REG_TIMER2_RESERVED_9_Pos)

