rtkconnectivity/hal_realtek_mainline/bee/soc/inc/rtl87x2j/pcc_reg.h
#define PCC_REG_TIMER2_RESERVED_8_Pos                                                            12U
#define PCC_REG_TIMER2_RESERVED_8_Msk                                                            (0x1UL << PCC_REG_TIMER2_RESERVED_8_Pos)

#define PCC_REG_TIMER2_RESERVED_7_Pos                                                            13U
#define PCC_REG_TIMER2_RESERVED_7_Msk                                                            (0x1UL << PCC_REG_TIMER2_RESERVED_7_Pos)

#define PCC_REG_TIMER2_RESERVED_6_Pos                                                            14U
#define PCC_REG_TIMER2_RESERVED_6_Msk                                                            (0x1UL << PCC_REG_TIMER2_RESERVED_6_Pos)

#define PCC_REG_TIMER2_RESERVED_5_Pos                                                            15U
#define PCC_REG_TIMER2_RESERVED_5_Msk                                                            (0x1UL << PCC_REG_TIMER2_RESERVED_5_Pos)

#define PCC_REG_TIMER2_RESERVED_4_Pos                                                            16U
#define PCC_REG_TIMER2_RESERVED_4_Msk                                                            (0x1UL << PCC_REG_TIMER2_RESERVED_4_Pos)

#define PCC_REG_TIMER2_R_ETIMER_CLK_DIV_SEL_Pos                                                  17U
#define PCC_REG_TIMER2_R_ETIMER_CLK_DIV_SEL_Msk                                                  (0x7UL << PCC_REG_TIMER2_R_ETIMER_CLK_DIV_SEL_Pos)

#define PCC_REG_TIMER2_RSVD_2_Pos                                                                20U
#define PCC_REG_TIMER2_RSVD_2_Msk                                                                (0x1UL << PCC_REG_TIMER2_RSVD_2_Pos)

#define PCC_REG_TIMER2_RESERVED_3_Pos                                                            21U
#define PCC_REG_TIMER2_RESERVED_3_Msk                                                            (0x1UL << PCC_REG_TIMER2_RESERVED_3_Pos)

#define PCC_REG_TIMER2_RESERVED_2_Pos                                                            22U
#define PCC_REG_TIMER2_RESERVED_2_Msk                                                            (0x1UL << PCC_REG_TIMER2_RESERVED_2_Pos)

#define PCC_REG_TIMER2_ENHANCED_TIMER_CLK_FORCE_Pos                                              23U
#define PCC_REG_TIMER2_ENHANCED_TIMER_CLK_FORCE_Msk                                              (0x1UL << PCC_REG_TIMER2_ENHANCED_TIMER_CLK_FORCE_Pos)

#define PCC_REG_TIMER2_RSVD_1_Pos                                                                24U
#define PCC_REG_TIMER2_RSVD_1_Msk                                                                (0x7UL << PCC_REG_TIMER2_RSVD_1_Pos)

#define PCC_REG_TIMER2_RESERVED_1_Pos                                                            27U
#define PCC_REG_TIMER2_RESERVED_1_Msk                                                            (0x1UL << PCC_REG_TIMER2_RESERVED_1_Pos)

#define PCC_REG_TIMER2_RSVD_Pos                                                                  28U
#define PCC_REG_TIMER2_RSVD_Msk                                                                  (0x7UL << PCC_REG_TIMER2_RSVD_Pos)

#define PCC_REG_TIMER2_RESERVED_Pos                                                              31U
#define PCC_REG_TIMER2_RESERVED_Msk                                                              (0x1UL << PCC_REG_TIMER2_RESERVED_Pos)

/* 0x258    0x4000_0258
    7:0     R/W     ENTRY_DELAY_CORE1_DEV_ENHANCED_TIMER_PWM        8'b0
    8       R/W     RESERVED_11                                     1'b0
    9       R/W     RESERVED_10                                     1'b1
    10      R/W     RESERVED_9                                      1'b1
    11      R/W     RESERVED_8                                      1'b0
    12      R/W     RESERVED_7                                      1'b1
    13      R/W     RESERVED_6                                      1'b0
    14      R/W     RESERVED_5                                      1'b1
    15      R/W     RESERVED_4                                      1'b0
    16      R/W     R_ETIMER_PWM_CLK_SRC_SEL                        1'b0
    19:17   R/W     R_ETIMER_PWM_CLK_DIV_SEL                        3'h0
    20      R/W     RSVD_2                                          1'h0
    21      R/W     RESERVED_3                                      1'b0
    22      R/W     RESERVED_2                                      1'b0
    23      R/W     ENHANCED_TIMER_PWM_CLK_FORCE                    1'b0
    26:24   R/W     RSVD_1                                          3'b000
    27      R/W     RESERVED_1                                      1'b0
    30:28   R/W     RSVD                                            3'b000
    31      R/W     RESERVED                                        1'b0
 */
typedef union _PCC_REG_TIMER2_PWM_TYPE
{
    uint32_t d32;
    struct
    {
        uint32_t ENTRY_DELAY_CORE1_DEV_ENHANCED_TIMER_PWM: 8;
        uint32_t RESERVED_11: 1;
        uint32_t RESERVED_10: 1;
        uint32_t RESERVED_9: 1;
        uint32_t RESERVED_8: 1;
        uint32_t RESERVED_7: 1;
        uint32_t RESERVED_6: 1;
        uint32_t RESERVED_5: 1;
        uint32_t RESERVED_4: 1;
        uint32_t R_ETIMER_PWM_CLK_SRC_SEL: 1;
        uint32_t R_ETIMER_PWM_CLK_DIV_SEL: 3;
        uint32_t RSVD_2: 1;
        uint32_t RESERVED_3: 1;
        uint32_t RESERVED_2: 1;
        uint32_t ENHANCED_TIMER_PWM_CLK_FORCE: 1;
        uint32_t RSVD_1: 3;
        uint32_t RESERVED_1: 1;
        uint32_t RSVD: 3;
        uint32_t RESERVED: 1;
    };
} PCC_REG_TIMER2_PWM_TYPE;

/*0x4000_0258 PCC_REG_TIMER2_PWM*/
#define PCC_REG_TIMER2_PWM_ENTRY_DELAY_CORE1_DEV_ENHANCED_TIMER_PWM_Pos                          0U
#define PCC_REG_TIMER2_PWM_ENTRY_DELAY_CORE1_DEV_ENHANCED_TIMER_PWM_Msk                          (0xFFUL << PCC_REG_TIMER2_PWM_ENTRY_DELAY_CORE1_DEV_ENHANCED_TIMER_PWM_Pos)

#define PCC_REG_TIMER2_PWM_RESERVED_11_Pos                                                       8U
#define PCC_REG_TIMER2_PWM_RESERVED_11_Msk                                                       (0x1UL << PCC_REG_TIMER2_PWM_RESERVED_11_Pos)

#define PCC_REG_TIMER2_PWM_RESERVED_10_Pos                                                       9U
#define PCC_REG_TIMER2_PWM_RESERVED_10_Msk                                                       (0x1UL << PCC_REG_TIMER2_PWM_RESERVED_10_Pos)

#define PCC_REG_TIMER2_PWM_RESERVED_9_Pos                                                        10U
#define PCC_REG_TIMER2_PWM_RESERVED_9_Msk                                                        (0x1UL << PCC_REG_TIMER2_PWM_RESERVED_9_Pos)

#define PCC_REG_TIMER2_PWM_RESERVED_8_Pos                                                        11U
#define PCC_REG_TIMER2_PWM_RESERVED_8_Msk                                                        (0x1UL << PCC_REG_TIMER2_PWM_RESERVED_8_Pos)

#define PCC_REG_TIMER2_PWM_RESERVED_7_Pos                                                        12U
#define PCC_REG_TIMER2_PWM_RESERVED_7_Msk                                                        (0x1UL << PCC_REG_TIMER2_PWM_RESERVED_7_Pos)

#define PCC_REG_TIMER2_PWM_RESERVED_6_Pos                                                        13U
#define PCC_REG_TIMER2_PWM_RESERVED_6_Msk                                                        (0x1UL << PCC_REG_TIMER2_PWM_RESERVED_6_Pos)

#define PCC_REG_TIMER2_PWM_RESERVED_5_Pos                                                        14U
#define PCC_REG_TIMER2_PWM_RESERVED_5_Msk                                                        (0x1UL << PCC_REG_TIMER2_PWM_RESERVED_5_Pos)

#define PCC_REG_TIMER2_PWM_RESERVED_4_Pos                                                        15U
#define PCC_REG_TIMER2_PWM_RESERVED_4_Msk                                                        (0x1UL << PCC_REG_TIMER2_PWM_RESERVED_4_Pos)

#define PCC_REG_TIMER2_PWM_R_ETIMER_PWM_CLK_SRC_SEL_Pos                                          16U
#define PCC_REG_TIMER2_PWM_R_ETIMER_PWM_CLK_SRC_SEL_Msk                                          (0x1UL << PCC_REG_TIMER2_PWM_R_ETIMER_PWM_CLK_SRC_SEL_Pos)

#define PCC_REG_TIMER2_PWM_R_ETIMER_PWM_CLK_DIV_SEL_Pos                                          17U
#define PCC_REG_TIMER2_PWM_R_ETIMER_PWM_CLK_DIV_SEL_Msk                                          (0x7UL << PCC_REG_TIMER2_PWM_R_ETIMER_PWM_CLK_DIV_SEL_Pos)

#define PCC_REG_TIMER2_PWM_RSVD_2_Pos                                                            20U
#define PCC_REG_TIMER2_PWM_RSVD_2_Msk                                                            (0x1UL << PCC_REG_TIMER2_PWM_RSVD_2_Pos)

#define PCC_REG_TIMER2_PWM_RESERVED_3_Pos                                                        21U
#define PCC_REG_TIMER2_PWM_RESERVED_3_Msk                                                        (0x1UL << PCC_REG_TIMER2_PWM_RESERVED_3_Pos)

#define PCC_REG_TIMER2_PWM_RESERVED_2_Pos                                                        22U
#define PCC_REG_TIMER2_PWM_RESERVED_2_Msk                                                        (0x1UL << PCC_REG_TIMER2_PWM_RESERVED_2_Pos)

#define PCC_REG_TIMER2_PWM_ENHANCED_TIMER_PWM_CLK_FORCE_Pos                                      23U
#define PCC_REG_TIMER2_PWM_ENHANCED_TIMER_PWM_CLK_FORCE_Msk                                      (0x1UL << PCC_REG_TIMER2_PWM_ENHANCED_TIMER_PWM_CLK_FORCE_Pos)

#define PCC_REG_TIMER2_PWM_RSVD_1_Pos                                                            24U
#define PCC_REG_TIMER2_PWM_RSVD_1_Msk                                                            (0x7UL << PCC_REG_TIMER2_PWM_RSVD_1_Pos)

#define PCC_REG_TIMER2_PWM_RESERVED_1_Pos                                                        27U
#define PCC_REG_TIMER2_PWM_RESERVED_1_Msk                                                        (0x1UL << PCC_REG_TIMER2_PWM_RESERVED_1_Pos)

#define PCC_REG_TIMER2_PWM_RSVD_Pos                                                              28U
#define PCC_REG_TIMER2_PWM_RSVD_Msk                                                              (0x7UL << PCC_REG_TIMER2_PWM_RSVD_Pos)

#define PCC_REG_TIMER2_PWM_RESERVED_Pos                                                          31U
#define PCC_REG_TIMER2_PWM_RESERVED_Msk                                                          (0x1UL << PCC_REG_TIMER2_PWM_RESERVED_Pos)

