rtkconnectivity/hal_realtek_mainline/bee/soc/inc/rtl87x2j/pcc_reg.h
/* 0x25C    0x4000_025c
    7:0     R/W     ENTRY_DELAY_USB                                 8'b0
    8       R/W     RESERVED_9                                      1'b1
    9       R/W     RESERVED_8                                      1'b1
    10      R/W     RESERVED_7                                      1'b1
    11      R/W     RESERVED_6                                      1'b0
    12      R/W     RESERVED_5                                      1'b1
    13      R/W     RESERVED_4                                      1'b1
    15:14   R/W     RESERVED_3                                      2'b0
    16      R/W     R_USB_CLK_SRC_SEL                               1'b0
    20:17   R/W     R_USB_CLK_DIV_SEL                               4'h0
    21      R/W     RSVD_2                                          1'h0
    22      R/W     RESERVED_2                                      1'b0
    23      R/W     USB_CLK_FORCE                                   1'b0
    26:24   R/W     RSVD_1                                          3'b000
    27      R/W     RESERVED_1                                      1'b0
    30:28   R/W     RSVD                                            3'b000
    31      R/W     RESERVED                                        1'b0
 */
typedef union _PCC_REG_USB_TYPE
{
    uint32_t d32;
    struct
    {
        uint32_t ENTRY_DELAY_USB: 8;
        uint32_t RESERVED_9: 1;
        uint32_t RESERVED_8: 1;
        uint32_t RESERVED_7: 1;
        uint32_t RESERVED_6: 1;
        uint32_t RESERVED_5: 1;
        uint32_t RESERVED_4: 1;
        uint32_t RESERVED_3: 2;
        uint32_t R_USB_CLK_SRC_SEL: 1;
        uint32_t R_USB_CLK_DIV_SEL: 4;
        uint32_t RSVD_2: 1;
        uint32_t RESERVED_2: 1;
        uint32_t USB_CLK_FORCE: 1;
        uint32_t RSVD_1: 3;
        uint32_t RESERVED_1: 1;
        uint32_t RSVD: 3;
        uint32_t RESERVED: 1;
    };
} PCC_REG_USB_TYPE;

/*0x4000_025c PCC_REG_USB*/
#define PCC_REG_USB_ENTRY_DELAY_USB_Pos                                                          0U
#define PCC_REG_USB_ENTRY_DELAY_USB_Msk                                                          (0xFFUL << PCC_REG_USB_ENTRY_DELAY_USB_Pos)

#define PCC_REG_USB_RESERVED_9_Pos                                                               8U
#define PCC_REG_USB_RESERVED_9_Msk                                                               (0x1UL << PCC_REG_USB_RESERVED_9_Pos)

#define PCC_REG_USB_RESERVED_8_Pos                                                               9U
#define PCC_REG_USB_RESERVED_8_Msk                                                               (0x1UL << PCC_REG_USB_RESERVED_8_Pos)

#define PCC_REG_USB_RESERVED_7_Pos                                                               10U
#define PCC_REG_USB_RESERVED_7_Msk                                                               (0x1UL << PCC_REG_USB_RESERVED_7_Pos)

#define PCC_REG_USB_RESERVED_6_Pos                                                               11U
#define PCC_REG_USB_RESERVED_6_Msk                                                               (0x1UL << PCC_REG_USB_RESERVED_6_Pos)

#define PCC_REG_USB_RESERVED_5_Pos                                                               12U
#define PCC_REG_USB_RESERVED_5_Msk                                                               (0x1UL << PCC_REG_USB_RESERVED_5_Pos)

#define PCC_REG_USB_RESERVED_4_Pos                                                               13U
#define PCC_REG_USB_RESERVED_4_Msk                                                               (0x1UL << PCC_REG_USB_RESERVED_4_Pos)

#define PCC_REG_USB_RESERVED_3_Pos                                                               14U
#define PCC_REG_USB_RESERVED_3_Msk                                                               (0x3UL << PCC_REG_USB_RESERVED_3_Pos)

#define PCC_REG_USB_R_USB_CLK_SRC_SEL_Pos                                                        16U
#define PCC_REG_USB_R_USB_CLK_SRC_SEL_Msk                                                        (0x1UL << PCC_REG_USB_R_USB_CLK_SRC_SEL_Pos)

#define PCC_REG_USB_R_USB_CLK_DIV_SEL_Pos                                                        17U
#define PCC_REG_USB_R_USB_CLK_DIV_SEL_Msk                                                        (0xFUL << PCC_REG_USB_R_USB_CLK_DIV_SEL_Pos)

#define PCC_REG_USB_RSVD_2_Pos                                                                   21U
#define PCC_REG_USB_RSVD_2_Msk                                                                   (0x1UL << PCC_REG_USB_RSVD_2_Pos)

#define PCC_REG_USB_RESERVED_2_Pos                                                               22U
#define PCC_REG_USB_RESERVED_2_Msk                                                               (0x1UL << PCC_REG_USB_RESERVED_2_Pos)

#define PCC_REG_USB_USB_CLK_FORCE_Pos                                                            23U
#define PCC_REG_USB_USB_CLK_FORCE_Msk                                                            (0x1UL << PCC_REG_USB_USB_CLK_FORCE_Pos)

#define PCC_REG_USB_RSVD_1_Pos                                                                   24U
#define PCC_REG_USB_RSVD_1_Msk                                                                   (0x7UL << PCC_REG_USB_RSVD_1_Pos)

#define PCC_REG_USB_RESERVED_1_Pos                                                               27U
#define PCC_REG_USB_RESERVED_1_Msk                                                               (0x1UL << PCC_REG_USB_RESERVED_1_Pos)

#define PCC_REG_USB_RSVD_Pos                                                                     28U
#define PCC_REG_USB_RSVD_Msk                                                                     (0x7UL << PCC_REG_USB_RSVD_Pos)

#define PCC_REG_USB_RESERVED_Pos                                                                 31U
#define PCC_REG_USB_RESERVED_Msk                                                                 (0x1UL << PCC_REG_USB_RESERVED_Pos)

/* 0x260    0x4000_0260
    7:0     R/W     ENTRY_DELAY_CORE1_DEV_AUXADC                    8'b0
    8       R/W     RESERVED_8                                      1'b0
    9       R/W     RESERVED_7                                      1'b1
    10      R/W     RESERVED_6                                      1'b1
    11      R/W     RESERVED_5                                      1'b1
    12      R/W     RESERVED_4                                      1'b1
    16:13   R/W     RESERVED_3                                      4'b0
    17      R/W     RESERVED_2                                      1'b0
    18      R/W     ADC_CLK_FORCE                                   1'b0
    26:19   R/W     RSVD_1                                          8'b000
    27      R/W     RESERVED_1                                      1'b0
    30:28   R/W     RSVD                                            3'b000
    31      R/W     RESERVED                                        1'b0
 */
typedef union _PCC_REG_ADC_CONTROLLER_TYPE
{
    uint32_t d32;
    struct
    {
        uint32_t ENTRY_DELAY_CORE1_DEV_AUXADC: 8;
        uint32_t RESERVED_8: 1;
        uint32_t RESERVED_7: 1;
        uint32_t RESERVED_6: 1;
        uint32_t RESERVED_5: 1;
        uint32_t RESERVED_4: 1;
        uint32_t RESERVED_3: 4;
        uint32_t RESERVED_2: 1;
        uint32_t ADC_CLK_FORCE: 1;
        uint32_t RSVD_1: 8;
        uint32_t RESERVED_1: 1;
        uint32_t RSVD: 3;
        uint32_t RESERVED: 1;
    };
} PCC_REG_ADC_CONTROLLER_TYPE;

/*0x4000_0260 PCC_REG_ADC_CONTROLLER*/
#define PCC_REG_ADC_CONTROLLER_ENTRY_DELAY_CORE1_DEV_AUXADC_Pos                                  0U
#define PCC_REG_ADC_CONTROLLER_ENTRY_DELAY_CORE1_DEV_AUXADC_Msk                                  (0xFFUL << PCC_REG_ADC_CONTROLLER_ENTRY_DELAY_CORE1_DEV_AUXADC_Pos)

#define PCC_REG_ADC_CONTROLLER_RESERVED_8_Pos                                                    8U
#define PCC_REG_ADC_CONTROLLER_RESERVED_8_Msk                                                    (0x1UL << PCC_REG_ADC_CONTROLLER_RESERVED_8_Pos)

#define PCC_REG_ADC_CONTROLLER_RESERVED_7_Pos                                                    9U
#define PCC_REG_ADC_CONTROLLER_RESERVED_7_Msk                                                    (0x1UL << PCC_REG_ADC_CONTROLLER_RESERVED_7_Pos)

#define PCC_REG_ADC_CONTROLLER_RESERVED_6_Pos                                                    10U
#define PCC_REG_ADC_CONTROLLER_RESERVED_6_Msk                                                    (0x1UL << PCC_REG_ADC_CONTROLLER_RESERVED_6_Pos)

#define PCC_REG_ADC_CONTROLLER_RESERVED_5_Pos                                                    11U
#define PCC_REG_ADC_CONTROLLER_RESERVED_5_Msk                                                    (0x1UL << PCC_REG_ADC_CONTROLLER_RESERVED_5_Pos)

#define PCC_REG_ADC_CONTROLLER_RESERVED_4_Pos                                                    12U
#define PCC_REG_ADC_CONTROLLER_RESERVED_4_Msk                                                    (0x1UL << PCC_REG_ADC_CONTROLLER_RESERVED_4_Pos)

