rtkconnectivity/hal_realtek_mainline/bee/soc/inc/rtl87x2j/pcc_reg.h
#define PCC_REG_ADC_CONTROLLER_RESERVED_3_Pos                                                    13U
#define PCC_REG_ADC_CONTROLLER_RESERVED_3_Msk                                                    (0xFUL << PCC_REG_ADC_CONTROLLER_RESERVED_3_Pos)

#define PCC_REG_ADC_CONTROLLER_RESERVED_2_Pos                                                    17U
#define PCC_REG_ADC_CONTROLLER_RESERVED_2_Msk                                                    (0x1UL << PCC_REG_ADC_CONTROLLER_RESERVED_2_Pos)

#define PCC_REG_ADC_CONTROLLER_ADC_CLK_FORCE_Pos                                                 18U
#define PCC_REG_ADC_CONTROLLER_ADC_CLK_FORCE_Msk                                                 (0x1UL << PCC_REG_ADC_CONTROLLER_ADC_CLK_FORCE_Pos)

#define PCC_REG_ADC_CONTROLLER_RSVD_1_Pos                                                        19U
#define PCC_REG_ADC_CONTROLLER_RSVD_1_Msk                                                        (0xFFUL << PCC_REG_ADC_CONTROLLER_RSVD_1_Pos)

#define PCC_REG_ADC_CONTROLLER_RESERVED_1_Pos                                                    27U
#define PCC_REG_ADC_CONTROLLER_RESERVED_1_Msk                                                    (0x1UL << PCC_REG_ADC_CONTROLLER_RESERVED_1_Pos)

#define PCC_REG_ADC_CONTROLLER_RSVD_Pos                                                          28U
#define PCC_REG_ADC_CONTROLLER_RSVD_Msk                                                          (0x7UL << PCC_REG_ADC_CONTROLLER_RSVD_Pos)

#define PCC_REG_ADC_CONTROLLER_RESERVED_Pos                                                      31U
#define PCC_REG_ADC_CONTROLLER_RESERVED_Msk                                                      (0x1UL << PCC_REG_ADC_CONTROLLER_RESERVED_Pos)

/* 0x264    0x4000_0264
    7:0     R/W     ENTRY_DELAY_CORE1_DEV_I2C0                      8'b0
    8       R/W     RESERVED_9                                      1'b0
    9       R/W     RESERVED_8                                      1'b1
    10      R/W     RESERVED_7                                      1'b1
    11      R/W     RESERVED_6                                      1'b1
    12      R/W     RESERVED_5                                      1'b1
    15:13   R/W     RESERVED_4                                      3'b0
    18:16   R/W     R_I2C0_CLK_DIV_SEL                              3'b000
    20:19   R/W     RSVD_2                                          2'h0
    21      R/W     RESERVED_3                                      1'b0
    22      R/W     RESERVED_2                                      1'b0
    23      R/W     I2C0_CLK_FORCE                                  1'b0
    26:24   R/W     RSVD_1                                          3'b000
    27      R/W     RESERVED_1                                      1'b0
    30:28   R/W     RSVD                                            3'b000
    31      R/W     RESERVED                                        1'b0
 */
typedef union _PCC_REG_I2C0_TYPE
{
    uint32_t d32;
    struct
    {
        uint32_t ENTRY_DELAY_CORE1_DEV_I2C0: 8;
        uint32_t RESERVED_9: 1;
        uint32_t RESERVED_8: 1;
        uint32_t RESERVED_7: 1;
        uint32_t RESERVED_6: 1;
        uint32_t RESERVED_5: 1;
        uint32_t RESERVED_4: 3;
        uint32_t R_I2C0_CLK_DIV_SEL: 3;
        uint32_t RSVD_2: 2;
        uint32_t RESERVED_3: 1;
        uint32_t RESERVED_2: 1;
        uint32_t I2C0_CLK_FORCE: 1;
        uint32_t RSVD_1: 3;
        uint32_t RESERVED_1: 1;
        uint32_t RSVD: 3;
        uint32_t RESERVED: 1;
    };
} PCC_REG_I2C0_TYPE;

/*0x4000_0264 PCC_REG_I2C0*/
#define PCC_REG_I2C0_ENTRY_DELAY_CORE1_DEV_I2C0_Pos                                              0U
#define PCC_REG_I2C0_ENTRY_DELAY_CORE1_DEV_I2C0_Msk                                              (0xFFUL << PCC_REG_I2C0_ENTRY_DELAY_CORE1_DEV_I2C0_Pos)

#define PCC_REG_I2C0_RESERVED_9_Pos                                                              8U
#define PCC_REG_I2C0_RESERVED_9_Msk                                                              (0x1UL << PCC_REG_I2C0_RESERVED_9_Pos)

#define PCC_REG_I2C0_RESERVED_8_Pos                                                              9U
#define PCC_REG_I2C0_RESERVED_8_Msk                                                              (0x1UL << PCC_REG_I2C0_RESERVED_8_Pos)

#define PCC_REG_I2C0_RESERVED_7_Pos                                                              10U
#define PCC_REG_I2C0_RESERVED_7_Msk                                                              (0x1UL << PCC_REG_I2C0_RESERVED_7_Pos)

#define PCC_REG_I2C0_RESERVED_6_Pos                                                              11U
#define PCC_REG_I2C0_RESERVED_6_Msk                                                              (0x1UL << PCC_REG_I2C0_RESERVED_6_Pos)

#define PCC_REG_I2C0_RESERVED_5_Pos                                                              12U
#define PCC_REG_I2C0_RESERVED_5_Msk                                                              (0x1UL << PCC_REG_I2C0_RESERVED_5_Pos)

#define PCC_REG_I2C0_RESERVED_4_Pos                                                              13U
#define PCC_REG_I2C0_RESERVED_4_Msk                                                              (0x7UL << PCC_REG_I2C0_RESERVED_4_Pos)

#define PCC_REG_I2C0_R_I2C0_CLK_DIV_SEL_Pos                                                      16U
#define PCC_REG_I2C0_R_I2C0_CLK_DIV_SEL_Msk                                                      (0x7UL << PCC_REG_I2C0_R_I2C0_CLK_DIV_SEL_Pos)

#define PCC_REG_I2C0_RSVD_2_Pos                                                                  19U
#define PCC_REG_I2C0_RSVD_2_Msk                                                                  (0x3UL << PCC_REG_I2C0_RSVD_2_Pos)

#define PCC_REG_I2C0_RESERVED_3_Pos                                                              21U
#define PCC_REG_I2C0_RESERVED_3_Msk                                                              (0x1UL << PCC_REG_I2C0_RESERVED_3_Pos)

#define PCC_REG_I2C0_RESERVED_2_Pos                                                              22U
#define PCC_REG_I2C0_RESERVED_2_Msk                                                              (0x1UL << PCC_REG_I2C0_RESERVED_2_Pos)

#define PCC_REG_I2C0_I2C0_CLK_FORCE_Pos                                                          23U
#define PCC_REG_I2C0_I2C0_CLK_FORCE_Msk                                                          (0x1UL << PCC_REG_I2C0_I2C0_CLK_FORCE_Pos)

#define PCC_REG_I2C0_RSVD_1_Pos                                                                  24U
#define PCC_REG_I2C0_RSVD_1_Msk                                                                  (0x7UL << PCC_REG_I2C0_RSVD_1_Pos)

#define PCC_REG_I2C0_RESERVED_1_Pos                                                              27U
#define PCC_REG_I2C0_RESERVED_1_Msk                                                              (0x1UL << PCC_REG_I2C0_RESERVED_1_Pos)

