rtkconnectivity/hal_realtek_mainline/bee/soc/inc/rtl87x2j/pcc_reg.h
#define PCC_REG_EFLASH_RESERVED_3_Pos                                                            22U
#define PCC_REG_EFLASH_RESERVED_3_Msk                                                            (0x1UL << PCC_REG_EFLASH_RESERVED_3_Pos)

#define PCC_REG_EFLASH_EFLASH_MANU_SEL_Pos                                                       23U
#define PCC_REG_EFLASH_EFLASH_MANU_SEL_Msk                                                       (0x1UL << PCC_REG_EFLASH_EFLASH_MANU_SEL_Pos)

#define PCC_REG_EFLASH_EFLASH_MANU_DAT_Pos                                                       24U
#define PCC_REG_EFLASH_EFLASH_MANU_DAT_Msk                                                       (0x1UL << PCC_REG_EFLASH_EFLASH_MANU_DAT_Pos)

#define PCC_REG_EFLASH_RESERVED_2_Pos                                                            25U
#define PCC_REG_EFLASH_RESERVED_2_Msk                                                            (0x1UL << PCC_REG_EFLASH_RESERVED_2_Pos)

#define PCC_REG_EFLASH_RESERVED_1_Pos                                                            26U
#define PCC_REG_EFLASH_RESERVED_1_Msk                                                            (0x1UL << PCC_REG_EFLASH_RESERVED_1_Pos)

#define PCC_REG_EFLASH_LVCTL_Pos                                                                 27U
#define PCC_REG_EFLASH_LVCTL_Msk                                                                 (0x1UL << PCC_REG_EFLASH_LVCTL_Pos)

#define PCC_REG_EFLASH_RSVD_Pos                                                                  28U
#define PCC_REG_EFLASH_RSVD_Msk                                                                  (0x7UL << PCC_REG_EFLASH_RSVD_Pos)

#define PCC_REG_EFLASH_RESERVED_Pos                                                              31U
#define PCC_REG_EFLASH_RESERVED_Msk                                                              (0x1UL << PCC_REG_EFLASH_RESERVED_Pos)

/* 0x278    0x4000_0278
    7:0     R/W     ENTRY_DELAY_CORE1_DEV_CAN                       8'b0
    8       R/W     RESERVED_5                                      1'b0
    9       R/W     RESERVED_4                                      1'b1
    10      R/W     RESERVED_3                                      1'b1
    11      R/W     RESERVED_2                                      1'b1
    12      R/W     RESERVED_1                                      1'b1
    14:13   R/W     R_CAN_CLK_DIV                                   2'h0
    15      R/W     CAN_CLK_FORCE                                   1'b0
    23:16   R/W     ENTRY_DELAY_CORE1_DEV_CAN_LP                    8'b0
    24      R/W     CAN_LP_CLK_FORCE                                1'b0
    26:25   R/W     R_CAN_LP_CLK_DIV                                2'h0
    31:27   R/W     RESERVED                                        5'b0
 */
typedef union _PCC_REG_CAN_TYPE
{
    uint32_t d32;
    struct
    {
        uint32_t ENTRY_DELAY_CORE1_DEV_CAN: 8;
        uint32_t RESERVED_5: 1;
        uint32_t RESERVED_4: 1;
        uint32_t RESERVED_3: 1;
        uint32_t RESERVED_2: 1;
        uint32_t RESERVED_1: 1;
        uint32_t R_CAN_CLK_DIV: 2;
        uint32_t CAN_CLK_FORCE: 1;
        uint32_t ENTRY_DELAY_CORE1_DEV_CAN_LP: 8;
        uint32_t CAN_LP_CLK_FORCE: 1;
        uint32_t R_CAN_LP_CLK_DIV: 2;
        uint32_t RESERVED: 5;
    };
} PCC_REG_CAN_TYPE;

/*0x4000_0278 PCC_REG_CAN*/
#define PCC_REG_CAN_ENTRY_DELAY_CORE1_DEV_CAN_Pos                                                0U
#define PCC_REG_CAN_ENTRY_DELAY_CORE1_DEV_CAN_Msk                                                (0xFFUL << PCC_REG_CAN_ENTRY_DELAY_CORE1_DEV_CAN_Pos)

#define PCC_REG_CAN_RESERVED_5_Pos                                                               8U
#define PCC_REG_CAN_RESERVED_5_Msk                                                               (0x1UL << PCC_REG_CAN_RESERVED_5_Pos)

#define PCC_REG_CAN_RESERVED_4_Pos                                                               9U
#define PCC_REG_CAN_RESERVED_4_Msk                                                               (0x1UL << PCC_REG_CAN_RESERVED_4_Pos)

#define PCC_REG_CAN_RESERVED_3_Pos                                                               10U
#define PCC_REG_CAN_RESERVED_3_Msk                                                               (0x1UL << PCC_REG_CAN_RESERVED_3_Pos)

#define PCC_REG_CAN_RESERVED_2_Pos                                                               11U
#define PCC_REG_CAN_RESERVED_2_Msk                                                               (0x1UL << PCC_REG_CAN_RESERVED_2_Pos)

#define PCC_REG_CAN_RESERVED_1_Pos                                                               12U
#define PCC_REG_CAN_RESERVED_1_Msk                                                               (0x1UL << PCC_REG_CAN_RESERVED_1_Pos)

#define PCC_REG_CAN_R_CAN_CLK_DIV_Pos                                                            13U
#define PCC_REG_CAN_R_CAN_CLK_DIV_Msk                                                            (0x3UL << PCC_REG_CAN_R_CAN_CLK_DIV_Pos)

#define PCC_REG_CAN_CAN_CLK_FORCE_Pos                                                            15U
#define PCC_REG_CAN_CAN_CLK_FORCE_Msk                                                            (0x1UL << PCC_REG_CAN_CAN_CLK_FORCE_Pos)

#define PCC_REG_CAN_ENTRY_DELAY_CORE1_DEV_CAN_LP_Pos                                             16U
#define PCC_REG_CAN_ENTRY_DELAY_CORE1_DEV_CAN_LP_Msk                                             (0xFFUL << PCC_REG_CAN_ENTRY_DELAY_CORE1_DEV_CAN_LP_Pos)

#define PCC_REG_CAN_CAN_LP_CLK_FORCE_Pos                                                         24U
#define PCC_REG_CAN_CAN_LP_CLK_FORCE_Msk                                                         (0x1UL << PCC_REG_CAN_CAN_LP_CLK_FORCE_Pos)

#define PCC_REG_CAN_R_CAN_LP_CLK_DIV_Pos                                                         25U
#define PCC_REG_CAN_R_CAN_LP_CLK_DIV_Msk                                                         (0x3UL << PCC_REG_CAN_R_CAN_LP_CLK_DIV_Pos)

#define PCC_REG_CAN_RESERVED_Pos                                                                 27U
#define PCC_REG_CAN_RESERVED_Msk                                                                 (0x1FUL << PCC_REG_CAN_RESERVED_Pos)

/* 0x27C    0x4000_027c
    7:0     R/W     ENTRY_DELAY_CORE1_DEV_GPIO_DBNC                 8'b0
    8       R/W     RESERVED_7                                      1'b0
    9       R/W     RESERVED_6                                      1'b1
    10      R/W     RESERVED_5                                      1'b1
    11      R/W     RESERVED_4                                      1'b0
    12      R/W     RESERVED_3                                      1'b1
    15:13   R/W     RESERVED_2                                      3'b0
    18:16   R/W     DBNC_DIV_SEL                                    3'h001
    19      R/W     RSVD_1                                          1'h0
    20      R/W     GPIO_DBNC_2P4G_CLK_FORCE                        1'b0
    29:21   R/W     RSVD                                            9'b0
    30      R/W     RESERVED_1                                      1'b0
    31      R/W     RESERVED                                        1'b0
 */
typedef union _PCC_REG_GPIO_DEBOUNCE_2P4G_TYPE
{
    uint32_t d32;
    struct
    {
        uint32_t ENTRY_DELAY_CORE1_DEV_GPIO_DBNC: 8;
        uint32_t RESERVED_7: 1;
        uint32_t RESERVED_6: 1;
        uint32_t RESERVED_5: 1;
        uint32_t RESERVED_4: 1;
        uint32_t RESERVED_3: 1;
        uint32_t RESERVED_2: 3;
        uint32_t DBNC_DIV_SEL: 3;
        uint32_t RSVD_1: 1;
        uint32_t GPIO_DBNC_2P4G_CLK_FORCE: 1;
        uint32_t RSVD: 9;
        uint32_t RESERVED_1: 1;
        uint32_t RESERVED: 1;
    };
} PCC_REG_GPIO_DEBOUNCE_2P4G_TYPE;

/*0x4000_027c PCC_REG_GPIO_DEBOUNCE_2P4G*/
#define PCC_REG_GPIO_DEBOUNCE_2P4G_ENTRY_DELAY_CORE1_DEV_GPIO_DBNC_Pos                           0U
#define PCC_REG_GPIO_DEBOUNCE_2P4G_ENTRY_DELAY_CORE1_DEV_GPIO_DBNC_Msk                           (0xFFUL << PCC_REG_GPIO_DEBOUNCE_2P4G_ENTRY_DELAY_CORE1_DEV_GPIO_DBNC_Pos)

#define PCC_REG_GPIO_DEBOUNCE_2P4G_RESERVED_7_Pos                                                8U
#define PCC_REG_GPIO_DEBOUNCE_2P4G_RESERVED_7_Msk                                                (0x1UL << PCC_REG_GPIO_DEBOUNCE_2P4G_RESERVED_7_Pos)

#define PCC_REG_GPIO_DEBOUNCE_2P4G_RESERVED_6_Pos                                                9U
#define PCC_REG_GPIO_DEBOUNCE_2P4G_RESERVED_6_Msk                                                (0x1UL << PCC_REG_GPIO_DEBOUNCE_2P4G_RESERVED_6_Pos)

#define PCC_REG_GPIO_DEBOUNCE_2P4G_RESERVED_5_Pos                                                10U
#define PCC_REG_GPIO_DEBOUNCE_2P4G_RESERVED_5_Msk                                                (0x1UL << PCC_REG_GPIO_DEBOUNCE_2P4G_RESERVED_5_Pos)

#define PCC_REG_GPIO_DEBOUNCE_2P4G_RESERVED_4_Pos                                                11U
#define PCC_REG_GPIO_DEBOUNCE_2P4G_RESERVED_4_Msk                                                (0x1UL << PCC_REG_GPIO_DEBOUNCE_2P4G_RESERVED_4_Pos)

#define PCC_REG_GPIO_DEBOUNCE_2P4G_RESERVED_3_Pos                                                12U
#define PCC_REG_GPIO_DEBOUNCE_2P4G_RESERVED_3_Msk                                                (0x1UL << PCC_REG_GPIO_DEBOUNCE_2P4G_RESERVED_3_Pos)

#define PCC_REG_GPIO_DEBOUNCE_2P4G_RESERVED_2_Pos                                                13U
#define PCC_REG_GPIO_DEBOUNCE_2P4G_RESERVED_2_Msk                                                (0x7UL << PCC_REG_GPIO_DEBOUNCE_2P4G_RESERVED_2_Pos)

#define PCC_REG_GPIO_DEBOUNCE_2P4G_DBNC_DIV_SEL_Pos                                              16U
#define PCC_REG_GPIO_DEBOUNCE_2P4G_DBNC_DIV_SEL_Msk                                              (0x7UL << PCC_REG_GPIO_DEBOUNCE_2P4G_DBNC_DIV_SEL_Pos)

#define PCC_REG_GPIO_DEBOUNCE_2P4G_RSVD_1_Pos                                                    19U
#define PCC_REG_GPIO_DEBOUNCE_2P4G_RSVD_1_Msk                                                    (0x1UL << PCC_REG_GPIO_DEBOUNCE_2P4G_RSVD_1_Pos)

#define PCC_REG_GPIO_DEBOUNCE_2P4G_GPIO_DBNC_2P4G_CLK_FORCE_Pos                                  20U
#define PCC_REG_GPIO_DEBOUNCE_2P4G_GPIO_DBNC_2P4G_CLK_FORCE_Msk                                  (0x1UL << PCC_REG_GPIO_DEBOUNCE_2P4G_GPIO_DBNC_2P4G_CLK_FORCE_Pos)

#define PCC_REG_GPIO_DEBOUNCE_2P4G_RSVD_Pos                                                      21U
#define PCC_REG_GPIO_DEBOUNCE_2P4G_RSVD_Msk                                                      (0x1FFUL << PCC_REG_GPIO_DEBOUNCE_2P4G_RSVD_Pos)

#define PCC_REG_GPIO_DEBOUNCE_2P4G_RESERVED_1_Pos                                                30U
#define PCC_REG_GPIO_DEBOUNCE_2P4G_RESERVED_1_Msk                                                (0x1UL << PCC_REG_GPIO_DEBOUNCE_2P4G_RESERVED_1_Pos)

#define PCC_REG_GPIO_DEBOUNCE_2P4G_RESERVED_Pos                                                  31U
#define PCC_REG_GPIO_DEBOUNCE_2P4G_RESERVED_Msk                                                  (0x1UL << PCC_REG_GPIO_DEBOUNCE_2P4G_RESERVED_Pos)

/* 0x280    0x4000_0280
    7:0     R/W     ENTRY_DELAY_CORE1_DEV_UART0                     8'b0
    8       R/W     RESERVED_7                                      1'b0
    9       R/W     RESERVED_6                                      1'b1
    10      R/W     RESERVED_5                                      1'b1
    11      R/W     RESERVED_4                                      1'b1
    12      R/W     RESERVED_3                                      1'b1
    15:13   R/W     RESERVED_2                                      3'b0
    18:16   R/W     R_UART0_CLK_DIV_SEL                             3'h0
    19      R/W     RSVD_2                                          1'h0
    20      R/W     UART0_CLK_FORCE                                 1'b0
    25:21   R/W     RSVD_1                                          5'b000
    26      R/W     RESERVED_1                                      1'b0
    27      R/W     UART0_PCLK_NO_LATENCY_EN                        1'b0
    30:28   R/W     RSVD                                            3'b000
    31      R/W     RESERVED                                        1'b0
 */
typedef union _PCC_REG_UART0_TYPE
{
    uint32_t d32;
    struct
    {
        uint32_t ENTRY_DELAY_CORE1_DEV_UART0: 8;
        uint32_t RESERVED_7: 1;
        uint32_t RESERVED_6: 1;
        uint32_t RESERVED_5: 1;
        uint32_t RESERVED_4: 1;
        uint32_t RESERVED_3: 1;
        uint32_t RESERVED_2: 3;
        uint32_t R_UART0_CLK_DIV_SEL: 3;
        uint32_t RSVD_2: 1;
        uint32_t UART0_CLK_FORCE: 1;
        uint32_t RSVD_1: 5;
        uint32_t RESERVED_1: 1;
        uint32_t UART0_PCLK_NO_LATENCY_EN: 1;
        uint32_t RSVD: 3;
        uint32_t RESERVED: 1;
    };
} PCC_REG_UART0_TYPE;

/*0x4000_0280 PCC_REG_UART0*/
#define PCC_REG_UART0_ENTRY_DELAY_CORE1_DEV_UART0_Pos                                            0U
#define PCC_REG_UART0_ENTRY_DELAY_CORE1_DEV_UART0_Msk                                            (0xFFUL << PCC_REG_UART0_ENTRY_DELAY_CORE1_DEV_UART0_Pos)

#define PCC_REG_UART0_RESERVED_7_Pos                                                             8U
#define PCC_REG_UART0_RESERVED_7_Msk                                                             (0x1UL << PCC_REG_UART0_RESERVED_7_Pos)

#define PCC_REG_UART0_RESERVED_6_Pos                                                             9U
#define PCC_REG_UART0_RESERVED_6_Msk                                                             (0x1UL << PCC_REG_UART0_RESERVED_6_Pos)

