rtkconnectivity/hal_realtek_mainline/bee/soc/inc/rtl87x2j/pcc_reg.h
#define PCC_REG_UART0_RESERVED_5_Pos                                                             10U
#define PCC_REG_UART0_RESERVED_5_Msk                                                             (0x1UL << PCC_REG_UART0_RESERVED_5_Pos)

#define PCC_REG_UART0_RESERVED_4_Pos                                                             11U
#define PCC_REG_UART0_RESERVED_4_Msk                                                             (0x1UL << PCC_REG_UART0_RESERVED_4_Pos)

#define PCC_REG_UART0_RESERVED_3_Pos                                                             12U
#define PCC_REG_UART0_RESERVED_3_Msk                                                             (0x1UL << PCC_REG_UART0_RESERVED_3_Pos)

#define PCC_REG_UART0_RESERVED_2_Pos                                                             13U
#define PCC_REG_UART0_RESERVED_2_Msk                                                             (0x7UL << PCC_REG_UART0_RESERVED_2_Pos)

#define PCC_REG_UART0_R_UART0_CLK_DIV_SEL_Pos                                                    16U
#define PCC_REG_UART0_R_UART0_CLK_DIV_SEL_Msk                                                    (0x7UL << PCC_REG_UART0_R_UART0_CLK_DIV_SEL_Pos)

#define PCC_REG_UART0_RSVD_2_Pos                                                                 19U
#define PCC_REG_UART0_RSVD_2_Msk                                                                 (0x1UL << PCC_REG_UART0_RSVD_2_Pos)

#define PCC_REG_UART0_UART0_CLK_FORCE_Pos                                                        20U
#define PCC_REG_UART0_UART0_CLK_FORCE_Msk                                                        (0x1UL << PCC_REG_UART0_UART0_CLK_FORCE_Pos)

#define PCC_REG_UART0_RSVD_1_Pos                                                                 21U
#define PCC_REG_UART0_RSVD_1_Msk                                                                 (0x1FUL << PCC_REG_UART0_RSVD_1_Pos)

#define PCC_REG_UART0_RESERVED_1_Pos                                                             26U
#define PCC_REG_UART0_RESERVED_1_Msk                                                             (0x1UL << PCC_REG_UART0_RESERVED_1_Pos)

#define PCC_REG_UART0_UART0_PCLK_NO_LATENCY_EN_Pos                                               27U
#define PCC_REG_UART0_UART0_PCLK_NO_LATENCY_EN_Msk                                               (0x1UL << PCC_REG_UART0_UART0_PCLK_NO_LATENCY_EN_Pos)

#define PCC_REG_UART0_RSVD_Pos                                                                   28U
#define PCC_REG_UART0_RSVD_Msk                                                                   (0x7UL << PCC_REG_UART0_RSVD_Pos)

#define PCC_REG_UART0_RESERVED_Pos                                                               31U
#define PCC_REG_UART0_RESERVED_Msk                                                               (0x1UL << PCC_REG_UART0_RESERVED_Pos)

/* 0x284    0x4000_0284
    7:0     R/W     ENTRY_DELAY_CORE1_DEV_UART1                     8'b0
    8       R/W     RESERVED_7                                      1'b0
    9       R/W     RESERVED_6                                      1'b1
    10      R/W     RESERVED_5                                      1'b1
    11      R/W     RESERVED_4                                      1'b1
    12      R/W     RESERVED_3                                      1'b1
    15:13   R/W     RESERVED_2                                      3'b0
    18:16   R/W     R_UART1_CLK_DIV_SEL                             3'h0
    19      R/W     RSVD_2                                          1'h0
    20      R/W     UART1_CLK_FORCE                                 1'b0
    25:21   R/W     RSVD_1                                          5'b000
    26      R/W     RESERVED_1                                      1'b0
    27      R/W     UART1_PCLK_NO_LATENCY_EN                        1'b0
    30:28   R/W     RSVD                                            3'b000
    31      R/W     RESERVED                                        1'b0
 */
typedef union _PCC_REG_UART1_TYPE
{
    uint32_t d32;
    struct
    {
        uint32_t ENTRY_DELAY_CORE1_DEV_UART1: 8;
        uint32_t RESERVED_7: 1;
        uint32_t RESERVED_6: 1;
        uint32_t RESERVED_5: 1;
        uint32_t RESERVED_4: 1;
        uint32_t RESERVED_3: 1;
        uint32_t RESERVED_2: 3;
        uint32_t R_UART1_CLK_DIV_SEL: 3;
        uint32_t RSVD_2: 1;
        uint32_t UART1_CLK_FORCE: 1;
        uint32_t RSVD_1: 5;
        uint32_t RESERVED_1: 1;
        uint32_t UART1_PCLK_NO_LATENCY_EN: 1;
        uint32_t RSVD: 3;
        uint32_t RESERVED: 1;
    };
} PCC_REG_UART1_TYPE;

/*0x4000_0284 PCC_REG_UART1*/
#define PCC_REG_UART1_ENTRY_DELAY_CORE1_DEV_UART1_Pos                                            0U
#define PCC_REG_UART1_ENTRY_DELAY_CORE1_DEV_UART1_Msk                                            (0xFFUL << PCC_REG_UART1_ENTRY_DELAY_CORE1_DEV_UART1_Pos)

#define PCC_REG_UART1_RESERVED_7_Pos                                                             8U
#define PCC_REG_UART1_RESERVED_7_Msk                                                             (0x1UL << PCC_REG_UART1_RESERVED_7_Pos)

#define PCC_REG_UART1_RESERVED_6_Pos                                                             9U
#define PCC_REG_UART1_RESERVED_6_Msk                                                             (0x1UL << PCC_REG_UART1_RESERVED_6_Pos)

#define PCC_REG_UART1_RESERVED_5_Pos                                                             10U
#define PCC_REG_UART1_RESERVED_5_Msk                                                             (0x1UL << PCC_REG_UART1_RESERVED_5_Pos)

#define PCC_REG_UART1_RESERVED_4_Pos                                                             11U
#define PCC_REG_UART1_RESERVED_4_Msk                                                             (0x1UL << PCC_REG_UART1_RESERVED_4_Pos)

#define PCC_REG_UART1_RESERVED_3_Pos                                                             12U
#define PCC_REG_UART1_RESERVED_3_Msk                                                             (0x1UL << PCC_REG_UART1_RESERVED_3_Pos)

#define PCC_REG_UART1_RESERVED_2_Pos                                                             13U
#define PCC_REG_UART1_RESERVED_2_Msk                                                             (0x7UL << PCC_REG_UART1_RESERVED_2_Pos)

#define PCC_REG_UART1_R_UART1_CLK_DIV_SEL_Pos                                                    16U
#define PCC_REG_UART1_R_UART1_CLK_DIV_SEL_Msk                                                    (0x7UL << PCC_REG_UART1_R_UART1_CLK_DIV_SEL_Pos)

#define PCC_REG_UART1_RSVD_2_Pos                                                                 19U
#define PCC_REG_UART1_RSVD_2_Msk                                                                 (0x1UL << PCC_REG_UART1_RSVD_2_Pos)

#define PCC_REG_UART1_UART1_CLK_FORCE_Pos                                                        20U
#define PCC_REG_UART1_UART1_CLK_FORCE_Msk                                                        (0x1UL << PCC_REG_UART1_UART1_CLK_FORCE_Pos)

