rtkconnectivity/hal_realtek_mainline/bee/soc/inc/rtl87x2j/pcc_reg.h
#define PCC_REG_UART3_RSVD_2_Pos                                                                 19U
#define PCC_REG_UART3_RSVD_2_Msk                                                                 (0x1UL << PCC_REG_UART3_RSVD_2_Pos)

#define PCC_REG_UART3_UART3_CLK_FORCE_Pos                                                        20U
#define PCC_REG_UART3_UART3_CLK_FORCE_Msk                                                        (0x1UL << PCC_REG_UART3_UART3_CLK_FORCE_Pos)

#define PCC_REG_UART3_RSVD_1_Pos                                                                 21U
#define PCC_REG_UART3_RSVD_1_Msk                                                                 (0x1FUL << PCC_REG_UART3_RSVD_1_Pos)

#define PCC_REG_UART3_RESERVED_1_Pos                                                             26U
#define PCC_REG_UART3_RESERVED_1_Msk                                                             (0x1UL << PCC_REG_UART3_RESERVED_1_Pos)

#define PCC_REG_UART3_UART3_PCLK_NO_LATENCY_EN_Pos                                               27U
#define PCC_REG_UART3_UART3_PCLK_NO_LATENCY_EN_Msk                                               (0x1UL << PCC_REG_UART3_UART3_PCLK_NO_LATENCY_EN_Pos)

#define PCC_REG_UART3_RSVD_Pos                                                                   28U
#define PCC_REG_UART3_RSVD_Msk                                                                   (0x7UL << PCC_REG_UART3_RSVD_Pos)

#define PCC_REG_UART3_RESERVED_Pos                                                               31U
#define PCC_REG_UART3_RESERVED_Msk                                                               (0x1UL << PCC_REG_UART3_RESERVED_Pos)

/* 0x290    0x4000_0290
    7:0     R/W     ENTRY_DELAY_CORE1_DEV_RTKGPIO                   8'b0
    8       R/W     RESERVED_11                                     1'b0
    9       R/W     RESERVED_10                                     1'b1
    10      R/W     RESERVED_9                                      1'b0
    11      R/W     RESERVED_8                                      1'b1
    12      R/W     RESERVED_7                                      1'b1
    13      R/W     RESERVED_6                                      1'b1
    14      R/W     RESERVED_5                                      1'b1
    15      R/W     RESERVED_4                                      1'b0
    16      R/W     RESERVED_3                                      1'b0
    17      R/W     RESERVED_2                                      1'b0
    18      R/W     GPIOA_CLK_FORCE                                 1'b0
    29:19   R/W     RSVD                                            11'b0
    30      R/W     RESERVED_1                                      1'b0
    31      R/W     RESERVED                                        1'b0
 */
typedef union _PCC_REG_GPIOA_TYPE
{
    uint32_t d32;
    struct
    {
        uint32_t ENTRY_DELAY_CORE1_DEV_RTKGPIO: 8;
        uint32_t RESERVED_11: 1;
        uint32_t RESERVED_10: 1;
        uint32_t RESERVED_9: 1;
        uint32_t RESERVED_8: 1;
        uint32_t RESERVED_7: 1;
        uint32_t RESERVED_6: 1;
        uint32_t RESERVED_5: 1;
        uint32_t RESERVED_4: 1;
        uint32_t RESERVED_3: 1;
        uint32_t RESERVED_2: 1;
        uint32_t GPIOA_CLK_FORCE: 1;
        uint32_t RSVD: 11;
        uint32_t RESERVED_1: 1;
        uint32_t RESERVED: 1;
    };
} PCC_REG_GPIOA_TYPE;

/*0x4000_0290 PCC_REG_GPIOA*/
#define PCC_REG_GPIOA_ENTRY_DELAY_CORE1_DEV_RTKGPIO_Pos                                          0U
#define PCC_REG_GPIOA_ENTRY_DELAY_CORE1_DEV_RTKGPIO_Msk                                          (0xFFUL << PCC_REG_GPIOA_ENTRY_DELAY_CORE1_DEV_RTKGPIO_Pos)

#define PCC_REG_GPIOA_RESERVED_11_Pos                                                            8U
#define PCC_REG_GPIOA_RESERVED_11_Msk                                                            (0x1UL << PCC_REG_GPIOA_RESERVED_11_Pos)

#define PCC_REG_GPIOA_RESERVED_10_Pos                                                            9U
#define PCC_REG_GPIOA_RESERVED_10_Msk                                                            (0x1UL << PCC_REG_GPIOA_RESERVED_10_Pos)

#define PCC_REG_GPIOA_RESERVED_9_Pos                                                             10U
#define PCC_REG_GPIOA_RESERVED_9_Msk                                                             (0x1UL << PCC_REG_GPIOA_RESERVED_9_Pos)

#define PCC_REG_GPIOA_RESERVED_8_Pos                                                             11U
#define PCC_REG_GPIOA_RESERVED_8_Msk                                                             (0x1UL << PCC_REG_GPIOA_RESERVED_8_Pos)

#define PCC_REG_GPIOA_RESERVED_7_Pos                                                             12U
#define PCC_REG_GPIOA_RESERVED_7_Msk                                                             (0x1UL << PCC_REG_GPIOA_RESERVED_7_Pos)

#define PCC_REG_GPIOA_RESERVED_6_Pos                                                             13U
#define PCC_REG_GPIOA_RESERVED_6_Msk                                                             (0x1UL << PCC_REG_GPIOA_RESERVED_6_Pos)

#define PCC_REG_GPIOA_RESERVED_5_Pos                                                             14U
#define PCC_REG_GPIOA_RESERVED_5_Msk                                                             (0x1UL << PCC_REG_GPIOA_RESERVED_5_Pos)

#define PCC_REG_GPIOA_RESERVED_4_Pos                                                             15U
#define PCC_REG_GPIOA_RESERVED_4_Msk                                                             (0x1UL << PCC_REG_GPIOA_RESERVED_4_Pos)

#define PCC_REG_GPIOA_RESERVED_3_Pos                                                             16U
#define PCC_REG_GPIOA_RESERVED_3_Msk                                                             (0x1UL << PCC_REG_GPIOA_RESERVED_3_Pos)

#define PCC_REG_GPIOA_RESERVED_2_Pos                                                             17U
#define PCC_REG_GPIOA_RESERVED_2_Msk                                                             (0x1UL << PCC_REG_GPIOA_RESERVED_2_Pos)

