rtkconnectivity/hal_realtek_mainline/bee/soc/inc/rtl87x2j/pcc_reg.h
#define PCC_REG_GPIOA_GPIOA_CLK_FORCE_Pos                                                        18U
#define PCC_REG_GPIOA_GPIOA_CLK_FORCE_Msk                                                        (0x1UL << PCC_REG_GPIOA_GPIOA_CLK_FORCE_Pos)

#define PCC_REG_GPIOA_RSVD_Pos                                                                   19U
#define PCC_REG_GPIOA_RSVD_Msk                                                                   (0x7FFUL << PCC_REG_GPIOA_RSVD_Pos)

#define PCC_REG_GPIOA_RESERVED_1_Pos                                                             30U
#define PCC_REG_GPIOA_RESERVED_1_Msk                                                             (0x1UL << PCC_REG_GPIOA_RESERVED_1_Pos)

#define PCC_REG_GPIOA_RESERVED_Pos                                                               31U
#define PCC_REG_GPIOA_RESERVED_Msk                                                               (0x1UL << PCC_REG_GPIOA_RESERVED_Pos)

/* 0x294    0x4000_0294
    7:0     R/W     ENTRY_DELAY_CORE1_DEV_MODEM                     8'b0
    8       R/W     RESERVED_7                                      1'b1
    9       R/W     RESERVED_6                                      1'b1
    10      R/W     RESERVED_5                                      1'b1
    11      R/W     RESERVED_4                                      1'b1
    12      R/W     RESERVED_3                                      1'b1
    14:13   R/W     RESERVED_2                                      2'b0
    15      R/W     R_MODEM_CLK_SEL_CK1_FORCE                       1'b0
    16      R/W     R_MODEM_CLK_SRC_SEL                             1'b1
    17      R/W     RSVD_4                                          1'h0
    18      R/W     MODEM_CLK_FORCE                                 1'b0
    21:19   R/W     RSVD_3                                          3'b000
    22      R/W     RESERVED_1                                      1'b0
    23      R/W     RSVD_2                                          1'b0
    24      R/W     RSVD_1                                          1'b0
    30:25   R/W     RSVD                                            6'b0
    31      R/W     RESERVED                                        1'b0
 */
typedef union _PCC_REG_MODEM_TYPE
{
    uint32_t d32;
    struct
    {
        uint32_t ENTRY_DELAY_CORE1_DEV_MODEM: 8;
        uint32_t RESERVED_7: 1;
        uint32_t RESERVED_6: 1;
        uint32_t RESERVED_5: 1;
        uint32_t RESERVED_4: 1;
        uint32_t RESERVED_3: 1;
        uint32_t RESERVED_2: 2;
        uint32_t R_MODEM_CLK_SEL_CK1_FORCE: 1;
        uint32_t R_MODEM_CLK_SRC_SEL: 1;
        uint32_t RSVD_4: 1;
        uint32_t MODEM_CLK_FORCE: 1;
        uint32_t RSVD_3: 3;
        uint32_t RESERVED_1: 1;
        uint32_t RSVD_2: 1;
        uint32_t RSVD_1: 1;
        uint32_t RSVD: 6;
        uint32_t RESERVED: 1;
    };
} PCC_REG_MODEM_TYPE;

/*0x4000_0294 PCC_REG_MODEM*/
#define PCC_REG_MODEM_ENTRY_DELAY_CORE1_DEV_MODEM_Pos                                            0U
#define PCC_REG_MODEM_ENTRY_DELAY_CORE1_DEV_MODEM_Msk                                            (0xFFUL << PCC_REG_MODEM_ENTRY_DELAY_CORE1_DEV_MODEM_Pos)

#define PCC_REG_MODEM_RESERVED_7_Pos                                                             8U
#define PCC_REG_MODEM_RESERVED_7_Msk                                                             (0x1UL << PCC_REG_MODEM_RESERVED_7_Pos)

#define PCC_REG_MODEM_RESERVED_6_Pos                                                             9U
#define PCC_REG_MODEM_RESERVED_6_Msk                                                             (0x1UL << PCC_REG_MODEM_RESERVED_6_Pos)

#define PCC_REG_MODEM_RESERVED_5_Pos                                                             10U
#define PCC_REG_MODEM_RESERVED_5_Msk                                                             (0x1UL << PCC_REG_MODEM_RESERVED_5_Pos)

#define PCC_REG_MODEM_RESERVED_4_Pos                                                             11U
#define PCC_REG_MODEM_RESERVED_4_Msk                                                             (0x1UL << PCC_REG_MODEM_RESERVED_4_Pos)

#define PCC_REG_MODEM_RESERVED_3_Pos                                                             12U
#define PCC_REG_MODEM_RESERVED_3_Msk                                                             (0x1UL << PCC_REG_MODEM_RESERVED_3_Pos)

#define PCC_REG_MODEM_RESERVED_2_Pos                                                             13U
#define PCC_REG_MODEM_RESERVED_2_Msk                                                             (0x3UL << PCC_REG_MODEM_RESERVED_2_Pos)

#define PCC_REG_MODEM_R_MODEM_CLK_SEL_CK1_FORCE_Pos                                              15U
#define PCC_REG_MODEM_R_MODEM_CLK_SEL_CK1_FORCE_Msk                                              (0x1UL << PCC_REG_MODEM_R_MODEM_CLK_SEL_CK1_FORCE_Pos)

#define PCC_REG_MODEM_R_MODEM_CLK_SRC_SEL_Pos                                                    16U
#define PCC_REG_MODEM_R_MODEM_CLK_SRC_SEL_Msk                                                    (0x1UL << PCC_REG_MODEM_R_MODEM_CLK_SRC_SEL_Pos)

#define PCC_REG_MODEM_RSVD_4_Pos                                                                 17U
#define PCC_REG_MODEM_RSVD_4_Msk                                                                 (0x1UL << PCC_REG_MODEM_RSVD_4_Pos)

#define PCC_REG_MODEM_MODEM_CLK_FORCE_Pos                                                        18U
#define PCC_REG_MODEM_MODEM_CLK_FORCE_Msk                                                        (0x1UL << PCC_REG_MODEM_MODEM_CLK_FORCE_Pos)

#define PCC_REG_MODEM_RSVD_3_Pos                                                                 19U
#define PCC_REG_MODEM_RSVD_3_Msk                                                                 (0x7UL << PCC_REG_MODEM_RSVD_3_Pos)

#define PCC_REG_MODEM_RESERVED_1_Pos                                                             22U
#define PCC_REG_MODEM_RESERVED_1_Msk                                                             (0x1UL << PCC_REG_MODEM_RESERVED_1_Pos)

#define PCC_REG_MODEM_RSVD_2_Pos                                                                 23U
#define PCC_REG_MODEM_RSVD_2_Msk                                                                 (0x1UL << PCC_REG_MODEM_RSVD_2_Pos)

#define PCC_REG_MODEM_RSVD_1_Pos                                                                 24U
#define PCC_REG_MODEM_RSVD_1_Msk                                                                 (0x1UL << PCC_REG_MODEM_RSVD_1_Pos)

#define PCC_REG_MODEM_RSVD_Pos                                                                   25U
#define PCC_REG_MODEM_RSVD_Msk                                                                   (0x3FUL << PCC_REG_MODEM_RSVD_Pos)

#define PCC_REG_MODEM_RESERVED_Pos                                                               31U
#define PCC_REG_MODEM_RESERVED_Msk                                                               (0x1UL << PCC_REG_MODEM_RESERVED_Pos)

/* 0x298    0x4000_0298
    7:0     R/W     RESERVED_16                                     8'b0
    8       R/W     RESERVED_15                                     1'b0
    9       R/W     RESERVED_14                                     1'b1
    10      R/W     RESERVED_13                                     1'b1
    11      R/W     RESERVED_12                                     1'b1
    12      R/W     RESERVED_11                                     1'b1
    13      R/W     RESERVED_10                                     1'b0
    14      R/W     RESERVED_9                                      1'b0
    15      R/W     RSVD_2                                          1'h0
    16      R/W     RESERVED_8                                      1'b0
    17      R/W     RESERVED_7                                      1'b0
    18      R/W     PRO24G_CLK_FORCE                                1'b0
    21:19   R/W     RSVD_1                                          3'b000
    22      R/W     RESERVED_6                                      1'b0
    23      R/W     RESERVED_5                                      1'b0
    24      R/W     RESERVED_4                                      1'b0
    25      R/W     RESERVED_3                                      1'b0
    26      R/W     RESERVED_2                                      1'b0
    27      R/W     RESERVED_1                                      1'b0
    30:28   R/W     RSVD                                            3'b000
    31      R/W     RESERVED                                        1'b0
 */
typedef union _PCC_REG_PROPRIETARY_TYPE
{
    uint32_t d32;
    struct
    {
        uint32_t RESERVED_16: 8;
        uint32_t RESERVED_15: 1;
        uint32_t RESERVED_14: 1;
        uint32_t RESERVED_13: 1;
        uint32_t RESERVED_12: 1;
        uint32_t RESERVED_11: 1;
        uint32_t RESERVED_10: 1;
        uint32_t RESERVED_9: 1;
        uint32_t RSVD_2: 1;
        uint32_t RESERVED_8: 1;
        uint32_t RESERVED_7: 1;
        uint32_t PRO24G_CLK_FORCE: 1;
        uint32_t RSVD_1: 3;
        uint32_t RESERVED_6: 1;
        uint32_t RESERVED_5: 1;
        uint32_t RESERVED_4: 1;
        uint32_t RESERVED_3: 1;
        uint32_t RESERVED_2: 1;
        uint32_t RESERVED_1: 1;
        uint32_t RSVD: 3;
        uint32_t RESERVED: 1;
    };
} PCC_REG_PROPRIETARY_TYPE;

/*0x4000_0298 PCC_REG_PROPRIETARY*/
#define PCC_REG_PROPRIETARY_RESERVED_16_Pos                                                      0U
#define PCC_REG_PROPRIETARY_RESERVED_16_Msk                                                      (0xFFUL << PCC_REG_PROPRIETARY_RESERVED_16_Pos)

#define PCC_REG_PROPRIETARY_RESERVED_15_Pos                                                      8U
#define PCC_REG_PROPRIETARY_RESERVED_15_Msk                                                      (0x1UL << PCC_REG_PROPRIETARY_RESERVED_15_Pos)

#define PCC_REG_PROPRIETARY_RESERVED_14_Pos                                                      9U
#define PCC_REG_PROPRIETARY_RESERVED_14_Msk                                                      (0x1UL << PCC_REG_PROPRIETARY_RESERVED_14_Pos)

#define PCC_REG_PROPRIETARY_RESERVED_13_Pos                                                      10U
#define PCC_REG_PROPRIETARY_RESERVED_13_Msk                                                      (0x1UL << PCC_REG_PROPRIETARY_RESERVED_13_Pos)

#define PCC_REG_PROPRIETARY_RESERVED_12_Pos                                                      11U
#define PCC_REG_PROPRIETARY_RESERVED_12_Msk                                                      (0x1UL << PCC_REG_PROPRIETARY_RESERVED_12_Pos)

