rtkconnectivity/hal_realtek_mainline/bee/soc/inc/rtl87x2j/pcc_reg.h
#define PCC_REG_PROPRIETARY_RESERVED_11_Pos                                                      12U
#define PCC_REG_PROPRIETARY_RESERVED_11_Msk                                                      (0x1UL << PCC_REG_PROPRIETARY_RESERVED_11_Pos)

#define PCC_REG_PROPRIETARY_RESERVED_10_Pos                                                      13U
#define PCC_REG_PROPRIETARY_RESERVED_10_Msk                                                      (0x1UL << PCC_REG_PROPRIETARY_RESERVED_10_Pos)

#define PCC_REG_PROPRIETARY_RESERVED_9_Pos                                                       14U
#define PCC_REG_PROPRIETARY_RESERVED_9_Msk                                                       (0x1UL << PCC_REG_PROPRIETARY_RESERVED_9_Pos)

#define PCC_REG_PROPRIETARY_RSVD_2_Pos                                                           15U
#define PCC_REG_PROPRIETARY_RSVD_2_Msk                                                           (0x1UL << PCC_REG_PROPRIETARY_RSVD_2_Pos)

#define PCC_REG_PROPRIETARY_RESERVED_8_Pos                                                       16U
#define PCC_REG_PROPRIETARY_RESERVED_8_Msk                                                       (0x1UL << PCC_REG_PROPRIETARY_RESERVED_8_Pos)

#define PCC_REG_PROPRIETARY_RESERVED_7_Pos                                                       17U
#define PCC_REG_PROPRIETARY_RESERVED_7_Msk                                                       (0x1UL << PCC_REG_PROPRIETARY_RESERVED_7_Pos)

#define PCC_REG_PROPRIETARY_PRO24G_CLK_FORCE_Pos                                                 18U
#define PCC_REG_PROPRIETARY_PRO24G_CLK_FORCE_Msk                                                 (0x1UL << PCC_REG_PROPRIETARY_PRO24G_CLK_FORCE_Pos)

#define PCC_REG_PROPRIETARY_RSVD_1_Pos                                                           19U
#define PCC_REG_PROPRIETARY_RSVD_1_Msk                                                           (0x7UL << PCC_REG_PROPRIETARY_RSVD_1_Pos)

#define PCC_REG_PROPRIETARY_RESERVED_6_Pos                                                       22U
#define PCC_REG_PROPRIETARY_RESERVED_6_Msk                                                       (0x1UL << PCC_REG_PROPRIETARY_RESERVED_6_Pos)

#define PCC_REG_PROPRIETARY_RESERVED_5_Pos                                                       23U
#define PCC_REG_PROPRIETARY_RESERVED_5_Msk                                                       (0x1UL << PCC_REG_PROPRIETARY_RESERVED_5_Pos)

#define PCC_REG_PROPRIETARY_RESERVED_4_Pos                                                       24U
#define PCC_REG_PROPRIETARY_RESERVED_4_Msk                                                       (0x1UL << PCC_REG_PROPRIETARY_RESERVED_4_Pos)

#define PCC_REG_PROPRIETARY_RESERVED_3_Pos                                                       25U
#define PCC_REG_PROPRIETARY_RESERVED_3_Msk                                                       (0x1UL << PCC_REG_PROPRIETARY_RESERVED_3_Pos)

#define PCC_REG_PROPRIETARY_RESERVED_2_Pos                                                       26U
#define PCC_REG_PROPRIETARY_RESERVED_2_Msk                                                       (0x1UL << PCC_REG_PROPRIETARY_RESERVED_2_Pos)

#define PCC_REG_PROPRIETARY_RESERVED_1_Pos                                                       27U
#define PCC_REG_PROPRIETARY_RESERVED_1_Msk                                                       (0x1UL << PCC_REG_PROPRIETARY_RESERVED_1_Pos)

#define PCC_REG_PROPRIETARY_RSVD_Pos                                                             28U
#define PCC_REG_PROPRIETARY_RSVD_Msk                                                             (0x7UL << PCC_REG_PROPRIETARY_RSVD_Pos)

#define PCC_REG_PROPRIETARY_RESERVED_Pos                                                         31U
#define PCC_REG_PROPRIETARY_RESERVED_Msk                                                         (0x1UL << PCC_REG_PROPRIETARY_RESERVED_Pos)

/* 0x29C    0x4000_029c
    7:0     R/W     ENTRY_DELAY_CORE1_DEV_IR_RC                     8'b0
    8       R/W     RESERVED_7                                      1'b1
    9       R/W     RESERVED_6                                      1'b1
    10      R/W     RESERVED_5                                      1'b1
    11      R/W     RESERVED_4                                      1'b1
    12      R/W     RESERVED_3                                      1'b1
    15:13   R/W     RESERVED_2                                      3'b0
    16      R/W     R_SCLK_IRRC_SRC_SEL_0                           1'b1
    17      R/W     R_SCLK_IRRC_SRC_SEL_1                           1'b0
    18      R/W     IRRC_CLK_FORCE                                  1'b0
    26:19   R/W     RSVD_1                                          8'b000
    27      R/W     RESERVED_1                                      1'b0
    30:28   R/W     RSVD                                            3'b000
    31      R/W     RESERVED                                        1'b0
 */
typedef union _PCC_REG_IR_TYPE
{
    uint32_t d32;
    struct
    {
        uint32_t ENTRY_DELAY_CORE1_DEV_IR_RC: 8;
        uint32_t RESERVED_7: 1;
        uint32_t RESERVED_6: 1;
        uint32_t RESERVED_5: 1;
        uint32_t RESERVED_4: 1;
        uint32_t RESERVED_3: 1;
        uint32_t RESERVED_2: 3;
        uint32_t R_SCLK_IRRC_SRC_SEL_0: 1;
        uint32_t R_SCLK_IRRC_SRC_SEL_1: 1;
        uint32_t IRRC_CLK_FORCE: 1;
        uint32_t RSVD_1: 8;
        uint32_t RESERVED_1: 1;
        uint32_t RSVD: 3;
        uint32_t RESERVED: 1;
    };
} PCC_REG_IR_TYPE;

/*0x4000_029c PCC_REG_IR*/
#define PCC_REG_IR_ENTRY_DELAY_CORE1_DEV_IR_RC_Pos                                               0U
#define PCC_REG_IR_ENTRY_DELAY_CORE1_DEV_IR_RC_Msk                                               (0xFFUL << PCC_REG_IR_ENTRY_DELAY_CORE1_DEV_IR_RC_Pos)

#define PCC_REG_IR_RESERVED_7_Pos                                                                8U
#define PCC_REG_IR_RESERVED_7_Msk                                                                (0x1UL << PCC_REG_IR_RESERVED_7_Pos)

#define PCC_REG_IR_RESERVED_6_Pos                                                                9U
#define PCC_REG_IR_RESERVED_6_Msk                                                                (0x1UL << PCC_REG_IR_RESERVED_6_Pos)

#define PCC_REG_IR_RESERVED_5_Pos                                                                10U
#define PCC_REG_IR_RESERVED_5_Msk                                                                (0x1UL << PCC_REG_IR_RESERVED_5_Pos)

