rtkconnectivity/hal_realtek_mainline/bee/soc/inc/rtl87x2j/pcc_reg.h
#define PCC_REG_BT_VDREG_RESERVED_7_Pos                                                          18U
#define PCC_REG_BT_VDREG_RESERVED_7_Msk                                                          (0x1UL << PCC_REG_BT_VDREG_RESERVED_7_Pos)

#define PCC_REG_BT_VDREG_RSVD_1_Pos                                                              19U
#define PCC_REG_BT_VDREG_RSVD_1_Msk                                                              (0x7UL << PCC_REG_BT_VDREG_RSVD_1_Pos)

#define PCC_REG_BT_VDREG_RESERVED_6_Pos                                                          22U
#define PCC_REG_BT_VDREG_RESERVED_6_Msk                                                          (0x1UL << PCC_REG_BT_VDREG_RESERVED_6_Pos)

#define PCC_REG_BT_VDREG_RESERVED_5_Pos                                                          23U
#define PCC_REG_BT_VDREG_RESERVED_5_Msk                                                          (0x1UL << PCC_REG_BT_VDREG_RESERVED_5_Pos)

#define PCC_REG_BT_VDREG_RESERVED_4_Pos                                                          24U
#define PCC_REG_BT_VDREG_RESERVED_4_Msk                                                          (0x1UL << PCC_REG_BT_VDREG_RESERVED_4_Pos)

#define PCC_REG_BT_VDREG_RESERVED_3_Pos                                                          25U
#define PCC_REG_BT_VDREG_RESERVED_3_Msk                                                          (0x1UL << PCC_REG_BT_VDREG_RESERVED_3_Pos)

#define PCC_REG_BT_VDREG_RESERVED_2_Pos                                                          26U
#define PCC_REG_BT_VDREG_RESERVED_2_Msk                                                          (0x1UL << PCC_REG_BT_VDREG_RESERVED_2_Pos)

#define PCC_REG_BT_VDREG_RESERVED_1_Pos                                                          27U
#define PCC_REG_BT_VDREG_RESERVED_1_Msk                                                          (0x1UL << PCC_REG_BT_VDREG_RESERVED_1_Pos)

#define PCC_REG_BT_VDREG_RSVD_Pos                                                                28U
#define PCC_REG_BT_VDREG_RSVD_Msk                                                                (0x7UL << PCC_REG_BT_VDREG_RSVD_Pos)

#define PCC_REG_BT_VDREG_RESERVED_Pos                                                            31U
#define PCC_REG_BT_VDREG_RESERVED_Msk                                                            (0x1UL << PCC_REG_BT_VDREG_RESERVED_Pos)

/* 0x2A4    0x4000_02a4
    7:0     R/W     ENTRY_DELAY_CORE1_DEV_CODEC                     8'b0
    8       R/W     RESERVED_14                                     1'b0
    9       R/W     RESERVED_13                                     1'b1
    10      R/W     RESERVED_12                                     1'b1
    11      R/W     RESERVED_11                                     1'b1
    12      R/W     RESERVED_10                                     1'b1
    13      R/W     RESERVED_9                                      1'b0
    15:14   R/W     RSVD_2                                          2'h0
    16      R/W     RESERVED_8                                      1'b0
    17      R/W     RESERVED_7                                      1'b0
    18      R/W     CODEC_CLK_FORCE                                 1'b0
    21:19   R/W     RSVD_1                                          3'b000
    22      R/W     RESERVED_6                                      1'b0
    23      R/W     RESERVED_5                                      1'b0
    24      R/W     RESERVED_4                                      1'b0
    25      R/W     RESERVED_3                                      1'b0
    26      R/W     RESERVED_2                                      1'b0
    27      R/W     RESERVED_1                                      1'b0
    30:28   R/W     RSVD                                            3'b000
    31      R/W     RESERVED                                        1'b0
 */
typedef union _PCC_REG_AUDIO_TYPE
{
    uint32_t d32;
    struct
    {
        uint32_t ENTRY_DELAY_CORE1_DEV_CODEC: 8;
        uint32_t RESERVED_14: 1;
        uint32_t RESERVED_13: 1;
        uint32_t RESERVED_12: 1;
        uint32_t RESERVED_11: 1;
        uint32_t RESERVED_10: 1;
        uint32_t RESERVED_9: 1;
        uint32_t RSVD_2: 2;
        uint32_t RESERVED_8: 1;
        uint32_t RESERVED_7: 1;
        uint32_t CODEC_CLK_FORCE: 1;
        uint32_t RSVD_1: 3;
        uint32_t RESERVED_6: 1;
        uint32_t RESERVED_5: 1;
        uint32_t RESERVED_4: 1;
        uint32_t RESERVED_3: 1;
        uint32_t RESERVED_2: 1;
        uint32_t RESERVED_1: 1;
        uint32_t RSVD: 3;
        uint32_t RESERVED: 1;
    };
} PCC_REG_AUDIO_TYPE;

/*0x4000_02a4 PCC_REG_AUDIO*/
#define PCC_REG_AUDIO_ENTRY_DELAY_CORE1_DEV_CODEC_Pos                                            0U
#define PCC_REG_AUDIO_ENTRY_DELAY_CORE1_DEV_CODEC_Msk                                            (0xFFUL << PCC_REG_AUDIO_ENTRY_DELAY_CORE1_DEV_CODEC_Pos)

#define PCC_REG_AUDIO_RESERVED_14_Pos                                                            8U
#define PCC_REG_AUDIO_RESERVED_14_Msk                                                            (0x1UL << PCC_REG_AUDIO_RESERVED_14_Pos)

#define PCC_REG_AUDIO_RESERVED_13_Pos                                                            9U
#define PCC_REG_AUDIO_RESERVED_13_Msk                                                            (0x1UL << PCC_REG_AUDIO_RESERVED_13_Pos)

#define PCC_REG_AUDIO_RESERVED_12_Pos                                                            10U
#define PCC_REG_AUDIO_RESERVED_12_Msk                                                            (0x1UL << PCC_REG_AUDIO_RESERVED_12_Pos)

#define PCC_REG_AUDIO_RESERVED_11_Pos                                                            11U
#define PCC_REG_AUDIO_RESERVED_11_Msk                                                            (0x1UL << PCC_REG_AUDIO_RESERVED_11_Pos)

#define PCC_REG_AUDIO_RESERVED_10_Pos                                                            12U
#define PCC_REG_AUDIO_RESERVED_10_Msk                                                            (0x1UL << PCC_REG_AUDIO_RESERVED_10_Pos)

#define PCC_REG_AUDIO_RESERVED_9_Pos                                                             13U
#define PCC_REG_AUDIO_RESERVED_9_Msk                                                             (0x1UL << PCC_REG_AUDIO_RESERVED_9_Pos)

#define PCC_REG_AUDIO_RSVD_2_Pos                                                                 14U
#define PCC_REG_AUDIO_RSVD_2_Msk                                                                 (0x3UL << PCC_REG_AUDIO_RSVD_2_Pos)

