rtkconnectivity/hal_realtek_mainline/bee/soc/inc/rtl87x2j/pcc_reg.h
#define PCC_REG_LXBUS_LXBUS_CLK_FORCE_Pos                                                        18U
#define PCC_REG_LXBUS_LXBUS_CLK_FORCE_Msk                                                        (0x1UL << PCC_REG_LXBUS_LXBUS_CLK_FORCE_Pos)

#define PCC_REG_LXBUS_RSVD_1_Pos                                                                 19U
#define PCC_REG_LXBUS_RSVD_1_Msk                                                                 (0x7UL << PCC_REG_LXBUS_RSVD_1_Pos)

#define PCC_REG_LXBUS_RESERVED_6_Pos                                                             22U
#define PCC_REG_LXBUS_RESERVED_6_Msk                                                             (0x1UL << PCC_REG_LXBUS_RESERVED_6_Pos)

#define PCC_REG_LXBUS_RESERVED_5_Pos                                                             23U
#define PCC_REG_LXBUS_RESERVED_5_Msk                                                             (0x1UL << PCC_REG_LXBUS_RESERVED_5_Pos)

#define PCC_REG_LXBUS_RESERVED_4_Pos                                                             24U
#define PCC_REG_LXBUS_RESERVED_4_Msk                                                             (0x1UL << PCC_REG_LXBUS_RESERVED_4_Pos)

#define PCC_REG_LXBUS_RESERVED_3_Pos                                                             25U
#define PCC_REG_LXBUS_RESERVED_3_Msk                                                             (0x1UL << PCC_REG_LXBUS_RESERVED_3_Pos)

#define PCC_REG_LXBUS_RESERVED_2_Pos                                                             26U
#define PCC_REG_LXBUS_RESERVED_2_Msk                                                             (0x1UL << PCC_REG_LXBUS_RESERVED_2_Pos)

#define PCC_REG_LXBUS_RESERVED_1_Pos                                                             27U
#define PCC_REG_LXBUS_RESERVED_1_Msk                                                             (0x1UL << PCC_REG_LXBUS_RESERVED_1_Pos)

#define PCC_REG_LXBUS_RSVD_Pos                                                                   28U
#define PCC_REG_LXBUS_RSVD_Msk                                                                   (0x7UL << PCC_REG_LXBUS_RSVD_Pos)

#define PCC_REG_LXBUS_RESERVED_Pos                                                               31U
#define PCC_REG_LXBUS_RESERVED_Msk                                                               (0x1UL << PCC_REG_LXBUS_RESERVED_Pos)

/* 0x2AC    0x4000_02ac
    7:0     R/W     RESERVED_11                                     8'b0
    8       R/W     RESERVED_10                                     1'b0
    9       R/W     RESERVED_9                                      1'b0
    10      R/W     RESERVED_8                                      1'b1
    11      R/W     RESERVED_7                                      1'b1
    12      R/W     RESERVED_6                                      1'b1
    15:13   R/W     RSVD_2                                          3'b0
    16      R/W     ACC_CLK_FORCE                                   1'b0
    18:17   R/W     RSVD_1                                          2'b0
    19      R/W     CAL32K_CLK_FORCE                                1'b0
    24:20   R/W     RSVD                                            5'b0
    25      R/W     RESERVED_5                                      1'b0
    27:26   R/W     RESERVED_4                                      2'b0
    28      R/W     RESERVED_3                                      1'b0
    29      R/W     RESERVED_2                                      1'b0
    30      R/W     RESERVED_1                                      1'b0
    31      R/W     RESERVED                                        1'b0
 */
typedef union _PCC_REG_CAL32K_TYPE
{
    uint32_t d32;
    struct
    {
        uint32_t RESERVED_11: 8;
        uint32_t RESERVED_10: 1;
        uint32_t RESERVED_9: 1;
        uint32_t RESERVED_8: 1;
        uint32_t RESERVED_7: 1;
        uint32_t RESERVED_6: 1;
        uint32_t RSVD_2: 3;
        uint32_t ACC_CLK_FORCE: 1;
        uint32_t RSVD_1: 2;
        uint32_t CAL32K_CLK_FORCE: 1;
        uint32_t RSVD: 5;
        uint32_t RESERVED_5: 1;
        uint32_t RESERVED_4: 2;
        uint32_t RESERVED_3: 1;
        uint32_t RESERVED_2: 1;
        uint32_t RESERVED_1: 1;
        uint32_t RESERVED: 1;
    };
} PCC_REG_CAL32K_TYPE;

/*0x4000_02ac PCC_REG_CAL32K*/
#define PCC_REG_CAL32K_RESERVED_11_Pos                                                           0U
#define PCC_REG_CAL32K_RESERVED_11_Msk                                                           (0xFFUL << PCC_REG_CAL32K_RESERVED_11_Pos)

#define PCC_REG_CAL32K_RESERVED_10_Pos                                                           8U
#define PCC_REG_CAL32K_RESERVED_10_Msk                                                           (0x1UL << PCC_REG_CAL32K_RESERVED_10_Pos)

#define PCC_REG_CAL32K_RESERVED_9_Pos                                                            9U
#define PCC_REG_CAL32K_RESERVED_9_Msk                                                            (0x1UL << PCC_REG_CAL32K_RESERVED_9_Pos)

#define PCC_REG_CAL32K_RESERVED_8_Pos                                                            10U
#define PCC_REG_CAL32K_RESERVED_8_Msk                                                            (0x1UL << PCC_REG_CAL32K_RESERVED_8_Pos)

#define PCC_REG_CAL32K_RESERVED_7_Pos                                                            11U
#define PCC_REG_CAL32K_RESERVED_7_Msk                                                            (0x1UL << PCC_REG_CAL32K_RESERVED_7_Pos)

#define PCC_REG_CAL32K_RESERVED_6_Pos                                                            12U
#define PCC_REG_CAL32K_RESERVED_6_Msk                                                            (0x1UL << PCC_REG_CAL32K_RESERVED_6_Pos)

#define PCC_REG_CAL32K_RSVD_2_Pos                                                                13U
#define PCC_REG_CAL32K_RSVD_2_Msk                                                                (0x7UL << PCC_REG_CAL32K_RSVD_2_Pos)

