rtkconnectivity/hal_realtek_mainline/bee/soc/inc/rtl87x2j/pcc_reg.h
#define PCC_REG_CAL32K_ACC_CLK_FORCE_Pos                                                         16U
#define PCC_REG_CAL32K_ACC_CLK_FORCE_Msk                                                         (0x1UL << PCC_REG_CAL32K_ACC_CLK_FORCE_Pos)

#define PCC_REG_CAL32K_RSVD_1_Pos                                                                17U
#define PCC_REG_CAL32K_RSVD_1_Msk                                                                (0x3UL << PCC_REG_CAL32K_RSVD_1_Pos)

#define PCC_REG_CAL32K_CAL32K_CLK_FORCE_Pos                                                      19U
#define PCC_REG_CAL32K_CAL32K_CLK_FORCE_Msk                                                      (0x1UL << PCC_REG_CAL32K_CAL32K_CLK_FORCE_Pos)

#define PCC_REG_CAL32K_RSVD_Pos                                                                  20U
#define PCC_REG_CAL32K_RSVD_Msk                                                                  (0x1FUL << PCC_REG_CAL32K_RSVD_Pos)

#define PCC_REG_CAL32K_RESERVED_5_Pos                                                            25U
#define PCC_REG_CAL32K_RESERVED_5_Msk                                                            (0x1UL << PCC_REG_CAL32K_RESERVED_5_Pos)

#define PCC_REG_CAL32K_RESERVED_4_Pos                                                            26U
#define PCC_REG_CAL32K_RESERVED_4_Msk                                                            (0x3UL << PCC_REG_CAL32K_RESERVED_4_Pos)

#define PCC_REG_CAL32K_RESERVED_3_Pos                                                            28U
#define PCC_REG_CAL32K_RESERVED_3_Msk                                                            (0x1UL << PCC_REG_CAL32K_RESERVED_3_Pos)

#define PCC_REG_CAL32K_RESERVED_2_Pos                                                            29U
#define PCC_REG_CAL32K_RESERVED_2_Msk                                                            (0x1UL << PCC_REG_CAL32K_RESERVED_2_Pos)

#define PCC_REG_CAL32K_RESERVED_1_Pos                                                            30U
#define PCC_REG_CAL32K_RESERVED_1_Msk                                                            (0x1UL << PCC_REG_CAL32K_RESERVED_1_Pos)

#define PCC_REG_CAL32K_RESERVED_Pos                                                              31U
#define PCC_REG_CAL32K_RESERVED_Msk                                                              (0x1UL << PCC_REG_CAL32K_RESERVED_Pos)

/* 0x2B0    0x4000_02b0
    7:0     R/W     RESERVED_9                                      8'b0
    8       R/W     RESERVED_8                                      1'b1
    9       R/W     RESERVED_7                                      1'b1
    10      R/W     RESERVED_6                                      1'b1
    11      R/W     RESERVED_5                                      1'b0
    12      R/W     RESERVED_4                                      1'b1
    13      R/W     RESERVED_3                                      1'b1
    14      R/W     RESERVED_2                                      1'b1
    15      R/W     RESERVED_1                                      1'b0
    16      R/W     PLATFORM_CLK_FORCE                              1'b0
    17      R/W     PLATFORM_MANU_SEL                               1'b0
    18      R/W     PLATFORM_MANU_DAT                               1'b0
    31:19   R/W     RESERVED                                        13'b0
 */
typedef union _PCC_REG_PLATFORM_TYPE
{
    uint32_t d32;
    struct
    {
        uint32_t RESERVED_9: 8;
        uint32_t RESERVED_8: 1;
        uint32_t RESERVED_7: 1;
        uint32_t RESERVED_6: 1;
        uint32_t RESERVED_5: 1;
        uint32_t RESERVED_4: 1;
        uint32_t RESERVED_3: 1;
        uint32_t RESERVED_2: 1;
        uint32_t RESERVED_1: 1;
        uint32_t PLATFORM_CLK_FORCE: 1;
        uint32_t PLATFORM_MANU_SEL: 1;
        uint32_t PLATFORM_MANU_DAT: 1;
        uint32_t RESERVED: 13;
    };
} PCC_REG_PLATFORM_TYPE;

/*0x4000_02b0 PCC_REG_PLATFORM*/
#define PCC_REG_PLATFORM_RESERVED_9_Pos                                                          0U
#define PCC_REG_PLATFORM_RESERVED_9_Msk                                                          (0xFFUL << PCC_REG_PLATFORM_RESERVED_9_Pos)

#define PCC_REG_PLATFORM_RESERVED_8_Pos                                                          8U
#define PCC_REG_PLATFORM_RESERVED_8_Msk                                                          (0x1UL << PCC_REG_PLATFORM_RESERVED_8_Pos)

#define PCC_REG_PLATFORM_RESERVED_7_Pos                                                          9U
#define PCC_REG_PLATFORM_RESERVED_7_Msk                                                          (0x1UL << PCC_REG_PLATFORM_RESERVED_7_Pos)

#define PCC_REG_PLATFORM_RESERVED_6_Pos                                                          10U
#define PCC_REG_PLATFORM_RESERVED_6_Msk                                                          (0x1UL << PCC_REG_PLATFORM_RESERVED_6_Pos)

#define PCC_REG_PLATFORM_RESERVED_5_Pos                                                          11U
#define PCC_REG_PLATFORM_RESERVED_5_Msk                                                          (0x1UL << PCC_REG_PLATFORM_RESERVED_5_Pos)

#define PCC_REG_PLATFORM_RESERVED_4_Pos                                                          12U
#define PCC_REG_PLATFORM_RESERVED_4_Msk                                                          (0x1UL << PCC_REG_PLATFORM_RESERVED_4_Pos)

#define PCC_REG_PLATFORM_RESERVED_3_Pos                                                          13U
#define PCC_REG_PLATFORM_RESERVED_3_Msk                                                          (0x1UL << PCC_REG_PLATFORM_RESERVED_3_Pos)

#define PCC_REG_PLATFORM_RESERVED_2_Pos                                                          14U
#define PCC_REG_PLATFORM_RESERVED_2_Msk                                                          (0x1UL << PCC_REG_PLATFORM_RESERVED_2_Pos)

#define PCC_REG_PLATFORM_RESERVED_1_Pos                                                          15U
#define PCC_REG_PLATFORM_RESERVED_1_Msk                                                          (0x1UL << PCC_REG_PLATFORM_RESERVED_1_Pos)

