rtkconnectivity/hal_realtek_mainline/bee/soc/inc/rtl87x2j/pcc_reg.h
#define PCC_REG_TMETER_RESERVED_8_Pos                                                            16U
#define PCC_REG_TMETER_RESERVED_8_Msk                                                            (0x1UL << PCC_REG_TMETER_RESERVED_8_Pos)

#define PCC_REG_TMETER_RESERVED_7_Pos                                                            17U
#define PCC_REG_TMETER_RESERVED_7_Msk                                                            (0x1UL << PCC_REG_TMETER_RESERVED_7_Pos)

#define PCC_REG_TMETER_TMETER_CLK_FORCE_Pos                                                      18U
#define PCC_REG_TMETER_TMETER_CLK_FORCE_Msk                                                      (0x1UL << PCC_REG_TMETER_TMETER_CLK_FORCE_Pos)

#define PCC_REG_TMETER_RSVD_1_Pos                                                                19U
#define PCC_REG_TMETER_RSVD_1_Msk                                                                (0x7UL << PCC_REG_TMETER_RSVD_1_Pos)

#define PCC_REG_TMETER_RESERVED_6_Pos                                                            22U
#define PCC_REG_TMETER_RESERVED_6_Msk                                                            (0x1UL << PCC_REG_TMETER_RESERVED_6_Pos)

#define PCC_REG_TMETER_RESERVED_5_Pos                                                            23U
#define PCC_REG_TMETER_RESERVED_5_Msk                                                            (0x1UL << PCC_REG_TMETER_RESERVED_5_Pos)

#define PCC_REG_TMETER_RESERVED_4_Pos                                                            24U
#define PCC_REG_TMETER_RESERVED_4_Msk                                                            (0x1UL << PCC_REG_TMETER_RESERVED_4_Pos)

#define PCC_REG_TMETER_RESERVED_3_Pos                                                            25U
#define PCC_REG_TMETER_RESERVED_3_Msk                                                            (0x1UL << PCC_REG_TMETER_RESERVED_3_Pos)

#define PCC_REG_TMETER_RESERVED_2_Pos                                                            26U
#define PCC_REG_TMETER_RESERVED_2_Msk                                                            (0x1UL << PCC_REG_TMETER_RESERVED_2_Pos)

#define PCC_REG_TMETER_RESERVED_1_Pos                                                            27U
#define PCC_REG_TMETER_RESERVED_1_Msk                                                            (0x1UL << PCC_REG_TMETER_RESERVED_1_Pos)

#define PCC_REG_TMETER_RSVD_Pos                                                                  28U
#define PCC_REG_TMETER_RSVD_Msk                                                                  (0x7UL << PCC_REG_TMETER_RSVD_Pos)

#define PCC_REG_TMETER_RESERVED_Pos                                                              31U
#define PCC_REG_TMETER_RESERVED_Msk                                                              (0x1UL << PCC_REG_TMETER_RESERVED_Pos)

/* 0x2BC    0x4000_02bc
    7:0     R/W     ENTRY_DELAY_CORE1_DEV_TIMER1_PWM                8'b0
    8       R/W     RESERVED_5                                      1'b1
    9       R/W     RESERVED_4                                      1'b1
    10      R/W     RESERVED_3                                      1'b1
    11      R/W     RESERVED_2                                      1'b1
    12      R/W     RESERVED_1                                      1'b1
    13      R/W     RESERVED                                        1'b1
    15:14   R/W     RSVD_1                                          2'b0
    16      R/W     R_TIMER_PWM_9_CLK_SRC_SEL                       1'b0
    17      R/W     R_TIMER_PWM_10_CLK_SRC_SEL                      1'b0
    18      R/W     R_TIMER_PWM_11_CLK_SRC_SEL                      1'b0
    21:19   R/W     R_TIMER_PWM_9_CLK_DIV                           3'h0
    24:22   R/W     R_TIMER_PWM_10_CLK_DIV                          3'h0
    27:25   R/W     R_TIMER_PWM_11_CLK_DIV                          3'h0
    28      R/W     TIMER1_PWM_CH9_CLK_FORCE                        1'b0
    29      R/W     TIMER1_PWM_CH10_CLK_FORCE                       1'b0
    30      R/W     TIMER1_PWM_CH11_CLK_FORCE                       1'b0
    31      R/W     RSVD                                            1'b0
 */
typedef union _PCC_REG_TIMER1_D_TYPE
{
    uint32_t d32;
    struct
    {
        uint32_t ENTRY_DELAY_CORE1_DEV_TIMER1_PWM: 8;
        uint32_t RESERVED_5: 1;
        uint32_t RESERVED_4: 1;
        uint32_t RESERVED_3: 1;
        uint32_t RESERVED_2: 1;
        uint32_t RESERVED_1: 1;
        uint32_t RESERVED: 1;
        uint32_t RSVD_1: 2;
        uint32_t R_TIMER_PWM_9_CLK_SRC_SEL: 1;
        uint32_t R_TIMER_PWM_10_CLK_SRC_SEL: 1;
        uint32_t R_TIMER_PWM_11_CLK_SRC_SEL: 1;
        uint32_t R_TIMER_PWM_9_CLK_DIV: 3;
        uint32_t R_TIMER_PWM_10_CLK_DIV: 3;
        uint32_t R_TIMER_PWM_11_CLK_DIV: 3;
        uint32_t TIMER1_PWM_CH9_CLK_FORCE: 1;
        uint32_t TIMER1_PWM_CH10_CLK_FORCE: 1;
        uint32_t TIMER1_PWM_CH11_CLK_FORCE: 1;
        uint32_t RSVD: 1;
    };
} PCC_REG_TIMER1_D_TYPE;

/*0x4000_02bc PCC_REG_TIMER1_D*/
#define PCC_REG_TIMER1_D_ENTRY_DELAY_CORE1_DEV_TIMER1_PWM_Pos                                    0U
#define PCC_REG_TIMER1_D_ENTRY_DELAY_CORE1_DEV_TIMER1_PWM_Msk                                    (0xFFUL << PCC_REG_TIMER1_D_ENTRY_DELAY_CORE1_DEV_TIMER1_PWM_Pos)

#define PCC_REG_TIMER1_D_RESERVED_5_Pos                                                          8U
#define PCC_REG_TIMER1_D_RESERVED_5_Msk                                                          (0x1UL << PCC_REG_TIMER1_D_RESERVED_5_Pos)

#define PCC_REG_TIMER1_D_RESERVED_4_Pos                                                          9U
#define PCC_REG_TIMER1_D_RESERVED_4_Msk                                                          (0x1UL << PCC_REG_TIMER1_D_RESERVED_4_Pos)

#define PCC_REG_TIMER1_D_RESERVED_3_Pos                                                          10U
#define PCC_REG_TIMER1_D_RESERVED_3_Msk                                                          (0x1UL << PCC_REG_TIMER1_D_RESERVED_3_Pos)

#define PCC_REG_TIMER1_D_RESERVED_2_Pos                                                          11U
#define PCC_REG_TIMER1_D_RESERVED_2_Msk                                                          (0x1UL << PCC_REG_TIMER1_D_RESERVED_2_Pos)

#define PCC_REG_TIMER1_D_RESERVED_1_Pos                                                          12U
#define PCC_REG_TIMER1_D_RESERVED_1_Msk                                                          (0x1UL << PCC_REG_TIMER1_D_RESERVED_1_Pos)

#define PCC_REG_TIMER1_D_RESERVED_Pos                                                            13U
#define PCC_REG_TIMER1_D_RESERVED_Msk                                                            (0x1UL << PCC_REG_TIMER1_D_RESERVED_Pos)

#define PCC_REG_TIMER1_D_RSVD_1_Pos                                                              14U
#define PCC_REG_TIMER1_D_RSVD_1_Msk                                                              (0x3UL << PCC_REG_TIMER1_D_RSVD_1_Pos)

#define PCC_REG_TIMER1_D_R_TIMER_PWM_9_CLK_SRC_SEL_Pos                                           16U
#define PCC_REG_TIMER1_D_R_TIMER_PWM_9_CLK_SRC_SEL_Msk                                           (0x1UL << PCC_REG_TIMER1_D_R_TIMER_PWM_9_CLK_SRC_SEL_Pos)

#define PCC_REG_TIMER1_D_R_TIMER_PWM_10_CLK_SRC_SEL_Pos                                          17U
#define PCC_REG_TIMER1_D_R_TIMER_PWM_10_CLK_SRC_SEL_Msk                                          (0x1UL << PCC_REG_TIMER1_D_R_TIMER_PWM_10_CLK_SRC_SEL_Pos)

#define PCC_REG_TIMER1_D_R_TIMER_PWM_11_CLK_SRC_SEL_Pos                                          18U
#define PCC_REG_TIMER1_D_R_TIMER_PWM_11_CLK_SRC_SEL_Msk                                          (0x1UL << PCC_REG_TIMER1_D_R_TIMER_PWM_11_CLK_SRC_SEL_Pos)

