rtkconnectivity/hal_realtek_mainline/bee/soc/inc/rtl87x2j/pcc_reg.h
#define PCC_REG_TIMER1_D_R_TIMER_PWM_9_CLK_DIV_Pos                                               19U
#define PCC_REG_TIMER1_D_R_TIMER_PWM_9_CLK_DIV_Msk                                               (0x7UL << PCC_REG_TIMER1_D_R_TIMER_PWM_9_CLK_DIV_Pos)

#define PCC_REG_TIMER1_D_R_TIMER_PWM_10_CLK_DIV_Pos                                              22U
#define PCC_REG_TIMER1_D_R_TIMER_PWM_10_CLK_DIV_Msk                                              (0x7UL << PCC_REG_TIMER1_D_R_TIMER_PWM_10_CLK_DIV_Pos)

#define PCC_REG_TIMER1_D_R_TIMER_PWM_11_CLK_DIV_Pos                                              25U
#define PCC_REG_TIMER1_D_R_TIMER_PWM_11_CLK_DIV_Msk                                              (0x7UL << PCC_REG_TIMER1_D_R_TIMER_PWM_11_CLK_DIV_Pos)

#define PCC_REG_TIMER1_D_TIMER1_PWM_CH9_CLK_FORCE_Pos                                            28U
#define PCC_REG_TIMER1_D_TIMER1_PWM_CH9_CLK_FORCE_Msk                                            (0x1UL << PCC_REG_TIMER1_D_TIMER1_PWM_CH9_CLK_FORCE_Pos)

#define PCC_REG_TIMER1_D_TIMER1_PWM_CH10_CLK_FORCE_Pos                                           29U
#define PCC_REG_TIMER1_D_TIMER1_PWM_CH10_CLK_FORCE_Msk                                           (0x1UL << PCC_REG_TIMER1_D_TIMER1_PWM_CH10_CLK_FORCE_Pos)

#define PCC_REG_TIMER1_D_TIMER1_PWM_CH11_CLK_FORCE_Pos                                           30U
#define PCC_REG_TIMER1_D_TIMER1_PWM_CH11_CLK_FORCE_Msk                                           (0x1UL << PCC_REG_TIMER1_D_TIMER1_PWM_CH11_CLK_FORCE_Pos)

#define PCC_REG_TIMER1_D_RSVD_Pos                                                                31U
#define PCC_REG_TIMER1_D_RSVD_Msk                                                                (0x1UL << PCC_REG_TIMER1_D_RSVD_Pos)

/* 0x8F0    0x4000_08f0
    7:0     R/W     ENTRY_DELAY_CORE1_DEV_OSC80M_CAL                8'b0
    8       R/W     RESERVED_10                                     1'b0
    9       R/W     RESERVED_9                                      1'b1
    10      R/W     RESERVED_8                                      1'b1
    11      R/W     RESERVED_7                                      1'b1
    12      R/W     RESERVED_6                                      1'b1
    15:13   R/W     RESERVED_5                                      3'b0
    16      R/W     CAL80M_CLK_FORCE                                1'b0
    19:17   R/W     RSVD                                            3'b0
    20      R/W     RESERVED_4                                      1'b0
    21      R/W     RESERVED_3                                      1'b0
    23:22   R/W     RESERVED_2                                      2'b0
    24      R/W     RESERVED_1                                      1'b0
    31:25   R/W     RESERVED                                        7'b0
 */
typedef union _PCC_REG_CAL80M_TYPE
{
    uint32_t d32;
    struct
    {
        uint32_t ENTRY_DELAY_CORE1_DEV_OSC80M_CAL: 8;
        uint32_t RESERVED_10: 1;
        uint32_t RESERVED_9: 1;
        uint32_t RESERVED_8: 1;
        uint32_t RESERVED_7: 1;
        uint32_t RESERVED_6: 1;
        uint32_t RESERVED_5: 3;
        uint32_t CAL80M_CLK_FORCE: 1;
        uint32_t RSVD: 3;
        uint32_t RESERVED_4: 1;
        uint32_t RESERVED_3: 1;
        uint32_t RESERVED_2: 2;
        uint32_t RESERVED_1: 1;
        uint32_t RESERVED: 7;
    };
} PCC_REG_CAL80M_TYPE;

/*0x4000_08f0 PCC_REG_CAL80M*/
#define PCC_REG_CAL80M_ENTRY_DELAY_CORE1_DEV_OSC80M_CAL_Pos                                      0U
#define PCC_REG_CAL80M_ENTRY_DELAY_CORE1_DEV_OSC80M_CAL_Msk                                      (0xFFUL << PCC_REG_CAL80M_ENTRY_DELAY_CORE1_DEV_OSC80M_CAL_Pos)

#define PCC_REG_CAL80M_RESERVED_10_Pos                                                           8U
#define PCC_REG_CAL80M_RESERVED_10_Msk                                                           (0x1UL << PCC_REG_CAL80M_RESERVED_10_Pos)

#define PCC_REG_CAL80M_RESERVED_9_Pos                                                            9U
#define PCC_REG_CAL80M_RESERVED_9_Msk                                                            (0x1UL << PCC_REG_CAL80M_RESERVED_9_Pos)

#define PCC_REG_CAL80M_RESERVED_8_Pos                                                            10U
#define PCC_REG_CAL80M_RESERVED_8_Msk                                                            (0x1UL << PCC_REG_CAL80M_RESERVED_8_Pos)

#define PCC_REG_CAL80M_RESERVED_7_Pos                                                            11U
#define PCC_REG_CAL80M_RESERVED_7_Msk                                                            (0x1UL << PCC_REG_CAL80M_RESERVED_7_Pos)

#define PCC_REG_CAL80M_RESERVED_6_Pos                                                            12U
#define PCC_REG_CAL80M_RESERVED_6_Msk                                                            (0x1UL << PCC_REG_CAL80M_RESERVED_6_Pos)

#define PCC_REG_CAL80M_RESERVED_5_Pos                                                            13U
#define PCC_REG_CAL80M_RESERVED_5_Msk                                                            (0x7UL << PCC_REG_CAL80M_RESERVED_5_Pos)

#define PCC_REG_CAL80M_CAL80M_CLK_FORCE_Pos                                                      16U
#define PCC_REG_CAL80M_CAL80M_CLK_FORCE_Msk                                                      (0x1UL << PCC_REG_CAL80M_CAL80M_CLK_FORCE_Pos)

#define PCC_REG_CAL80M_RSVD_Pos                                                                  17U
#define PCC_REG_CAL80M_RSVD_Msk                                                                  (0x7UL << PCC_REG_CAL80M_RSVD_Pos)

#define PCC_REG_CAL80M_RESERVED_4_Pos                                                            20U
#define PCC_REG_CAL80M_RESERVED_4_Msk                                                            (0x1UL << PCC_REG_CAL80M_RESERVED_4_Pos)

#define PCC_REG_CAL80M_RESERVED_3_Pos                                                            21U
#define PCC_REG_CAL80M_RESERVED_3_Msk                                                            (0x1UL << PCC_REG_CAL80M_RESERVED_3_Pos)

#define PCC_REG_CAL80M_RESERVED_2_Pos                                                            22U
#define PCC_REG_CAL80M_RESERVED_2_Msk                                                            (0x3UL << PCC_REG_CAL80M_RESERVED_2_Pos)

#define PCC_REG_CAL80M_RESERVED_1_Pos                                                            24U
#define PCC_REG_CAL80M_RESERVED_1_Msk                                                            (0x1UL << PCC_REG_CAL80M_RESERVED_1_Pos)

#define PCC_REG_CAL80M_RESERVED_Pos                                                              25U
#define PCC_REG_CAL80M_RESERVED_Msk                                                              (0x7FUL << PCC_REG_CAL80M_RESERVED_Pos)

/* 0x8F4    0x4000_08f4
    7:0     R/W     ENTRY_DELAY_CORE1_DEV_OSC10M_CAL                8'b0
    8       R/W     RESERVED_10                                     1'b0
    9       R/W     RESERVED_9                                      1'b0
    10      R/W     RESERVED_8                                      1'b1
    11      R/W     RESERVED_7                                      1'b1
    12      R/W     RESERVED_6                                      1'b1
    15:13   R/W     RESERVED_5                                      3'b0
    16      R/W     CAL10M_CLK_FORCE                                1'b0
    19:17   R/W     RSVD                                            3'h0
    20      R/W     RESERVED_4                                      1'b0
    21      R/W     RESERVED_3                                      1'b0
    23:22   R/W     RESERVED_2                                      2'b0
    24      R/W     RESERVED_1                                      1'b0
    31:25   R/W     RESERVED                                        7'b0
 */
typedef union _PCC_REG_CAL10M_TYPE
{
    uint32_t d32;
    struct
    {
        uint32_t ENTRY_DELAY_CORE1_DEV_OSC10M_CAL: 8;
        uint32_t RESERVED_10: 1;
        uint32_t RESERVED_9: 1;
        uint32_t RESERVED_8: 1;
        uint32_t RESERVED_7: 1;
        uint32_t RESERVED_6: 1;
        uint32_t RESERVED_5: 3;
        uint32_t CAL10M_CLK_FORCE: 1;
        uint32_t RSVD: 3;
        uint32_t RESERVED_4: 1;
        uint32_t RESERVED_3: 1;
        uint32_t RESERVED_2: 2;
        uint32_t RESERVED_1: 1;
        uint32_t RESERVED: 7;
    };
} PCC_REG_CAL10M_TYPE;

/*0x4000_08f4 PCC_REG_CAL10M*/
#define PCC_REG_CAL10M_ENTRY_DELAY_CORE1_DEV_OSC10M_CAL_Pos                                      0U
#define PCC_REG_CAL10M_ENTRY_DELAY_CORE1_DEV_OSC10M_CAL_Msk                                      (0xFFUL << PCC_REG_CAL10M_ENTRY_DELAY_CORE1_DEV_OSC10M_CAL_Pos)

#define PCC_REG_CAL10M_RESERVED_10_Pos                                                           8U
#define PCC_REG_CAL10M_RESERVED_10_Msk                                                           (0x1UL << PCC_REG_CAL10M_RESERVED_10_Pos)

#define PCC_REG_CAL10M_RESERVED_9_Pos                                                            9U
#define PCC_REG_CAL10M_RESERVED_9_Msk                                                            (0x1UL << PCC_REG_CAL10M_RESERVED_9_Pos)

#define PCC_REG_CAL10M_RESERVED_8_Pos                                                            10U
#define PCC_REG_CAL10M_RESERVED_8_Msk                                                            (0x1UL << PCC_REG_CAL10M_RESERVED_8_Pos)

#define PCC_REG_CAL10M_RESERVED_7_Pos                                                            11U
#define PCC_REG_CAL10M_RESERVED_7_Msk                                                            (0x1UL << PCC_REG_CAL10M_RESERVED_7_Pos)

