rtkconnectivity/hal_realtek_mainline/bee/soc/inc/rtl87x2j/pcc_reg.h
#define PCC_REG_CAL10M_RESERVED_6_Pos                                                            12U
#define PCC_REG_CAL10M_RESERVED_6_Msk                                                            (0x1UL << PCC_REG_CAL10M_RESERVED_6_Pos)

#define PCC_REG_CAL10M_RESERVED_5_Pos                                                            13U
#define PCC_REG_CAL10M_RESERVED_5_Msk                                                            (0x7UL << PCC_REG_CAL10M_RESERVED_5_Pos)

#define PCC_REG_CAL10M_CAL10M_CLK_FORCE_Pos                                                      16U
#define PCC_REG_CAL10M_CAL10M_CLK_FORCE_Msk                                                      (0x1UL << PCC_REG_CAL10M_CAL10M_CLK_FORCE_Pos)

#define PCC_REG_CAL10M_RSVD_Pos                                                                  17U
#define PCC_REG_CAL10M_RSVD_Msk                                                                  (0x7UL << PCC_REG_CAL10M_RSVD_Pos)

#define PCC_REG_CAL10M_RESERVED_4_Pos                                                            20U
#define PCC_REG_CAL10M_RESERVED_4_Msk                                                            (0x1UL << PCC_REG_CAL10M_RESERVED_4_Pos)

#define PCC_REG_CAL10M_RESERVED_3_Pos                                                            21U
#define PCC_REG_CAL10M_RESERVED_3_Msk                                                            (0x1UL << PCC_REG_CAL10M_RESERVED_3_Pos)

#define PCC_REG_CAL10M_RESERVED_2_Pos                                                            22U
#define PCC_REG_CAL10M_RESERVED_2_Msk                                                            (0x3UL << PCC_REG_CAL10M_RESERVED_2_Pos)

#define PCC_REG_CAL10M_RESERVED_1_Pos                                                            24U
#define PCC_REG_CAL10M_RESERVED_1_Msk                                                            (0x1UL << PCC_REG_CAL10M_RESERVED_1_Pos)

#define PCC_REG_CAL10M_RESERVED_Pos                                                              25U
#define PCC_REG_CAL10M_RESERVED_Msk                                                              (0x7FUL << PCC_REG_CAL10M_RESERVED_Pos)

/* 0x8F8    0x4000_08f8
    7:0     R/W     ENTRY_DELAY_CORE1_DEV_VDREG                     8'b0
    8       R/W     RESERVED_8                                      1'b0
    9       R/W     RESERVED_7                                      1'b0
    10      R/W     RESERVED_6                                      1'b0
    11      R/W     RESERVED_5                                      1'b1
    12      R/W     RESERVED_4                                      1'b1
    15:13   R/W     RESERVED_3                                      3'b0
    16      R/W     VDREG_CLK_FORCE                                 1'b0
    17      R/W     RESERVED_2                                      1'b0
    18      R/W     RESERVED_1                                      1'b0
    31:19   R/W     RESERVED                                        13'b0
 */
typedef union _PCC_REG_VDREG_TYPE
{
    uint32_t d32;
    struct
    {
        uint32_t ENTRY_DELAY_CORE1_DEV_VDREG: 8;
        uint32_t RESERVED_8: 1;
        uint32_t RESERVED_7: 1;
        uint32_t RESERVED_6: 1;
        uint32_t RESERVED_5: 1;
        uint32_t RESERVED_4: 1;
        uint32_t RESERVED_3: 3;
        uint32_t VDREG_CLK_FORCE: 1;
        uint32_t RESERVED_2: 1;
        uint32_t RESERVED_1: 1;
        uint32_t RESERVED: 13;
    };
} PCC_REG_VDREG_TYPE;

/*0x4000_08f8 PCC_REG_VDREG*/
#define PCC_REG_VDREG_ENTRY_DELAY_CORE1_DEV_VDREG_Pos                                            0U
#define PCC_REG_VDREG_ENTRY_DELAY_CORE1_DEV_VDREG_Msk                                            (0xFFUL << PCC_REG_VDREG_ENTRY_DELAY_CORE1_DEV_VDREG_Pos)

#define PCC_REG_VDREG_RESERVED_8_Pos                                                             8U
#define PCC_REG_VDREG_RESERVED_8_Msk                                                             (0x1UL << PCC_REG_VDREG_RESERVED_8_Pos)

#define PCC_REG_VDREG_RESERVED_7_Pos                                                             9U
#define PCC_REG_VDREG_RESERVED_7_Msk                                                             (0x1UL << PCC_REG_VDREG_RESERVED_7_Pos)

#define PCC_REG_VDREG_RESERVED_6_Pos                                                             10U
#define PCC_REG_VDREG_RESERVED_6_Msk                                                             (0x1UL << PCC_REG_VDREG_RESERVED_6_Pos)

#define PCC_REG_VDREG_RESERVED_5_Pos                                                             11U
#define PCC_REG_VDREG_RESERVED_5_Msk                                                             (0x1UL << PCC_REG_VDREG_RESERVED_5_Pos)

#define PCC_REG_VDREG_RESERVED_4_Pos                                                             12U
#define PCC_REG_VDREG_RESERVED_4_Msk                                                             (0x1UL << PCC_REG_VDREG_RESERVED_4_Pos)

#define PCC_REG_VDREG_RESERVED_3_Pos                                                             13U
#define PCC_REG_VDREG_RESERVED_3_Msk                                                             (0x7UL << PCC_REG_VDREG_RESERVED_3_Pos)

#define PCC_REG_VDREG_VDREG_CLK_FORCE_Pos                                                        16U
#define PCC_REG_VDREG_VDREG_CLK_FORCE_Msk                                                        (0x1UL << PCC_REG_VDREG_VDREG_CLK_FORCE_Pos)

#define PCC_REG_VDREG_RESERVED_2_Pos                                                             17U
#define PCC_REG_VDREG_RESERVED_2_Msk                                                             (0x1UL << PCC_REG_VDREG_RESERVED_2_Pos)

#define PCC_REG_VDREG_RESERVED_1_Pos                                                             18U
#define PCC_REG_VDREG_RESERVED_1_Msk                                                             (0x1UL << PCC_REG_VDREG_RESERVED_1_Pos)

#define PCC_REG_VDREG_RESERVED_Pos                                                               19U
#define PCC_REG_VDREG_RESERVED_Msk                                                               (0x1FFFUL << PCC_REG_VDREG_RESERVED_Pos)

/* 0x8FC    0x4000_08fc
    7:0     R/W     ENTRY_DELAY_CM33                                8'b0
    8       R/W     RESERVED_6                                      1'b0
    9       R/W     RESERVED_5                                      1'b0
    10      R/W     RESERVED_4                                      1'b0
    11      R/W     RESERVED_3                                      1'b1
    12      R/W     RESERVED_2                                      1'b1
    15:13   R/W     RESERVED_1                                      3'b0
    16      R/W     CM33_CLK_FORCE                                  1'b0
    31:17   R/W     RESERVED                                        15'b0
 */
typedef union _PCC_REG_CPU_TYPE
{
    uint32_t d32;
    struct
    {
        uint32_t ENTRY_DELAY_CM33: 8;
        uint32_t RESERVED_6: 1;
        uint32_t RESERVED_5: 1;
        uint32_t RESERVED_4: 1;
        uint32_t RESERVED_3: 1;
        uint32_t RESERVED_2: 1;
        uint32_t RESERVED_1: 3;
        uint32_t CM33_CLK_FORCE: 1;
        uint32_t RESERVED: 15;
    };
} PCC_REG_CPU_TYPE;

/*0x4000_08fc PCC_REG_CPU*/
#define PCC_REG_CPU_ENTRY_DELAY_CM33_Pos                                                         0U
#define PCC_REG_CPU_ENTRY_DELAY_CM33_Msk                                                         (0xFFUL << PCC_REG_CPU_ENTRY_DELAY_CM33_Pos)

