rtkconnectivity/hal_realtek_mainline/bee/soc/inc/rtl87x2j/pcc_reg.h
#define PCC_REG_CPU_RESERVED_6_Pos                                                               8U
#define PCC_REG_CPU_RESERVED_6_Msk                                                               (0x1UL << PCC_REG_CPU_RESERVED_6_Pos)

#define PCC_REG_CPU_RESERVED_5_Pos                                                               9U
#define PCC_REG_CPU_RESERVED_5_Msk                                                               (0x1UL << PCC_REG_CPU_RESERVED_5_Pos)

#define PCC_REG_CPU_RESERVED_4_Pos                                                               10U
#define PCC_REG_CPU_RESERVED_4_Msk                                                               (0x1UL << PCC_REG_CPU_RESERVED_4_Pos)

#define PCC_REG_CPU_RESERVED_3_Pos                                                               11U
#define PCC_REG_CPU_RESERVED_3_Msk                                                               (0x1UL << PCC_REG_CPU_RESERVED_3_Pos)

#define PCC_REG_CPU_RESERVED_2_Pos                                                               12U
#define PCC_REG_CPU_RESERVED_2_Msk                                                               (0x1UL << PCC_REG_CPU_RESERVED_2_Pos)

#define PCC_REG_CPU_RESERVED_1_Pos                                                               13U
#define PCC_REG_CPU_RESERVED_1_Msk                                                               (0x7UL << PCC_REG_CPU_RESERVED_1_Pos)

#define PCC_REG_CPU_CM33_CLK_FORCE_Pos                                                           16U
#define PCC_REG_CPU_CM33_CLK_FORCE_Msk                                                           (0x1UL << PCC_REG_CPU_CM33_CLK_FORCE_Pos)

#define PCC_REG_CPU_RESERVED_Pos                                                                 17U
#define PCC_REG_CPU_RESERVED_Msk                                                                 (0x7FFFUL << PCC_REG_CPU_RESERVED_Pos)

/* 0x900    0x4000_0900
    7:0     R/W     ENTRY_DELAY_CORE1_DEV_SYSON                     8'b0
    15:8    R/W     RESERVED_1                                      8'b0
    16      R/W     SYSON_CLK_FORCE                                 1'b0
    17      R/W     RFC_MANU_SEL                                    1'b0
    18      R/W     RFC_MANU_DAT                                    1'b0
    31:19   R/W     RESERVED                                        13'b0
 */
typedef union _PCC_REG_SYSON_TYPE
{
    uint32_t d32;
    struct
    {
        uint32_t ENTRY_DELAY_CORE1_DEV_SYSON: 8;
        uint32_t RESERVED_1: 8;
        uint32_t SYSON_CLK_FORCE: 1;
        uint32_t RFC_MANU_SEL: 1;
        uint32_t RFC_MANU_DAT: 1;
        uint32_t RESERVED: 13;
    };
} PCC_REG_SYSON_TYPE;

/*0x4000_0900 PCC_REG_SYSON*/
#define PCC_REG_SYSON_ENTRY_DELAY_CORE1_DEV_SYSON_Pos                                            0U
#define PCC_REG_SYSON_ENTRY_DELAY_CORE1_DEV_SYSON_Msk                                            (0xFFUL << PCC_REG_SYSON_ENTRY_DELAY_CORE1_DEV_SYSON_Pos)

#define PCC_REG_SYSON_RESERVED_1_Pos                                                             8U
#define PCC_REG_SYSON_RESERVED_1_Msk                                                             (0xFFUL << PCC_REG_SYSON_RESERVED_1_Pos)

#define PCC_REG_SYSON_SYSON_CLK_FORCE_Pos                                                        16U
#define PCC_REG_SYSON_SYSON_CLK_FORCE_Msk                                                        (0x1UL << PCC_REG_SYSON_SYSON_CLK_FORCE_Pos)

#define PCC_REG_SYSON_RFC_MANU_SEL_Pos                                                           17U
#define PCC_REG_SYSON_RFC_MANU_SEL_Msk                                                           (0x1UL << PCC_REG_SYSON_RFC_MANU_SEL_Pos)

#define PCC_REG_SYSON_RFC_MANU_DAT_Pos                                                           18U
#define PCC_REG_SYSON_RFC_MANU_DAT_Msk                                                           (0x1UL << PCC_REG_SYSON_RFC_MANU_DAT_Pos)

#define PCC_REG_SYSON_RESERVED_Pos                                                               19U
#define PCC_REG_SYSON_RESERVED_Msk                                                               (0x1FFFUL << PCC_REG_SYSON_RESERVED_Pos)

/* 0x904    0x4000_0904
    7:0     R/W     ENTRY_DELAY_CORE1_DEV_HCI                       8'b0
    8       R/W     RESERVED_5                                      1'b0
    9       R/W     RESERVED_4                                      1'b1
    10      R/W     RESERVED_3                                      1'b1
    11      R/W     RESERVED_2                                      1'b1
    12      R/W     RESERVED_1                                      1'b1
    15:13   R/W     RSVD                                            3'h0
    16      R/W     HCI_CLK_FORCE                                   1'b0
    31:17   R/W     RESERVED                                        15'b0
 */
typedef union _PCC_REG_HCI_TYPE
{
    uint32_t d32;
    struct
    {
        uint32_t ENTRY_DELAY_CORE1_DEV_HCI: 8;
        uint32_t RESERVED_5: 1;
        uint32_t RESERVED_4: 1;
        uint32_t RESERVED_3: 1;
        uint32_t RESERVED_2: 1;
        uint32_t RESERVED_1: 1;
        uint32_t RSVD: 3;
        uint32_t HCI_CLK_FORCE: 1;
        uint32_t RESERVED: 15;
    };
} PCC_REG_HCI_TYPE;

/*0x4000_0904 PCC_REG_HCI*/
#define PCC_REG_HCI_ENTRY_DELAY_CORE1_DEV_HCI_Pos                                                0U
#define PCC_REG_HCI_ENTRY_DELAY_CORE1_DEV_HCI_Msk                                                (0xFFUL << PCC_REG_HCI_ENTRY_DELAY_CORE1_DEV_HCI_Pos)

#define PCC_REG_HCI_RESERVED_5_Pos                                                               8U
#define PCC_REG_HCI_RESERVED_5_Msk                                                               (0x1UL << PCC_REG_HCI_RESERVED_5_Pos)

#define PCC_REG_HCI_RESERVED_4_Pos                                                               9U
#define PCC_REG_HCI_RESERVED_4_Msk                                                               (0x1UL << PCC_REG_HCI_RESERVED_4_Pos)

#define PCC_REG_HCI_RESERVED_3_Pos                                                               10U
#define PCC_REG_HCI_RESERVED_3_Msk                                                               (0x1UL << PCC_REG_HCI_RESERVED_3_Pos)

