rtkconnectivity/hal_realtek_mainline/bee/soc/inc/rtl87x2j/pcc_reg.h
#define PCC_REG_HCI_RESERVED_2_Pos                                                               11U
#define PCC_REG_HCI_RESERVED_2_Msk                                                               (0x1UL << PCC_REG_HCI_RESERVED_2_Pos)

#define PCC_REG_HCI_RESERVED_1_Pos                                                               12U
#define PCC_REG_HCI_RESERVED_1_Msk                                                               (0x1UL << PCC_REG_HCI_RESERVED_1_Pos)

#define PCC_REG_HCI_RSVD_Pos                                                                     13U
#define PCC_REG_HCI_RSVD_Msk                                                                     (0x7UL << PCC_REG_HCI_RSVD_Pos)

#define PCC_REG_HCI_HCI_CLK_FORCE_Pos                                                            16U
#define PCC_REG_HCI_HCI_CLK_FORCE_Msk                                                            (0x1UL << PCC_REG_HCI_HCI_CLK_FORCE_Pos)

#define PCC_REG_HCI_RESERVED_Pos                                                                 17U
#define PCC_REG_HCI_RESERVED_Msk                                                                 (0x7FFFUL << PCC_REG_HCI_RESERVED_Pos)

/* 0x908    0x4000_0908
    7:0     R/W     ENTRY_DELAY_CORE1_DEV_RFC                       8'b0
    15:8    R/W     ENTRY_DELAY_CORE1_DEV_BLUEWIZ_BRIDGE            8'b0
    23:16   R/W     ENTRY_DELAY_CORE1_DEV_2P4G_MAC                  8'b0
    31:24   R/W     ENTRY_DELAY_CORE1_DEV_BTMAC                     8'b0
 */
typedef union _PCC_REG_BT_OTHER0_TYPE
{
    uint32_t d32;
    struct
    {
        uint32_t ENTRY_DELAY_CORE1_DEV_RFC: 8;
        uint32_t ENTRY_DELAY_CORE1_DEV_BLUEWIZ_BRIDGE: 8;
        uint32_t ENTRY_DELAY_CORE1_DEV_2P4G_MAC: 8;
        uint32_t ENTRY_DELAY_CORE1_DEV_BTMAC: 8;
    };
} PCC_REG_BT_OTHER0_TYPE;

/*0x4000_0908 PCC_REG_BT_OTHER0*/
#define PCC_REG_BT_OTHER0_ENTRY_DELAY_CORE1_DEV_RFC_Pos                                          0U
#define PCC_REG_BT_OTHER0_ENTRY_DELAY_CORE1_DEV_RFC_Msk                                          (0xFFUL << PCC_REG_BT_OTHER0_ENTRY_DELAY_CORE1_DEV_RFC_Pos)

#define PCC_REG_BT_OTHER0_ENTRY_DELAY_CORE1_DEV_BLUEWIZ_BRIDGE_Pos                               8U
#define PCC_REG_BT_OTHER0_ENTRY_DELAY_CORE1_DEV_BLUEWIZ_BRIDGE_Msk                               (0xFFUL << PCC_REG_BT_OTHER0_ENTRY_DELAY_CORE1_DEV_BLUEWIZ_BRIDGE_Pos)

#define PCC_REG_BT_OTHER0_ENTRY_DELAY_CORE1_DEV_2P4G_MAC_Pos                                     16U
#define PCC_REG_BT_OTHER0_ENTRY_DELAY_CORE1_DEV_2P4G_MAC_Msk                                     (0xFFUL << PCC_REG_BT_OTHER0_ENTRY_DELAY_CORE1_DEV_2P4G_MAC_Pos)

#define PCC_REG_BT_OTHER0_ENTRY_DELAY_CORE1_DEV_BTMAC_Pos                                        24U
#define PCC_REG_BT_OTHER0_ENTRY_DELAY_CORE1_DEV_BTMAC_Msk                                        (0xFFUL << PCC_REG_BT_OTHER0_ENTRY_DELAY_CORE1_DEV_BTMAC_Pos)

/* 0x90C    0x4000_090c
    7:0     R/W     ENTRY_DELAY_CORE1_DEV_TIMER0_PCLK               8'b0
    8       R/W     RESERVED_4                                      1'b0
    9       R/W     RESERVED_3                                      1'b1
    10      R/W     RESERVED_2                                      1'b1
    21:11   R/W     RESERVED_1                                      11'b0
    22      R/W     TIMER0_PCLK_CLK_FORCE                           1'b0
    31:23   R/W     RESERVED                                        9'b0
 */
typedef union _PCC_REG_TIMER0_PCLK_TYPE
{
    uint32_t d32;
    struct
    {
        uint32_t ENTRY_DELAY_CORE1_DEV_TIMER0_PCLK: 8;
        uint32_t RESERVED_4: 1;
        uint32_t RESERVED_3: 1;
        uint32_t RESERVED_2: 1;
        uint32_t RESERVED_1: 11;
        uint32_t TIMER0_PCLK_CLK_FORCE: 1;
        uint32_t RESERVED: 9;
    };
} PCC_REG_TIMER0_PCLK_TYPE;

/*0x4000_090c PCC_REG_TIMER0_PCLK*/
#define PCC_REG_TIMER0_PCLK_ENTRY_DELAY_CORE1_DEV_TIMER0_PCLK_Pos                                0U
#define PCC_REG_TIMER0_PCLK_ENTRY_DELAY_CORE1_DEV_TIMER0_PCLK_Msk                                (0xFFUL << PCC_REG_TIMER0_PCLK_ENTRY_DELAY_CORE1_DEV_TIMER0_PCLK_Pos)

#define PCC_REG_TIMER0_PCLK_RESERVED_4_Pos                                                       8U
#define PCC_REG_TIMER0_PCLK_RESERVED_4_Msk                                                       (0x1UL << PCC_REG_TIMER0_PCLK_RESERVED_4_Pos)

#define PCC_REG_TIMER0_PCLK_RESERVED_3_Pos                                                       9U
#define PCC_REG_TIMER0_PCLK_RESERVED_3_Msk                                                       (0x1UL << PCC_REG_TIMER0_PCLK_RESERVED_3_Pos)

#define PCC_REG_TIMER0_PCLK_RESERVED_2_Pos                                                       10U
#define PCC_REG_TIMER0_PCLK_RESERVED_2_Msk                                                       (0x1UL << PCC_REG_TIMER0_PCLK_RESERVED_2_Pos)

#define PCC_REG_TIMER0_PCLK_RESERVED_1_Pos                                                       11U
#define PCC_REG_TIMER0_PCLK_RESERVED_1_Msk                                                       (0x7FFUL << PCC_REG_TIMER0_PCLK_RESERVED_1_Pos)

#define PCC_REG_TIMER0_PCLK_TIMER0_PCLK_CLK_FORCE_Pos                                            22U
#define PCC_REG_TIMER0_PCLK_TIMER0_PCLK_CLK_FORCE_Msk                                            (0x1UL << PCC_REG_TIMER0_PCLK_TIMER0_PCLK_CLK_FORCE_Pos)

#define PCC_REG_TIMER0_PCLK_RESERVED_Pos                                                         23U
#define PCC_REG_TIMER0_PCLK_RESERVED_Msk                                                         (0x1FFUL << PCC_REG_TIMER0_PCLK_RESERVED_Pos)

/* 0x910    0x4000_0910
    7:0     R/W     ENTRY_DELAY_CORE1_DEV_TIMER1_PCLK               8'b0
    8       R/W     RESERVED_4                                      1'b0
    9       R/W     RESERVED_3                                      1'b1
    10      R/W     RESERVED_2                                      1'b1
    21:11   R/W     RESERVED_1                                      11'b0
    22      R/W     TIMER1_PCLK_CLK_FORCE                           1'b0
    31:23   R/W     RESERVED                                        9'b0
 */
typedef union _PCC_REG_TIMER1_PCLK_TYPE
{
    uint32_t d32;
    struct
    {
        uint32_t ENTRY_DELAY_CORE1_DEV_TIMER1_PCLK: 8;
        uint32_t RESERVED_4: 1;
        uint32_t RESERVED_3: 1;
        uint32_t RESERVED_2: 1;
        uint32_t RESERVED_1: 11;
        uint32_t TIMER1_PCLK_CLK_FORCE: 1;
        uint32_t RESERVED: 9;
    };
} PCC_REG_TIMER1_PCLK_TYPE;

/*0x4000_0910 PCC_REG_TIMER1_PCLK*/
#define PCC_REG_TIMER1_PCLK_ENTRY_DELAY_CORE1_DEV_TIMER1_PCLK_Pos                                0U
#define PCC_REG_TIMER1_PCLK_ENTRY_DELAY_CORE1_DEV_TIMER1_PCLK_Msk                                (0xFFUL << PCC_REG_TIMER1_PCLK_ENTRY_DELAY_CORE1_DEV_TIMER1_PCLK_Pos)

