rtkconnectivity/hal_realtek_mainline/bee/soc/inc/rtl87x2j/pcc_reg.h
#define PCC_REG_TIMER1_PCLK_RESERVED_4_Pos                                                       8U
#define PCC_REG_TIMER1_PCLK_RESERVED_4_Msk                                                       (0x1UL << PCC_REG_TIMER1_PCLK_RESERVED_4_Pos)

#define PCC_REG_TIMER1_PCLK_RESERVED_3_Pos                                                       9U
#define PCC_REG_TIMER1_PCLK_RESERVED_3_Msk                                                       (0x1UL << PCC_REG_TIMER1_PCLK_RESERVED_3_Pos)

#define PCC_REG_TIMER1_PCLK_RESERVED_2_Pos                                                       10U
#define PCC_REG_TIMER1_PCLK_RESERVED_2_Msk                                                       (0x1UL << PCC_REG_TIMER1_PCLK_RESERVED_2_Pos)

#define PCC_REG_TIMER1_PCLK_RESERVED_1_Pos                                                       11U
#define PCC_REG_TIMER1_PCLK_RESERVED_1_Msk                                                       (0x7FFUL << PCC_REG_TIMER1_PCLK_RESERVED_1_Pos)

#define PCC_REG_TIMER1_PCLK_TIMER1_PCLK_CLK_FORCE_Pos                                            22U
#define PCC_REG_TIMER1_PCLK_TIMER1_PCLK_CLK_FORCE_Msk                                            (0x1UL << PCC_REG_TIMER1_PCLK_TIMER1_PCLK_CLK_FORCE_Pos)

#define PCC_REG_TIMER1_PCLK_RESERVED_Pos                                                         23U
#define PCC_REG_TIMER1_PCLK_RESERVED_Msk                                                         (0x1FFUL << PCC_REG_TIMER1_PCLK_RESERVED_Pos)

/* 0x914    0x4000_0914
    7:0     R/W     ENTRY_DELAY_CORE1_DEV_ETIMER_PCLK               8'b0
    8       R/W     RESERVED_4                                      1'b0
    9       R/W     RESERVED_3                                      1'b1
    10      R/W     RESERVED_2                                      1'b1
    21:11   R/W     RESERVED_1                                      11'b0
    22      R/W     ETIMER_PCLK_CLK_FORCE                           1'b0
    31:23   R/W     RESERVED                                        9'b0
 */
typedef union _PCC_REG_ETIMER_PCLK_TYPE
{
    uint32_t d32;
    struct
    {
        uint32_t ENTRY_DELAY_CORE1_DEV_ETIMER_PCLK: 8;
        uint32_t RESERVED_4: 1;
        uint32_t RESERVED_3: 1;
        uint32_t RESERVED_2: 1;
        uint32_t RESERVED_1: 11;
        uint32_t ETIMER_PCLK_CLK_FORCE: 1;
        uint32_t RESERVED: 9;
    };
} PCC_REG_ETIMER_PCLK_TYPE;

/*0x4000_0914 PCC_REG_ETIMER_PCLK*/
#define PCC_REG_ETIMER_PCLK_ENTRY_DELAY_CORE1_DEV_ETIMER_PCLK_Pos                                0U
#define PCC_REG_ETIMER_PCLK_ENTRY_DELAY_CORE1_DEV_ETIMER_PCLK_Msk                                (0xFFUL << PCC_REG_ETIMER_PCLK_ENTRY_DELAY_CORE1_DEV_ETIMER_PCLK_Pos)

#define PCC_REG_ETIMER_PCLK_RESERVED_4_Pos                                                       8U
#define PCC_REG_ETIMER_PCLK_RESERVED_4_Msk                                                       (0x1UL << PCC_REG_ETIMER_PCLK_RESERVED_4_Pos)

#define PCC_REG_ETIMER_PCLK_RESERVED_3_Pos                                                       9U
#define PCC_REG_ETIMER_PCLK_RESERVED_3_Msk                                                       (0x1UL << PCC_REG_ETIMER_PCLK_RESERVED_3_Pos)

#define PCC_REG_ETIMER_PCLK_RESERVED_2_Pos                                                       10U
#define PCC_REG_ETIMER_PCLK_RESERVED_2_Msk                                                       (0x1UL << PCC_REG_ETIMER_PCLK_RESERVED_2_Pos)

#define PCC_REG_ETIMER_PCLK_RESERVED_1_Pos                                                       11U
#define PCC_REG_ETIMER_PCLK_RESERVED_1_Msk                                                       (0x7FFUL << PCC_REG_ETIMER_PCLK_RESERVED_1_Pos)

#define PCC_REG_ETIMER_PCLK_ETIMER_PCLK_CLK_FORCE_Pos                                            22U
#define PCC_REG_ETIMER_PCLK_ETIMER_PCLK_CLK_FORCE_Msk                                            (0x1UL << PCC_REG_ETIMER_PCLK_ETIMER_PCLK_CLK_FORCE_Pos)

#define PCC_REG_ETIMER_PCLK_RESERVED_Pos                                                         23U
#define PCC_REG_ETIMER_PCLK_RESERVED_Msk                                                         (0x1FFUL << PCC_REG_ETIMER_PCLK_RESERVED_Pos)

/* 0x918    0x4000_0918
    7:0     R/W     ENTRY_DELAY_CORE1_DEV_OSC128K_CAL               8'b0
    31:8    R/W     RESERVED                                        24'b0
 */
typedef union _PCC_REG_OSC128K_CAL_TYPE
{
    uint32_t d32;
    struct
    {
        uint32_t ENTRY_DELAY_CORE1_DEV_OSC128K_CAL: 8;
        uint32_t RESERVED: 24;
    };
} PCC_REG_OSC128K_CAL_TYPE;

/*0x4000_0918 PCC_REG_OSC128K_CAL*/
#define PCC_REG_OSC128K_CAL_ENTRY_DELAY_CORE1_DEV_OSC128K_CAL_Pos                                0U
#define PCC_REG_OSC128K_CAL_ENTRY_DELAY_CORE1_DEV_OSC128K_CAL_Msk                                (0xFFUL << PCC_REG_OSC128K_CAL_ENTRY_DELAY_CORE1_DEV_OSC128K_CAL_Pos)

#define PCC_REG_OSC128K_CAL_RESERVED_Pos                                                         8U
#define PCC_REG_OSC128K_CAL_RESERVED_Msk                                                         (0xFFFFFFUL << PCC_REG_OSC128K_CAL_RESERVED_Pos)

/* 0x91C    0x4000_091c
    7:0     R/W     ENTRY_DELAY_RXI300                              8'b0
    31:8    R/W     RESERVED                                        24'b0
 */
typedef union _PCC_REG_RXI300_TYPE
{
    uint32_t d32;
    struct
    {
        uint32_t ENTRY_DELAY_RXI300: 8;
        uint32_t RESERVED: 24;
    };
} PCC_REG_RXI300_TYPE;

/*0x4000_091c PCC_REG_RXI300*/
#define PCC_REG_RXI300_ENTRY_DELAY_RXI300_Pos                                                    0U
#define PCC_REG_RXI300_ENTRY_DELAY_RXI300_Msk                                                    (0xFFUL << PCC_REG_RXI300_ENTRY_DELAY_RXI300_Pos)

#define PCC_REG_RXI300_RESERVED_Pos                                                              8U
#define PCC_REG_RXI300_RESERVED_Msk                                                              (0xFFFFFFUL << PCC_REG_RXI300_RESERVED_Pos)

/* 0x920    0x4000_0920
    7:0     R/W     ENTRY_DELAY_AON_DEB_TOP                         8'b0
    31:8    R/W     RESERVED                                        24'b0
 */
typedef union _PCC_REG_AON_DEB_TOP_TYPE
{
    uint32_t d32;
    struct
    {
        uint32_t ENTRY_DELAY_AON_DEB_TOP: 8;
        uint32_t RESERVED: 24;
    };
} PCC_REG_AON_DEB_TOP_TYPE;

