rtkconnectivity/hal_realtek_mainline/bee/soc/inc/rtl87x2j/pcc_reg.h
/*0x4000_0920 PCC_REG_AON_DEB_TOP*/
#define PCC_REG_AON_DEB_TOP_ENTRY_DELAY_AON_DEB_TOP_Pos                                          0U
#define PCC_REG_AON_DEB_TOP_ENTRY_DELAY_AON_DEB_TOP_Msk                                          (0xFFUL << PCC_REG_AON_DEB_TOP_ENTRY_DELAY_AON_DEB_TOP_Pos)

#define PCC_REG_AON_DEB_TOP_RESERVED_Pos                                                         8U
#define PCC_REG_AON_DEB_TOP_RESERVED_Msk                                                         (0xFFFFFFUL << PCC_REG_AON_DEB_TOP_RESERVED_Pos)

/* 0x924    0x4000_0924
    7:0     R/W     ENTRY_DELAY_CORE1_DEV_OSC128K                   8'b0
    15:8    R/W     ENTRY_DELAY_CORE1_DEV_OSC10M                    8'b0
    31:16   R/W     RESERVED                                        16'b0
 */
typedef union _PCC_REG_OTHERS_TYPE
{
    uint32_t d32;
    struct
    {
        uint32_t ENTRY_DELAY_CORE1_DEV_OSC128K: 8;
        uint32_t ENTRY_DELAY_CORE1_DEV_OSC10M: 8;
        uint32_t RESERVED: 16;
    };
} PCC_REG_OTHERS_TYPE;

/*0x4000_0924 PCC_REG_OTHERS*/
#define PCC_REG_OTHERS_ENTRY_DELAY_CORE1_DEV_OSC128K_Pos                                         0U
#define PCC_REG_OTHERS_ENTRY_DELAY_CORE1_DEV_OSC128K_Msk                                         (0xFFUL << PCC_REG_OTHERS_ENTRY_DELAY_CORE1_DEV_OSC128K_Pos)

#define PCC_REG_OTHERS_ENTRY_DELAY_CORE1_DEV_OSC10M_Pos                                          8U
#define PCC_REG_OTHERS_ENTRY_DELAY_CORE1_DEV_OSC10M_Msk                                          (0xFFUL << PCC_REG_OTHERS_ENTRY_DELAY_CORE1_DEV_OSC10M_Pos)

#define PCC_REG_OTHERS_RESERVED_Pos                                                              16U
#define PCC_REG_OTHERS_RESERVED_Msk                                                              (0xFFFFUL << PCC_REG_OTHERS_RESERVED_Pos)

/* 0x3C4    0x4000_03c4
    0       R/W     R_PON_FEN_VDREG                                 1'b0
    1       R/W     R_PON_FEN_SYSON                                 1'b1
    2       R/W     R_PON_FEN_TMETER                                1'b1
    3       R/W     R_PON_FEN_DSS                                   1'b0
    4       R/W     R_PON_FEN_CODEC                                 1'b0
    5       R/W     R_PON_FEN_UART2                                 1'b0
    6       R/W     R_PON_FEN_UART1                                 1'b0
    7       R/W     R_PON_FEN_UART0                                 1'b0
    8       R/W     R_PON_FEN_GPIO_DBNC_2P4G                        1'b0
    9       R/W     R_PON_FEN_CAN                                   1'b0
    10      R/W     R_PON_FEN_EFLASH                                1'b1
    11      R/W     R_PON_FEN_SPI3W                                 1'b0
    12      R/W     R_PON_FEN_KEYSCAN                               1'b0
    13      R/W     R_PON_FEN_I2C1                                  1'b0
    14      R/W     R_PON_FEN_I2C0                                  1'b0
    15      R/W     R_PON_FEN_ADC                                   1'b0
    16      R/W     R_PON_FEN_USB                                   1'b0
    17      R/W     R_PON_FEN_TIMER_2_PWM                           1'b0
    18      R/W     R_PON_FEN_TIMER_2                               1'b0
    19      R/W     R_PON_FEN_TIMER_1                               1'b0
    20      R/W     R_PON_FEN_TIMER_0                               1'b0
    21      R/W     R_PON_FEN_I2S                                   1'b0
    22      R/W     R_PON_FEN_SPI2                                  1'b0
    23      R/W     R_PON_FEN_SPI1                                  1'b0
    24      R/W     R_PON_FEN_SPI0                                  1'b0
    25      R/W     R_PON_FEN_FMC0                                  1'b0
    26      R/W     R_PON_FEN_DMA0                                  1'b0
    27      R/W     R_PON_FEN_MODEMRFCPI                            1'b0
    28      R/W     R_PON_FEN_SHA256                                1'b0
    29      R/W     R_PON_FEN_AES                                   1'b0
    30      R/W     R_PON_FEN_CORE_WDT                              1'b0
    31      R/W     R_PON_FEN_RNG                                   1'b0
 */
typedef union _PCC_REG_PERION_CLK_VPON_REG0X_TYPE
{
    uint32_t d32;
    struct
    {
        uint32_t R_PON_FEN_VDREG: 1;
        uint32_t R_PON_FEN_SYSON: 1;
        uint32_t R_PON_FEN_TMETER: 1;
        uint32_t R_PON_FEN_DSS: 1;
        uint32_t R_PON_FEN_CODEC: 1;
        uint32_t R_PON_FEN_UART2: 1;
        uint32_t R_PON_FEN_UART1: 1;
        uint32_t R_PON_FEN_UART0: 1;
        uint32_t R_PON_FEN_GPIO_DBNC_2P4G: 1;
        uint32_t R_PON_FEN_CAN: 1;
        uint32_t R_PON_FEN_EFLASH: 1;
        uint32_t R_PON_FEN_SPI3W: 1;
        uint32_t R_PON_FEN_KEYSCAN: 1;
        uint32_t R_PON_FEN_I2C1: 1;
        uint32_t R_PON_FEN_I2C0: 1;
        uint32_t R_PON_FEN_ADC: 1;
        uint32_t R_PON_FEN_USB: 1;
        uint32_t R_PON_FEN_TIMER_2_PWM: 1;
        uint32_t R_PON_FEN_TIMER_2: 1;
        uint32_t R_PON_FEN_TIMER_1: 1;
        uint32_t R_PON_FEN_TIMER_0: 1;
        uint32_t R_PON_FEN_I2S: 1;
        uint32_t R_PON_FEN_SPI2: 1;
        uint32_t R_PON_FEN_SPI1: 1;
        uint32_t R_PON_FEN_SPI0: 1;
        uint32_t R_PON_FEN_FMC0: 1;
        uint32_t R_PON_FEN_DMA0: 1;
        uint32_t R_PON_FEN_MODEMRFCPI: 1;
        uint32_t R_PON_FEN_SHA256: 1;
        uint32_t R_PON_FEN_AES: 1;
        uint32_t R_PON_FEN_CORE_WDT: 1;
        uint32_t R_PON_FEN_RNG: 1;
    };
} PCC_REG_PERION_CLK_VPON_REG0X_TYPE;

/*0x4000_03c4 PCC_REG_PERION_CLK_VPON_REG0X*/
#define PCC_REG_PERION_CLK_VPON_REG0X_R_PON_FEN_VDREG_Pos                                        0U
#define PCC_REG_PERION_CLK_VPON_REG0X_R_PON_FEN_VDREG_Msk                                        (0x1UL << PCC_REG_PERION_CLK_VPON_REG0X_R_PON_FEN_VDREG_Pos)

#define PCC_REG_PERION_CLK_VPON_REG0X_R_PON_FEN_SYSON_Pos                                        1U
#define PCC_REG_PERION_CLK_VPON_REG0X_R_PON_FEN_SYSON_Msk                                        (0x1UL << PCC_REG_PERION_CLK_VPON_REG0X_R_PON_FEN_SYSON_Pos)

#define PCC_REG_PERION_CLK_VPON_REG0X_R_PON_FEN_TMETER_Pos                                       2U
#define PCC_REG_PERION_CLK_VPON_REG0X_R_PON_FEN_TMETER_Msk                                       (0x1UL << PCC_REG_PERION_CLK_VPON_REG0X_R_PON_FEN_TMETER_Pos)

