rtkconnectivity/hal_realtek_mainline/bee/soc/inc/rtl87x2j/pcc_reg.h
#define PCC_REG_PERION_CLK_VPON_REG0X_R_PON_FEN_DSS_Pos                                          3U
#define PCC_REG_PERION_CLK_VPON_REG0X_R_PON_FEN_DSS_Msk                                          (0x1UL << PCC_REG_PERION_CLK_VPON_REG0X_R_PON_FEN_DSS_Pos)

#define PCC_REG_PERION_CLK_VPON_REG0X_R_PON_FEN_CODEC_Pos                                        4U
#define PCC_REG_PERION_CLK_VPON_REG0X_R_PON_FEN_CODEC_Msk                                        (0x1UL << PCC_REG_PERION_CLK_VPON_REG0X_R_PON_FEN_CODEC_Pos)

#define PCC_REG_PERION_CLK_VPON_REG0X_R_PON_FEN_UART2_Pos                                        5U
#define PCC_REG_PERION_CLK_VPON_REG0X_R_PON_FEN_UART2_Msk                                        (0x1UL << PCC_REG_PERION_CLK_VPON_REG0X_R_PON_FEN_UART2_Pos)

#define PCC_REG_PERION_CLK_VPON_REG0X_R_PON_FEN_UART1_Pos                                        6U
#define PCC_REG_PERION_CLK_VPON_REG0X_R_PON_FEN_UART1_Msk                                        (0x1UL << PCC_REG_PERION_CLK_VPON_REG0X_R_PON_FEN_UART1_Pos)

#define PCC_REG_PERION_CLK_VPON_REG0X_R_PON_FEN_UART0_Pos                                        7U
#define PCC_REG_PERION_CLK_VPON_REG0X_R_PON_FEN_UART0_Msk                                        (0x1UL << PCC_REG_PERION_CLK_VPON_REG0X_R_PON_FEN_UART0_Pos)

#define PCC_REG_PERION_CLK_VPON_REG0X_R_PON_FEN_GPIO_DBNC_2P4G_Pos                               8U
#define PCC_REG_PERION_CLK_VPON_REG0X_R_PON_FEN_GPIO_DBNC_2P4G_Msk                               (0x1UL << PCC_REG_PERION_CLK_VPON_REG0X_R_PON_FEN_GPIO_DBNC_2P4G_Pos)

#define PCC_REG_PERION_CLK_VPON_REG0X_R_PON_FEN_CAN_Pos                                          9U
#define PCC_REG_PERION_CLK_VPON_REG0X_R_PON_FEN_CAN_Msk                                          (0x1UL << PCC_REG_PERION_CLK_VPON_REG0X_R_PON_FEN_CAN_Pos)

#define PCC_REG_PERION_CLK_VPON_REG0X_R_PON_FEN_EFLASH_Pos                                       10U
#define PCC_REG_PERION_CLK_VPON_REG0X_R_PON_FEN_EFLASH_Msk                                       (0x1UL << PCC_REG_PERION_CLK_VPON_REG0X_R_PON_FEN_EFLASH_Pos)

#define PCC_REG_PERION_CLK_VPON_REG0X_R_PON_FEN_SPI3W_Pos                                        11U
#define PCC_REG_PERION_CLK_VPON_REG0X_R_PON_FEN_SPI3W_Msk                                        (0x1UL << PCC_REG_PERION_CLK_VPON_REG0X_R_PON_FEN_SPI3W_Pos)

#define PCC_REG_PERION_CLK_VPON_REG0X_R_PON_FEN_KEYSCAN_Pos                                      12U
#define PCC_REG_PERION_CLK_VPON_REG0X_R_PON_FEN_KEYSCAN_Msk                                      (0x1UL << PCC_REG_PERION_CLK_VPON_REG0X_R_PON_FEN_KEYSCAN_Pos)

#define PCC_REG_PERION_CLK_VPON_REG0X_R_PON_FEN_I2C1_Pos                                         13U
#define PCC_REG_PERION_CLK_VPON_REG0X_R_PON_FEN_I2C1_Msk                                         (0x1UL << PCC_REG_PERION_CLK_VPON_REG0X_R_PON_FEN_I2C1_Pos)

#define PCC_REG_PERION_CLK_VPON_REG0X_R_PON_FEN_I2C0_Pos                                         14U
#define PCC_REG_PERION_CLK_VPON_REG0X_R_PON_FEN_I2C0_Msk                                         (0x1UL << PCC_REG_PERION_CLK_VPON_REG0X_R_PON_FEN_I2C0_Pos)

#define PCC_REG_PERION_CLK_VPON_REG0X_R_PON_FEN_ADC_Pos                                          15U
#define PCC_REG_PERION_CLK_VPON_REG0X_R_PON_FEN_ADC_Msk                                          (0x1UL << PCC_REG_PERION_CLK_VPON_REG0X_R_PON_FEN_ADC_Pos)

#define PCC_REG_PERION_CLK_VPON_REG0X_R_PON_FEN_USB_Pos                                          16U
#define PCC_REG_PERION_CLK_VPON_REG0X_R_PON_FEN_USB_Msk                                          (0x1UL << PCC_REG_PERION_CLK_VPON_REG0X_R_PON_FEN_USB_Pos)

#define PCC_REG_PERION_CLK_VPON_REG0X_R_PON_FEN_TIMER_2_PWM_Pos                                  17U
#define PCC_REG_PERION_CLK_VPON_REG0X_R_PON_FEN_TIMER_2_PWM_Msk                                  (0x1UL << PCC_REG_PERION_CLK_VPON_REG0X_R_PON_FEN_TIMER_2_PWM_Pos)

#define PCC_REG_PERION_CLK_VPON_REG0X_R_PON_FEN_TIMER_2_Pos                                      18U
#define PCC_REG_PERION_CLK_VPON_REG0X_R_PON_FEN_TIMER_2_Msk                                      (0x1UL << PCC_REG_PERION_CLK_VPON_REG0X_R_PON_FEN_TIMER_2_Pos)

#define PCC_REG_PERION_CLK_VPON_REG0X_R_PON_FEN_TIMER_1_Pos                                      19U
#define PCC_REG_PERION_CLK_VPON_REG0X_R_PON_FEN_TIMER_1_Msk                                      (0x1UL << PCC_REG_PERION_CLK_VPON_REG0X_R_PON_FEN_TIMER_1_Pos)

#define PCC_REG_PERION_CLK_VPON_REG0X_R_PON_FEN_TIMER_0_Pos                                      20U
#define PCC_REG_PERION_CLK_VPON_REG0X_R_PON_FEN_TIMER_0_Msk                                      (0x1UL << PCC_REG_PERION_CLK_VPON_REG0X_R_PON_FEN_TIMER_0_Pos)

#define PCC_REG_PERION_CLK_VPON_REG0X_R_PON_FEN_I2S_Pos                                          21U
#define PCC_REG_PERION_CLK_VPON_REG0X_R_PON_FEN_I2S_Msk                                          (0x1UL << PCC_REG_PERION_CLK_VPON_REG0X_R_PON_FEN_I2S_Pos)

#define PCC_REG_PERION_CLK_VPON_REG0X_R_PON_FEN_SPI2_Pos                                         22U
#define PCC_REG_PERION_CLK_VPON_REG0X_R_PON_FEN_SPI2_Msk                                         (0x1UL << PCC_REG_PERION_CLK_VPON_REG0X_R_PON_FEN_SPI2_Pos)

#define PCC_REG_PERION_CLK_VPON_REG0X_R_PON_FEN_SPI1_Pos                                         23U
#define PCC_REG_PERION_CLK_VPON_REG0X_R_PON_FEN_SPI1_Msk                                         (0x1UL << PCC_REG_PERION_CLK_VPON_REG0X_R_PON_FEN_SPI1_Pos)

#define PCC_REG_PERION_CLK_VPON_REG0X_R_PON_FEN_SPI0_Pos                                         24U
#define PCC_REG_PERION_CLK_VPON_REG0X_R_PON_FEN_SPI0_Msk                                         (0x1UL << PCC_REG_PERION_CLK_VPON_REG0X_R_PON_FEN_SPI0_Pos)

#define PCC_REG_PERION_CLK_VPON_REG0X_R_PON_FEN_FMC0_Pos                                         25U
#define PCC_REG_PERION_CLK_VPON_REG0X_R_PON_FEN_FMC0_Msk                                         (0x1UL << PCC_REG_PERION_CLK_VPON_REG0X_R_PON_FEN_FMC0_Pos)

#define PCC_REG_PERION_CLK_VPON_REG0X_R_PON_FEN_DMA0_Pos                                         26U
#define PCC_REG_PERION_CLK_VPON_REG0X_R_PON_FEN_DMA0_Msk                                         (0x1UL << PCC_REG_PERION_CLK_VPON_REG0X_R_PON_FEN_DMA0_Pos)

#define PCC_REG_PERION_CLK_VPON_REG0X_R_PON_FEN_MODEMRFCPI_Pos                                   27U
#define PCC_REG_PERION_CLK_VPON_REG0X_R_PON_FEN_MODEMRFCPI_Msk                                   (0x1UL << PCC_REG_PERION_CLK_VPON_REG0X_R_PON_FEN_MODEMRFCPI_Pos)

#define PCC_REG_PERION_CLK_VPON_REG0X_R_PON_FEN_SHA256_Pos                                       28U
#define PCC_REG_PERION_CLK_VPON_REG0X_R_PON_FEN_SHA256_Msk                                       (0x1UL << PCC_REG_PERION_CLK_VPON_REG0X_R_PON_FEN_SHA256_Pos)

#define PCC_REG_PERION_CLK_VPON_REG0X_R_PON_FEN_AES_Pos                                          29U
#define PCC_REG_PERION_CLK_VPON_REG0X_R_PON_FEN_AES_Msk                                          (0x1UL << PCC_REG_PERION_CLK_VPON_REG0X_R_PON_FEN_AES_Pos)

#define PCC_REG_PERION_CLK_VPON_REG0X_R_PON_FEN_CORE_WDT_Pos                                     30U
#define PCC_REG_PERION_CLK_VPON_REG0X_R_PON_FEN_CORE_WDT_Msk                                     (0x1UL << PCC_REG_PERION_CLK_VPON_REG0X_R_PON_FEN_CORE_WDT_Pos)

#define PCC_REG_PERION_CLK_VPON_REG0X_R_PON_FEN_RNG_Pos                                          31U
#define PCC_REG_PERION_CLK_VPON_REG0X_R_PON_FEN_RNG_Msk                                          (0x1UL << PCC_REG_PERION_CLK_VPON_REG0X_R_PON_FEN_RNG_Pos)

/* 0x3C8    0x4000_03c8
    11:0    R/W     RESERVED                                        12'h0
    12      W1O     SWD_ENABLE_WR_ENABLE                            1'b0
    13      R/W     SWD_ENABLE                                      1'b1
    14      R/W     R_PON_FEN_RFC                                   1'b0
    15      R/W     R_PON_FEN_PLATFORM                              1'b1
    16      R/W     R_PON_FEN_CPU                                   1'b1
    17      R/W     R_PON_FEN_SDM32K                                1'b1
    18      R/W     R_PON_FEN_AAC                                   1'b0
    19      R/W     R_PON_FEN_CAL80M                                1'b0
    20      R/W     R_PON_FEN_CAL10M                                1'b0
    21      R/W     R_PON_FEN_CAL32K                                1'b1
    22      R/W     R_PON_FEN_TIMER1_PWM_CH8                        1'b0
    23      R/W     R_PON_FEN_TIMER1_PWM_CH7                        1'b0
    24      R/W     R_PON_FEN_TIMER1_PWM_CH6                        1'b0
    25      R/W     R_PON_FEN_HCI                                   1'b0
    26      R/W     R_PON_FEN_LXBUS                                 1'b1
    27      R/W     R_PON_FEN_BT_VEN                                1'b1
    28      R/W     R_PON_FEN_IRRC                                  1'b0
    29      R/W     R_PON_FEN_PRO24G                                1'b0
    30      R/W     R_PON_FEN_GPIO0                                 1'b0
    31      R/W     R_PON_FEN_UART3                                 1'b0
 */
typedef union _PCC_REG_PERION_CLK_VPON_REG1X_TYPE
{
    uint32_t d32;
    struct
    {
        uint32_t RESERVED: 12;
        uint32_t SWD_ENABLE_WR_ENABLE: 1;
        uint32_t SWD_ENABLE: 1;
        uint32_t R_PON_FEN_RFC: 1;
        uint32_t R_PON_FEN_PLATFORM: 1;
        uint32_t R_PON_FEN_CPU: 1;
        uint32_t R_PON_FEN_SDM32K: 1;
        uint32_t R_PON_FEN_AAC: 1;
        uint32_t R_PON_FEN_CAL80M: 1;
        uint32_t R_PON_FEN_CAL10M: 1;
        uint32_t R_PON_FEN_CAL32K: 1;
        uint32_t R_PON_FEN_TIMER1_PWM_CH8: 1;
        uint32_t R_PON_FEN_TIMER1_PWM_CH7: 1;
        uint32_t R_PON_FEN_TIMER1_PWM_CH6: 1;
        uint32_t R_PON_FEN_HCI: 1;
        uint32_t R_PON_FEN_LXBUS: 1;
        uint32_t R_PON_FEN_BT_VEN: 1;
        uint32_t R_PON_FEN_IRRC: 1;
        uint32_t R_PON_FEN_PRO24G: 1;
        uint32_t R_PON_FEN_GPIO0: 1;
        uint32_t R_PON_FEN_UART3: 1;
    };
} PCC_REG_PERION_CLK_VPON_REG1X_TYPE;

/*0x4000_03c8 PCC_REG_PERION_CLK_VPON_REG1X*/
#define PCC_REG_PERION_CLK_VPON_REG1X_RESERVED_Pos                                               0U
#define PCC_REG_PERION_CLK_VPON_REG1X_RESERVED_Msk                                               (0xFFFUL << PCC_REG_PERION_CLK_VPON_REG1X_RESERVED_Pos)

#define PCC_REG_PERION_CLK_VPON_REG1X_SWD_ENABLE_WR_ENABLE_Pos                                   12U
#define PCC_REG_PERION_CLK_VPON_REG1X_SWD_ENABLE_WR_ENABLE_Msk                                   (0x1UL << PCC_REG_PERION_CLK_VPON_REG1X_SWD_ENABLE_WR_ENABLE_Pos)

#define PCC_REG_PERION_CLK_VPON_REG1X_SWD_ENABLE_Pos                                             13U
#define PCC_REG_PERION_CLK_VPON_REG1X_SWD_ENABLE_Msk                                             (0x1UL << PCC_REG_PERION_CLK_VPON_REG1X_SWD_ENABLE_Pos)

#define PCC_REG_PERION_CLK_VPON_REG1X_R_PON_FEN_RFC_Pos                                          14U
#define PCC_REG_PERION_CLK_VPON_REG1X_R_PON_FEN_RFC_Msk                                          (0x1UL << PCC_REG_PERION_CLK_VPON_REG1X_R_PON_FEN_RFC_Pos)

#define PCC_REG_PERION_CLK_VPON_REG1X_R_PON_FEN_PLATFORM_Pos                                     15U
#define PCC_REG_PERION_CLK_VPON_REG1X_R_PON_FEN_PLATFORM_Msk                                     (0x1UL << PCC_REG_PERION_CLK_VPON_REG1X_R_PON_FEN_PLATFORM_Pos)

#define PCC_REG_PERION_CLK_VPON_REG1X_R_PON_FEN_CPU_Pos                                          16U
#define PCC_REG_PERION_CLK_VPON_REG1X_R_PON_FEN_CPU_Msk                                          (0x1UL << PCC_REG_PERION_CLK_VPON_REG1X_R_PON_FEN_CPU_Pos)

#define PCC_REG_PERION_CLK_VPON_REG1X_R_PON_FEN_SDM32K_Pos                                       17U
#define PCC_REG_PERION_CLK_VPON_REG1X_R_PON_FEN_SDM32K_Msk                                       (0x1UL << PCC_REG_PERION_CLK_VPON_REG1X_R_PON_FEN_SDM32K_Pos)

#define PCC_REG_PERION_CLK_VPON_REG1X_R_PON_FEN_AAC_Pos                                          18U
#define PCC_REG_PERION_CLK_VPON_REG1X_R_PON_FEN_AAC_Msk                                          (0x1UL << PCC_REG_PERION_CLK_VPON_REG1X_R_PON_FEN_AAC_Pos)

#define PCC_REG_PERION_CLK_VPON_REG1X_R_PON_FEN_CAL80M_Pos                                       19U
#define PCC_REG_PERION_CLK_VPON_REG1X_R_PON_FEN_CAL80M_Msk                                       (0x1UL << PCC_REG_PERION_CLK_VPON_REG1X_R_PON_FEN_CAL80M_Pos)

