rtkconnectivity/hal_realtek_mainline/bee/soc/inc/rtl87x2j/pcc_reg.h
#define PCC_REG_PERION_CLK_VPON_REG1X_R_PON_FEN_CAL10M_Pos                                       20U
#define PCC_REG_PERION_CLK_VPON_REG1X_R_PON_FEN_CAL10M_Msk                                       (0x1UL << PCC_REG_PERION_CLK_VPON_REG1X_R_PON_FEN_CAL10M_Pos)

#define PCC_REG_PERION_CLK_VPON_REG1X_R_PON_FEN_CAL32K_Pos                                       21U
#define PCC_REG_PERION_CLK_VPON_REG1X_R_PON_FEN_CAL32K_Msk                                       (0x1UL << PCC_REG_PERION_CLK_VPON_REG1X_R_PON_FEN_CAL32K_Pos)

#define PCC_REG_PERION_CLK_VPON_REG1X_R_PON_FEN_TIMER1_PWM_CH8_Pos                               22U
#define PCC_REG_PERION_CLK_VPON_REG1X_R_PON_FEN_TIMER1_PWM_CH8_Msk                               (0x1UL << PCC_REG_PERION_CLK_VPON_REG1X_R_PON_FEN_TIMER1_PWM_CH8_Pos)

#define PCC_REG_PERION_CLK_VPON_REG1X_R_PON_FEN_TIMER1_PWM_CH7_Pos                               23U
#define PCC_REG_PERION_CLK_VPON_REG1X_R_PON_FEN_TIMER1_PWM_CH7_Msk                               (0x1UL << PCC_REG_PERION_CLK_VPON_REG1X_R_PON_FEN_TIMER1_PWM_CH7_Pos)

#define PCC_REG_PERION_CLK_VPON_REG1X_R_PON_FEN_TIMER1_PWM_CH6_Pos                               24U
#define PCC_REG_PERION_CLK_VPON_REG1X_R_PON_FEN_TIMER1_PWM_CH6_Msk                               (0x1UL << PCC_REG_PERION_CLK_VPON_REG1X_R_PON_FEN_TIMER1_PWM_CH6_Pos)

#define PCC_REG_PERION_CLK_VPON_REG1X_R_PON_FEN_HCI_Pos                                          25U
#define PCC_REG_PERION_CLK_VPON_REG1X_R_PON_FEN_HCI_Msk                                          (0x1UL << PCC_REG_PERION_CLK_VPON_REG1X_R_PON_FEN_HCI_Pos)

#define PCC_REG_PERION_CLK_VPON_REG1X_R_PON_FEN_LXBUS_Pos                                        26U
#define PCC_REG_PERION_CLK_VPON_REG1X_R_PON_FEN_LXBUS_Msk                                        (0x1UL << PCC_REG_PERION_CLK_VPON_REG1X_R_PON_FEN_LXBUS_Pos)

#define PCC_REG_PERION_CLK_VPON_REG1X_R_PON_FEN_BT_VEN_Pos                                       27U
#define PCC_REG_PERION_CLK_VPON_REG1X_R_PON_FEN_BT_VEN_Msk                                       (0x1UL << PCC_REG_PERION_CLK_VPON_REG1X_R_PON_FEN_BT_VEN_Pos)

#define PCC_REG_PERION_CLK_VPON_REG1X_R_PON_FEN_IRRC_Pos                                         28U
#define PCC_REG_PERION_CLK_VPON_REG1X_R_PON_FEN_IRRC_Msk                                         (0x1UL << PCC_REG_PERION_CLK_VPON_REG1X_R_PON_FEN_IRRC_Pos)

#define PCC_REG_PERION_CLK_VPON_REG1X_R_PON_FEN_PRO24G_Pos                                       29U
#define PCC_REG_PERION_CLK_VPON_REG1X_R_PON_FEN_PRO24G_Msk                                       (0x1UL << PCC_REG_PERION_CLK_VPON_REG1X_R_PON_FEN_PRO24G_Pos)

#define PCC_REG_PERION_CLK_VPON_REG1X_R_PON_FEN_GPIO0_Pos                                        30U
#define PCC_REG_PERION_CLK_VPON_REG1X_R_PON_FEN_GPIO0_Msk                                        (0x1UL << PCC_REG_PERION_CLK_VPON_REG1X_R_PON_FEN_GPIO0_Pos)

#define PCC_REG_PERION_CLK_VPON_REG1X_R_PON_FEN_UART3_Pos                                        31U
#define PCC_REG_PERION_CLK_VPON_REG1X_R_PON_FEN_UART3_Msk                                        (0x1UL << PCC_REG_PERION_CLK_VPON_REG1X_R_PON_FEN_UART3_Pos)

/* 0x3CC    0x4000_03cc
    0       R/W     S9_INTF_MASK_EN                                 1'b0
    1       R/W     M4_INTF_MASK_EN                                 1'b0
    6:2     R/W     RESERVED_3                                      5'h0
    7       R       CLKEN_O_BTMAC                                   1'b0
    20:8    R/W     RESERVED_2                                      13'h0
    21      R/W     R_CPU_CLK_SRC_SEL_1                             1'b0
    22      R/W     R_CPU_CLK_SRC_SEL_2                             1'b1
    23      R/W     R_40M_MAC_CLK_SRC_SEL                           1'b1
    26:24   R/W     RESERVED_1                                      3'h0
    27      R/W     R_40M_CLK_SRC_SEL_0                             1'b1
    30:28   R/W     RESERVED                                        3'h0
    31      R/W     R_32K_CLK_SRC_SEL                               1'b1
 */
typedef union _PCC_REG_PERION_CLK_VPON_REG2X_TYPE
{
    uint32_t d32;
    struct
    {
        uint32_t S9_INTF_MASK_EN: 1;
        uint32_t M4_INTF_MASK_EN: 1;
        uint32_t RESERVED_3: 5;
        uint32_t CLKEN_O_BTMAC: 1;
        uint32_t RESERVED_2: 13;
        uint32_t R_CPU_CLK_SRC_SEL_1: 1;
        uint32_t R_CPU_CLK_SRC_SEL_2: 1;
        uint32_t R_40M_MAC_CLK_SRC_SEL: 1;
        uint32_t RESERVED_1: 3;
        uint32_t R_40M_CLK_SRC_SEL_0: 1;
        uint32_t RESERVED: 3;
        uint32_t R_32K_CLK_SRC_SEL: 1;
    };
} PCC_REG_PERION_CLK_VPON_REG2X_TYPE;

/*0x4000_03cc PCC_REG_PERION_CLK_VPON_REG2X*/
#define PCC_REG_PERION_CLK_VPON_REG2X_S9_INTF_MASK_EN_Pos                                        0U
#define PCC_REG_PERION_CLK_VPON_REG2X_S9_INTF_MASK_EN_Msk                                        (0x1UL << PCC_REG_PERION_CLK_VPON_REG2X_S9_INTF_MASK_EN_Pos)

#define PCC_REG_PERION_CLK_VPON_REG2X_M4_INTF_MASK_EN_Pos                                        1U
#define PCC_REG_PERION_CLK_VPON_REG2X_M4_INTF_MASK_EN_Msk                                        (0x1UL << PCC_REG_PERION_CLK_VPON_REG2X_M4_INTF_MASK_EN_Pos)

#define PCC_REG_PERION_CLK_VPON_REG2X_RESERVED_3_Pos                                             2U
#define PCC_REG_PERION_CLK_VPON_REG2X_RESERVED_3_Msk                                             (0x1FUL << PCC_REG_PERION_CLK_VPON_REG2X_RESERVED_3_Pos)

#define PCC_REG_PERION_CLK_VPON_REG2X_CLKEN_O_BTMAC_Pos                                          7U
#define PCC_REG_PERION_CLK_VPON_REG2X_CLKEN_O_BTMAC_Msk                                          (0x1UL << PCC_REG_PERION_CLK_VPON_REG2X_CLKEN_O_BTMAC_Pos)

#define PCC_REG_PERION_CLK_VPON_REG2X_RESERVED_2_Pos                                             8U
#define PCC_REG_PERION_CLK_VPON_REG2X_RESERVED_2_Msk                                             (0x1FFFUL << PCC_REG_PERION_CLK_VPON_REG2X_RESERVED_2_Pos)

#define PCC_REG_PERION_CLK_VPON_REG2X_R_CPU_CLK_SRC_SEL_1_Pos                                    21U
#define PCC_REG_PERION_CLK_VPON_REG2X_R_CPU_CLK_SRC_SEL_1_Msk                                    (0x1UL << PCC_REG_PERION_CLK_VPON_REG2X_R_CPU_CLK_SRC_SEL_1_Pos)

#define PCC_REG_PERION_CLK_VPON_REG2X_R_CPU_CLK_SRC_SEL_2_Pos                                    22U
#define PCC_REG_PERION_CLK_VPON_REG2X_R_CPU_CLK_SRC_SEL_2_Msk                                    (0x1UL << PCC_REG_PERION_CLK_VPON_REG2X_R_CPU_CLK_SRC_SEL_2_Pos)

#define PCC_REG_PERION_CLK_VPON_REG2X_R_40M_MAC_CLK_SRC_SEL_Pos                                  23U
#define PCC_REG_PERION_CLK_VPON_REG2X_R_40M_MAC_CLK_SRC_SEL_Msk                                  (0x1UL << PCC_REG_PERION_CLK_VPON_REG2X_R_40M_MAC_CLK_SRC_SEL_Pos)

