rtkconnectivity/hal_realtek_mainline/bee/soc/inc/rtl87x2j/pcc_reg.h
/* 0x3D4    0x4000_03d4
    7:0     R/W     ENTRY_DELAY_LPQDEC                              8'b0
    15:8    R/W     RSVD_2                                          8'h0
    16      R/W     RESERVED_7                                      1'b0
    17      R/W     RESERVED_6                                      1'b0
    18      R/W     LPQDEC_CLK_FORCE                                1'b0
    21:19   R/W     RSVD_1                                          3'b000
    22      R/W     RESERVED_5                                      1'b0
    23      R/W     RESERVED_4                                      1'b0
    24      R/W     RESERVED_3                                      1'b0
    25      R/W     RESERVED_2                                      1'b0
    26      R/W     RESERVED_1                                      1'b0
    27      R/W     RESERVED                                        1'b0
    30:28   R/W     RSVD                                            3'b000
    31      R/W     R_PON_FEN_LPQDEC                                1'b0
 */
typedef union _PCC_REG_LPQDEC_TYPE
{
    uint32_t d32;
    struct
    {
        uint32_t ENTRY_DELAY_LPQDEC: 8;
        uint32_t RSVD_2: 8;
        uint32_t RESERVED_7: 1;
        uint32_t RESERVED_6: 1;
        uint32_t LPQDEC_CLK_FORCE: 1;
        uint32_t RSVD_1: 3;
        uint32_t RESERVED_5: 1;
        uint32_t RESERVED_4: 1;
        uint32_t RESERVED_3: 1;
        uint32_t RESERVED_2: 1;
        uint32_t RESERVED_1: 1;
        uint32_t RESERVED: 1;
        uint32_t RSVD: 3;
        uint32_t R_PON_FEN_LPQDEC: 1;
    };
} PCC_REG_LPQDEC_TYPE;

/*0x4000_03d4 PCC_REG_LPQDEC*/
#define PCC_REG_LPQDEC_ENTRY_DELAY_LPQDEC_Pos                                                    0U
#define PCC_REG_LPQDEC_ENTRY_DELAY_LPQDEC_Msk                                                    (0xFFUL << PCC_REG_LPQDEC_ENTRY_DELAY_LPQDEC_Pos)

#define PCC_REG_LPQDEC_RSVD_2_Pos                                                                8U
#define PCC_REG_LPQDEC_RSVD_2_Msk                                                                (0xFFUL << PCC_REG_LPQDEC_RSVD_2_Pos)

#define PCC_REG_LPQDEC_RESERVED_7_Pos                                                            16U
#define PCC_REG_LPQDEC_RESERVED_7_Msk                                                            (0x1UL << PCC_REG_LPQDEC_RESERVED_7_Pos)

#define PCC_REG_LPQDEC_RESERVED_6_Pos                                                            17U
#define PCC_REG_LPQDEC_RESERVED_6_Msk                                                            (0x1UL << PCC_REG_LPQDEC_RESERVED_6_Pos)

#define PCC_REG_LPQDEC_LPQDEC_CLK_FORCE_Pos                                                      18U
#define PCC_REG_LPQDEC_LPQDEC_CLK_FORCE_Msk                                                      (0x1UL << PCC_REG_LPQDEC_LPQDEC_CLK_FORCE_Pos)

#define PCC_REG_LPQDEC_RSVD_1_Pos                                                                19U
#define PCC_REG_LPQDEC_RSVD_1_Msk                                                                (0x7UL << PCC_REG_LPQDEC_RSVD_1_Pos)

#define PCC_REG_LPQDEC_RESERVED_5_Pos                                                            22U
#define PCC_REG_LPQDEC_RESERVED_5_Msk                                                            (0x1UL << PCC_REG_LPQDEC_RESERVED_5_Pos)

#define PCC_REG_LPQDEC_RESERVED_4_Pos                                                            23U
#define PCC_REG_LPQDEC_RESERVED_4_Msk                                                            (0x1UL << PCC_REG_LPQDEC_RESERVED_4_Pos)

#define PCC_REG_LPQDEC_RESERVED_3_Pos                                                            24U
#define PCC_REG_LPQDEC_RESERVED_3_Msk                                                            (0x1UL << PCC_REG_LPQDEC_RESERVED_3_Pos)

#define PCC_REG_LPQDEC_RESERVED_2_Pos                                                            25U
#define PCC_REG_LPQDEC_RESERVED_2_Msk                                                            (0x1UL << PCC_REG_LPQDEC_RESERVED_2_Pos)

#define PCC_REG_LPQDEC_RESERVED_1_Pos                                                            26U
#define PCC_REG_LPQDEC_RESERVED_1_Msk                                                            (0x1UL << PCC_REG_LPQDEC_RESERVED_1_Pos)

#define PCC_REG_LPQDEC_RESERVED_Pos                                                              27U
#define PCC_REG_LPQDEC_RESERVED_Msk                                                              (0x1UL << PCC_REG_LPQDEC_RESERVED_Pos)

#define PCC_REG_LPQDEC_RSVD_Pos                                                                  28U
#define PCC_REG_LPQDEC_RSVD_Msk                                                                  (0x7UL << PCC_REG_LPQDEC_RSVD_Pos)

#define PCC_REG_LPQDEC_R_PON_FEN_LPQDEC_Pos                                                      31U
#define PCC_REG_LPQDEC_R_PON_FEN_LPQDEC_Msk                                                      (0x1UL << PCC_REG_LPQDEC_R_PON_FEN_LPQDEC_Pos)

/* 0x3D8    0x4000_03d8
    7:0     R/W     ENTRY_DELAY_GRTC                                8'b0
    15:8    R/W     RSVD_2                                          8'h0
    16      R/W     RESERVED_7                                      1'b0
    17      R/W     RESERVED_6                                      1'b0
    18      R/W     GRTC_CLK_FORCE                                  1'b0
    21:19   R/W     RSVD_1                                          3'b000
    22      R/W     RESERVED_5                                      1'b0
    23      R/W     RESERVED_4                                      1'b0
    24      R/W     RESERVED_3                                      1'b0
    25      R/W     RESERVED_2                                      1'b0
    26      R/W     RESERVED_1                                      1'b0
    27      R/W     RESERVED                                        1'b0
    30:28   R/W     RSVD                                            3'b000
    31      R/W     R_PON_FEN_GRTC                                  1'b0
 */
typedef union _PCC_REG_GRTC_TYPE
{
    uint32_t d32;
    struct
    {
        uint32_t ENTRY_DELAY_GRTC: 8;
        uint32_t RSVD_2: 8;
        uint32_t RESERVED_7: 1;
        uint32_t RESERVED_6: 1;
        uint32_t GRTC_CLK_FORCE: 1;
        uint32_t RSVD_1: 3;
        uint32_t RESERVED_5: 1;
        uint32_t RESERVED_4: 1;
        uint32_t RESERVED_3: 1;
        uint32_t RESERVED_2: 1;
        uint32_t RESERVED_1: 1;
        uint32_t RESERVED: 1;
        uint32_t RSVD: 3;
        uint32_t R_PON_FEN_GRTC: 1;
    };
} PCC_REG_GRTC_TYPE;

/*0x4000_03d8 PCC_REG_GRTC*/
#define PCC_REG_GRTC_ENTRY_DELAY_GRTC_Pos                                                        0U
#define PCC_REG_GRTC_ENTRY_DELAY_GRTC_Msk                                                        (0xFFUL << PCC_REG_GRTC_ENTRY_DELAY_GRTC_Pos)

#define PCC_REG_GRTC_RSVD_2_Pos                                                                  8U
#define PCC_REG_GRTC_RSVD_2_Msk                                                                  (0xFFUL << PCC_REG_GRTC_RSVD_2_Pos)

#define PCC_REG_GRTC_RESERVED_7_Pos                                                              16U
#define PCC_REG_GRTC_RESERVED_7_Msk                                                              (0x1UL << PCC_REG_GRTC_RESERVED_7_Pos)

#define PCC_REG_GRTC_RESERVED_6_Pos                                                              17U
#define PCC_REG_GRTC_RESERVED_6_Msk                                                              (0x1UL << PCC_REG_GRTC_RESERVED_6_Pos)

#define PCC_REG_GRTC_GRTC_CLK_FORCE_Pos                                                          18U
#define PCC_REG_GRTC_GRTC_CLK_FORCE_Msk                                                          (0x1UL << PCC_REG_GRTC_GRTC_CLK_FORCE_Pos)

#define PCC_REG_GRTC_RSVD_1_Pos                                                                  19U
#define PCC_REG_GRTC_RSVD_1_Msk                                                                  (0x7UL << PCC_REG_GRTC_RSVD_1_Pos)

#define PCC_REG_GRTC_RESERVED_5_Pos                                                              22U
#define PCC_REG_GRTC_RESERVED_5_Msk                                                              (0x1UL << PCC_REG_GRTC_RESERVED_5_Pos)

