rtkconnectivity/hal_realtek_mainline/bee/soc/inc/rtl87x2j/pcc_reg.h
#define PCC_REG_GRTC_RESERVED_4_Pos                                                              23U
#define PCC_REG_GRTC_RESERVED_4_Msk                                                              (0x1UL << PCC_REG_GRTC_RESERVED_4_Pos)

#define PCC_REG_GRTC_RESERVED_3_Pos                                                              24U
#define PCC_REG_GRTC_RESERVED_3_Msk                                                              (0x1UL << PCC_REG_GRTC_RESERVED_3_Pos)

#define PCC_REG_GRTC_RESERVED_2_Pos                                                              25U
#define PCC_REG_GRTC_RESERVED_2_Msk                                                              (0x1UL << PCC_REG_GRTC_RESERVED_2_Pos)

#define PCC_REG_GRTC_RESERVED_1_Pos                                                              26U
#define PCC_REG_GRTC_RESERVED_1_Msk                                                              (0x1UL << PCC_REG_GRTC_RESERVED_1_Pos)

#define PCC_REG_GRTC_RESERVED_Pos                                                                27U
#define PCC_REG_GRTC_RESERVED_Msk                                                                (0x1UL << PCC_REG_GRTC_RESERVED_Pos)

#define PCC_REG_GRTC_RSVD_Pos                                                                    28U
#define PCC_REG_GRTC_RSVD_Msk                                                                    (0x7UL << PCC_REG_GRTC_RSVD_Pos)

#define PCC_REG_GRTC_R_PON_FEN_GRTC_Pos                                                          31U
#define PCC_REG_GRTC_R_PON_FEN_GRTC_Msk                                                          (0x1UL << PCC_REG_GRTC_R_PON_FEN_GRTC_Pos)

/* 0x3DC    0x4000_03dc
    0       R/W     RESERVED_13                                     1'b0
    1       R/W     RESERVED_12                                     1'b0
    2       R/W     RESERVED_11                                     1'b0
    3       R/W     RESERVED_10                                     1'b0
    4       R/W     RESERVED_9                                      1'b0
    5       R/W     RESERVED_8                                      1'b0
    15:6    R/W     RSVD_2                                          10'h0
    16      R/W     RESERVED_7                                      1'b0
    17      R/W     RESERVED_6                                      1'b0
    18      R/W     BLUEWIZ_CLK_FORCE                               1'b0
    21:19   R/W     RSVD_1                                          3'b000
    22      R/W     RESERVED_5                                      1'b0
    23      R/W     RESERVED_4                                      1'b0
    24      R/W     RESERVED_3                                      1'b0
    25      R/W     RESERVED_2                                      1'b0
    26      R/W     RESERVED_1                                      1'b0
    27      R/W     RESERVED                                        1'b0
    30:28   R/W     RSVD                                            3'b000
    31      R/W     R_PON_FEN_BLUEWIZ                               1'b0
 */
typedef union _PCC_REG_BLUEWIZ_TYPE
{
    uint32_t d32;
    struct
    {
        uint32_t RESERVED_13: 1;
        uint32_t RESERVED_12: 1;
        uint32_t RESERVED_11: 1;
        uint32_t RESERVED_10: 1;
        uint32_t RESERVED_9: 1;
        uint32_t RESERVED_8: 1;
        uint32_t RSVD_2: 10;
        uint32_t RESERVED_7: 1;
        uint32_t RESERVED_6: 1;
        uint32_t BLUEWIZ_CLK_FORCE: 1;
        uint32_t RSVD_1: 3;
        uint32_t RESERVED_5: 1;
        uint32_t RESERVED_4: 1;
        uint32_t RESERVED_3: 1;
        uint32_t RESERVED_2: 1;
        uint32_t RESERVED_1: 1;
        uint32_t RESERVED: 1;
        uint32_t RSVD: 3;
        uint32_t R_PON_FEN_BLUEWIZ: 1;
    };
} PCC_REG_BLUEWIZ_TYPE;

/*0x4000_03dc PCC_REG_BLUEWIZ*/
#define PCC_REG_BLUEWIZ_RESERVED_13_Pos                                                          0U
#define PCC_REG_BLUEWIZ_RESERVED_13_Msk                                                          (0x1UL << PCC_REG_BLUEWIZ_RESERVED_13_Pos)

#define PCC_REG_BLUEWIZ_RESERVED_12_Pos                                                          1U
#define PCC_REG_BLUEWIZ_RESERVED_12_Msk                                                          (0x1UL << PCC_REG_BLUEWIZ_RESERVED_12_Pos)

#define PCC_REG_BLUEWIZ_RESERVED_11_Pos                                                          2U
#define PCC_REG_BLUEWIZ_RESERVED_11_Msk                                                          (0x1UL << PCC_REG_BLUEWIZ_RESERVED_11_Pos)

#define PCC_REG_BLUEWIZ_RESERVED_10_Pos                                                          3U
#define PCC_REG_BLUEWIZ_RESERVED_10_Msk                                                          (0x1UL << PCC_REG_BLUEWIZ_RESERVED_10_Pos)

#define PCC_REG_BLUEWIZ_RESERVED_9_Pos                                                           4U
#define PCC_REG_BLUEWIZ_RESERVED_9_Msk                                                           (0x1UL << PCC_REG_BLUEWIZ_RESERVED_9_Pos)

#define PCC_REG_BLUEWIZ_RESERVED_8_Pos                                                           5U
#define PCC_REG_BLUEWIZ_RESERVED_8_Msk                                                           (0x1UL << PCC_REG_BLUEWIZ_RESERVED_8_Pos)

#define PCC_REG_BLUEWIZ_RSVD_2_Pos                                                               6U
#define PCC_REG_BLUEWIZ_RSVD_2_Msk                                                               (0x3FFUL << PCC_REG_BLUEWIZ_RSVD_2_Pos)

#define PCC_REG_BLUEWIZ_RESERVED_7_Pos                                                           16U
#define PCC_REG_BLUEWIZ_RESERVED_7_Msk                                                           (0x1UL << PCC_REG_BLUEWIZ_RESERVED_7_Pos)

#define PCC_REG_BLUEWIZ_RESERVED_6_Pos                                                           17U
#define PCC_REG_BLUEWIZ_RESERVED_6_Msk                                                           (0x1UL << PCC_REG_BLUEWIZ_RESERVED_6_Pos)

#define PCC_REG_BLUEWIZ_BLUEWIZ_CLK_FORCE_Pos                                                    18U
#define PCC_REG_BLUEWIZ_BLUEWIZ_CLK_FORCE_Msk                                                    (0x1UL << PCC_REG_BLUEWIZ_BLUEWIZ_CLK_FORCE_Pos)

#define PCC_REG_BLUEWIZ_RSVD_1_Pos                                                               19U
#define PCC_REG_BLUEWIZ_RSVD_1_Msk                                                               (0x7UL << PCC_REG_BLUEWIZ_RSVD_1_Pos)

