rtkconnectivity/hal_realtek_mainline/bee/soc/inc/rtl87x2j/pcc_reg.h
#define PCC_REG_BLUEWIZ_RESERVED_5_Pos                                                           22U
#define PCC_REG_BLUEWIZ_RESERVED_5_Msk                                                           (0x1UL << PCC_REG_BLUEWIZ_RESERVED_5_Pos)

#define PCC_REG_BLUEWIZ_RESERVED_4_Pos                                                           23U
#define PCC_REG_BLUEWIZ_RESERVED_4_Msk                                                           (0x1UL << PCC_REG_BLUEWIZ_RESERVED_4_Pos)

#define PCC_REG_BLUEWIZ_RESERVED_3_Pos                                                           24U
#define PCC_REG_BLUEWIZ_RESERVED_3_Msk                                                           (0x1UL << PCC_REG_BLUEWIZ_RESERVED_3_Pos)

#define PCC_REG_BLUEWIZ_RESERVED_2_Pos                                                           25U
#define PCC_REG_BLUEWIZ_RESERVED_2_Msk                                                           (0x1UL << PCC_REG_BLUEWIZ_RESERVED_2_Pos)

#define PCC_REG_BLUEWIZ_RESERVED_1_Pos                                                           26U
#define PCC_REG_BLUEWIZ_RESERVED_1_Msk                                                           (0x1UL << PCC_REG_BLUEWIZ_RESERVED_1_Pos)

#define PCC_REG_BLUEWIZ_RESERVED_Pos                                                             27U
#define PCC_REG_BLUEWIZ_RESERVED_Msk                                                             (0x1UL << PCC_REG_BLUEWIZ_RESERVED_Pos)

#define PCC_REG_BLUEWIZ_RSVD_Pos                                                                 28U
#define PCC_REG_BLUEWIZ_RSVD_Msk                                                                 (0x7UL << PCC_REG_BLUEWIZ_RSVD_Pos)

#define PCC_REG_BLUEWIZ_R_PON_FEN_BLUEWIZ_Pos                                                    31U
#define PCC_REG_BLUEWIZ_R_PON_FEN_BLUEWIZ_Msk                                                    (0x1UL << PCC_REG_BLUEWIZ_R_PON_FEN_BLUEWIZ_Pos)

/* 0x3E0    0x4000_03e0
    7:0     R/W     ENTRY_DELAY_USER_RTC                            8'b0
    15:8    R/W     RSVD_3                                          8'h0
    16      R/W     RESERVED_3                                      1'b0
    17      R/W     RESERVED_2                                      1'b0
    18      R/W     USER_RTC_CLK_FORCE                              1'b0
    21:19   R/W     RSVD_2                                          3'b000
    22      R/W     MULTI_DATA_CMP_OUT                              1'b0
    24:23   R/W     RSVD_1                                          2'b00
    25      R/W     R_RTC_GPIO_CLK_SRC_SEL                          1'b0
    26      R/W     RESERVED_1                                      1'b0
    27      R/W     RESERVED                                        1'b0
    30:28   R/W     RSVD                                            3'b000
    31      R/W     R_PON_FEN_USER_RTC                              1'b0
 */
typedef union _PCC_REG_USER_RTC_TYPE
{
    uint32_t d32;
    struct
    {
        uint32_t ENTRY_DELAY_USER_RTC: 8;
        uint32_t RSVD_3: 8;
        uint32_t RESERVED_3: 1;
        uint32_t RESERVED_2: 1;
        uint32_t USER_RTC_CLK_FORCE: 1;
        uint32_t RSVD_2: 3;
        uint32_t MULTI_DATA_CMP_OUT: 1;
        uint32_t RSVD_1: 2;
        uint32_t R_RTC_GPIO_CLK_SRC_SEL: 1;
        uint32_t RESERVED_1: 1;
        uint32_t RESERVED: 1;
        uint32_t RSVD: 3;
        uint32_t R_PON_FEN_USER_RTC: 1;
    };
} PCC_REG_USER_RTC_TYPE;

/*0x4000_03e0 PCC_REG_USER_RTC*/
#define PCC_REG_USER_RTC_ENTRY_DELAY_USER_RTC_Pos                                                0U
#define PCC_REG_USER_RTC_ENTRY_DELAY_USER_RTC_Msk                                                (0xFFUL << PCC_REG_USER_RTC_ENTRY_DELAY_USER_RTC_Pos)

#define PCC_REG_USER_RTC_RSVD_3_Pos                                                              8U
#define PCC_REG_USER_RTC_RSVD_3_Msk                                                              (0xFFUL << PCC_REG_USER_RTC_RSVD_3_Pos)

#define PCC_REG_USER_RTC_RESERVED_3_Pos                                                          16U
#define PCC_REG_USER_RTC_RESERVED_3_Msk                                                          (0x1UL << PCC_REG_USER_RTC_RESERVED_3_Pos)

#define PCC_REG_USER_RTC_RESERVED_2_Pos                                                          17U
#define PCC_REG_USER_RTC_RESERVED_2_Msk                                                          (0x1UL << PCC_REG_USER_RTC_RESERVED_2_Pos)

#define PCC_REG_USER_RTC_USER_RTC_CLK_FORCE_Pos                                                  18U
#define PCC_REG_USER_RTC_USER_RTC_CLK_FORCE_Msk                                                  (0x1UL << PCC_REG_USER_RTC_USER_RTC_CLK_FORCE_Pos)

#define PCC_REG_USER_RTC_RSVD_2_Pos                                                              19U
#define PCC_REG_USER_RTC_RSVD_2_Msk                                                              (0x7UL << PCC_REG_USER_RTC_RSVD_2_Pos)

#define PCC_REG_USER_RTC_MULTI_DATA_CMP_OUT_Pos                                                  22U
#define PCC_REG_USER_RTC_MULTI_DATA_CMP_OUT_Msk                                                  (0x1UL << PCC_REG_USER_RTC_MULTI_DATA_CMP_OUT_Pos)

#define PCC_REG_USER_RTC_RSVD_1_Pos                                                              23U
#define PCC_REG_USER_RTC_RSVD_1_Msk                                                              (0x3UL << PCC_REG_USER_RTC_RSVD_1_Pos)

#define PCC_REG_USER_RTC_R_RTC_GPIO_CLK_SRC_SEL_Pos                                              25U
#define PCC_REG_USER_RTC_R_RTC_GPIO_CLK_SRC_SEL_Msk                                              (0x1UL << PCC_REG_USER_RTC_R_RTC_GPIO_CLK_SRC_SEL_Pos)

#define PCC_REG_USER_RTC_RESERVED_1_Pos                                                          26U
#define PCC_REG_USER_RTC_RESERVED_1_Msk                                                          (0x1UL << PCC_REG_USER_RTC_RESERVED_1_Pos)

#define PCC_REG_USER_RTC_RESERVED_Pos                                                            27U
#define PCC_REG_USER_RTC_RESERVED_Msk                                                            (0x1UL << PCC_REG_USER_RTC_RESERVED_Pos)

#define PCC_REG_USER_RTC_RSVD_Pos                                                                28U
#define PCC_REG_USER_RTC_RSVD_Msk                                                                (0x7UL << PCC_REG_USER_RTC_RSVD_Pos)

#define PCC_REG_USER_RTC_R_PON_FEN_USER_RTC_Pos                                                  31U
#define PCC_REG_USER_RTC_R_PON_FEN_USER_RTC_Msk                                                  (0x1UL << PCC_REG_USER_RTC_R_PON_FEN_USER_RTC_Pos)

/* 0x3E4    0x4000_03e4
    7:0     R/W     ENTRY_DELAY_RAP                                 8'b0
    15:8    R/W     RSVD_2                                          8'h0
    16      R/W     RESERVED_7                                      1'b0
    17      R/W     RESERVED_6                                      1'b0
    18      R/W     RAP_CLK_FORCE                                   1'b0
    21:19   R/W     RSVD_1                                          3'b000
    22      R/W     RESERVED_5                                      1'b0
    23      R/W     RESERVED_4                                      1'b0
    24      R/W     RESERVED_3                                      1'b0
    25      R/W     RESERVED_2                                      1'b0
    26      R/W     RESERVED_1                                      1'b0
    27      R/W     RESERVED                                        1'b0
    30:28   R/W     RSVD                                            3'b000
    31      R/W     R_PON_FEN_RAP                                   1'b0
 */
typedef union _PCC_REG_RAP_TYPE
{
    uint32_t d32;
    struct
    {
        uint32_t ENTRY_DELAY_RAP: 8;
        uint32_t RSVD_2: 8;
        uint32_t RESERVED_7: 1;
        uint32_t RESERVED_6: 1;
        uint32_t RAP_CLK_FORCE: 1;
        uint32_t RSVD_1: 3;
        uint32_t RESERVED_5: 1;
        uint32_t RESERVED_4: 1;
        uint32_t RESERVED_3: 1;
        uint32_t RESERVED_2: 1;
        uint32_t RESERVED_1: 1;
        uint32_t RESERVED: 1;
        uint32_t RSVD: 3;
        uint32_t R_PON_FEN_RAP: 1;
    };
} PCC_REG_RAP_TYPE;

/*0x4000_03e4 PCC_REG_RAP*/
#define PCC_REG_RAP_ENTRY_DELAY_RAP_Pos                                                          0U
#define PCC_REG_RAP_ENTRY_DELAY_RAP_Msk                                                          (0xFFUL << PCC_REG_RAP_ENTRY_DELAY_RAP_Pos)

#define PCC_REG_RAP_RSVD_2_Pos                                                                   8U
#define PCC_REG_RAP_RSVD_2_Msk                                                                   (0xFFUL << PCC_REG_RAP_RSVD_2_Pos)

