rtkconnectivity/hal_realtek_mainline/bee/soc/inc/rtl87x2j/pcc_reg.h
#define PCC_REG_GTC_RESERVED_3_Pos                                                               23U
#define PCC_REG_GTC_RESERVED_3_Msk                                                               (0x1UL << PCC_REG_GTC_RESERVED_3_Pos)

#define PCC_REG_GTC_RESERVED_2_Pos                                                               24U
#define PCC_REG_GTC_RESERVED_2_Msk                                                               (0x1UL << PCC_REG_GTC_RESERVED_2_Pos)

#define PCC_REG_GTC_RESERVED_1_Pos                                                               25U
#define PCC_REG_GTC_RESERVED_1_Msk                                                               (0x1UL << PCC_REG_GTC_RESERVED_1_Pos)

#define PCC_REG_GTC_RESERVED_Pos                                                                 26U
#define PCC_REG_GTC_RESERVED_Msk                                                                 (0x1UL << PCC_REG_GTC_RESERVED_Pos)

#define PCC_REG_GTC_R_PON_FEN_SCHPLN_Pos                                                         27U
#define PCC_REG_GTC_R_PON_FEN_SCHPLN_Msk                                                         (0x1UL << PCC_REG_GTC_R_PON_FEN_SCHPLN_Pos)

#define PCC_REG_GTC_RSVD_Pos                                                                     28U
#define PCC_REG_GTC_RSVD_Msk                                                                     (0x7UL << PCC_REG_GTC_RSVD_Pos)

#define PCC_REG_GTC_R_PON_FEN_GTC_Pos                                                            31U
#define PCC_REG_GTC_R_PON_FEN_GTC_Msk                                                            (0x1UL << PCC_REG_GTC_R_PON_FEN_GTC_Pos)

/* 0x3EC    0x4000_03ec
    7:0     R/W     ENTRY_DELAY_CAL32K                              8'b0
    15:8    R/W     RSVD_2                                          8'h0
    16      R/W     RESERVED_7                                      1'b0
    17      R/W     RESERVED_6                                      1'b0
    18      R/W     SDM_CLK_FORCE                                   1'b0
    21:19   R/W     RSVD_1                                          3'b000
    22      R/W     RESERVED_5                                      1'b0
    23      R/W     RESERVED_4                                      1'b0
    24      R/W     RESERVED_3                                      1'b0
    25      R/W     RESERVED_2                                      1'b0
    26      R/W     RESERVED_1                                      1'b0
    27      R/W     RESERVED                                        1'b0
    30:28   R/W     RSVD                                            3'b000
    31      R/W     R_PON_FEN_CAL32K_VPON                           1'b0
 */
typedef union _PCC_REG_SDM_VPON_TYPE
{
    uint32_t d32;
    struct
    {
        uint32_t ENTRY_DELAY_CAL32K: 8;
        uint32_t RSVD_2: 8;
        uint32_t RESERVED_7: 1;
        uint32_t RESERVED_6: 1;
        uint32_t SDM_CLK_FORCE: 1;
        uint32_t RSVD_1: 3;
        uint32_t RESERVED_5: 1;
        uint32_t RESERVED_4: 1;
        uint32_t RESERVED_3: 1;
        uint32_t RESERVED_2: 1;
        uint32_t RESERVED_1: 1;
        uint32_t RESERVED: 1;
        uint32_t RSVD: 3;
        uint32_t R_PON_FEN_CAL32K_VPON: 1;
    };
} PCC_REG_SDM_VPON_TYPE;

/*0x4000_03ec PCC_REG_SDM_VPON*/
#define PCC_REG_SDM_VPON_ENTRY_DELAY_CAL32K_Pos                                                  0U
#define PCC_REG_SDM_VPON_ENTRY_DELAY_CAL32K_Msk                                                  (0xFFUL << PCC_REG_SDM_VPON_ENTRY_DELAY_CAL32K_Pos)

#define PCC_REG_SDM_VPON_RSVD_2_Pos                                                              8U
#define PCC_REG_SDM_VPON_RSVD_2_Msk                                                              (0xFFUL << PCC_REG_SDM_VPON_RSVD_2_Pos)

#define PCC_REG_SDM_VPON_RESERVED_7_Pos                                                          16U
#define PCC_REG_SDM_VPON_RESERVED_7_Msk                                                          (0x1UL << PCC_REG_SDM_VPON_RESERVED_7_Pos)

#define PCC_REG_SDM_VPON_RESERVED_6_Pos                                                          17U
#define PCC_REG_SDM_VPON_RESERVED_6_Msk                                                          (0x1UL << PCC_REG_SDM_VPON_RESERVED_6_Pos)

#define PCC_REG_SDM_VPON_SDM_CLK_FORCE_Pos                                                       18U
#define PCC_REG_SDM_VPON_SDM_CLK_FORCE_Msk                                                       (0x1UL << PCC_REG_SDM_VPON_SDM_CLK_FORCE_Pos)

#define PCC_REG_SDM_VPON_RSVD_1_Pos                                                              19U
#define PCC_REG_SDM_VPON_RSVD_1_Msk                                                              (0x7UL << PCC_REG_SDM_VPON_RSVD_1_Pos)

#define PCC_REG_SDM_VPON_RESERVED_5_Pos                                                          22U
#define PCC_REG_SDM_VPON_RESERVED_5_Msk                                                          (0x1UL << PCC_REG_SDM_VPON_RESERVED_5_Pos)

#define PCC_REG_SDM_VPON_RESERVED_4_Pos                                                          23U
#define PCC_REG_SDM_VPON_RESERVED_4_Msk                                                          (0x1UL << PCC_REG_SDM_VPON_RESERVED_4_Pos)

#define PCC_REG_SDM_VPON_RESERVED_3_Pos                                                          24U
#define PCC_REG_SDM_VPON_RESERVED_3_Msk                                                          (0x1UL << PCC_REG_SDM_VPON_RESERVED_3_Pos)

#define PCC_REG_SDM_VPON_RESERVED_2_Pos                                                          25U
#define PCC_REG_SDM_VPON_RESERVED_2_Msk                                                          (0x1UL << PCC_REG_SDM_VPON_RESERVED_2_Pos)

#define PCC_REG_SDM_VPON_RESERVED_1_Pos                                                          26U
#define PCC_REG_SDM_VPON_RESERVED_1_Msk                                                          (0x1UL << PCC_REG_SDM_VPON_RESERVED_1_Pos)

#define PCC_REG_SDM_VPON_RESERVED_Pos                                                            27U
#define PCC_REG_SDM_VPON_RESERVED_Msk                                                            (0x1UL << PCC_REG_SDM_VPON_RESERVED_Pos)

