rtkconnectivity/hal_realtek_mainline/bee/soc/inc/rtl87x2j/pcc_reg.h
#define PCC_REG_SDM_VPON_RSVD_Pos                                                                28U
#define PCC_REG_SDM_VPON_RSVD_Msk                                                                (0x7UL << PCC_REG_SDM_VPON_RSVD_Pos)

#define PCC_REG_SDM_VPON_R_PON_FEN_CAL32K_VPON_Pos                                               31U
#define PCC_REG_SDM_VPON_R_PON_FEN_CAL32K_VPON_Msk                                               (0x1UL << PCC_REG_SDM_VPON_R_PON_FEN_CAL32K_VPON_Pos)

/* 0x3F0    0x4000_03f0
    7:0     R/W     ENTRY_DELAY_WDT                                 8'b0
    15:8    R/W     RSVD_2                                          8'h0
    16      R/W     RESERVED_7                                      1'b0
    17      R/W     RESERVED_6                                      1'b1
    18      R/W     WDT_CLK_FORCE                                   1'b0
    21:19   R/W     RSVD_1                                          3'b000
    22      R/W     RESERVED_5                                      1'b0
    23      R/W     RESERVED_4                                      1'b0
    24      R/W     RESERVED_3                                      1'b0
    25      R/W     RESERVED_2                                      1'b0
    26      R/W     RESERVED_1                                      1'b0
    27      R/W     RESERVED                                        1'b0
    30:28   R/W     RSVD                                            3'b000
    31      R/W     R_PON_FEN_WDT                                   1'b0
 */
typedef union _PCC_REG_LPWDT_VPON_TYPE
{
    uint32_t d32;
    struct
    {
        uint32_t ENTRY_DELAY_WDT: 8;
        uint32_t RSVD_2: 8;
        uint32_t RESERVED_7: 1;
        uint32_t RESERVED_6: 1;
        uint32_t WDT_CLK_FORCE: 1;
        uint32_t RSVD_1: 3;
        uint32_t RESERVED_5: 1;
        uint32_t RESERVED_4: 1;
        uint32_t RESERVED_3: 1;
        uint32_t RESERVED_2: 1;
        uint32_t RESERVED_1: 1;
        uint32_t RESERVED: 1;
        uint32_t RSVD: 3;
        uint32_t R_PON_FEN_WDT: 1;
    };
} PCC_REG_LPWDT_VPON_TYPE;

/*0x4000_03f0 PCC_REG_LPWDT_VPON*/
#define PCC_REG_LPWDT_VPON_ENTRY_DELAY_WDT_Pos                                                   0U
#define PCC_REG_LPWDT_VPON_ENTRY_DELAY_WDT_Msk                                                   (0xFFUL << PCC_REG_LPWDT_VPON_ENTRY_DELAY_WDT_Pos)

#define PCC_REG_LPWDT_VPON_RSVD_2_Pos                                                            8U
#define PCC_REG_LPWDT_VPON_RSVD_2_Msk                                                            (0xFFUL << PCC_REG_LPWDT_VPON_RSVD_2_Pos)

#define PCC_REG_LPWDT_VPON_RESERVED_7_Pos                                                        16U
#define PCC_REG_LPWDT_VPON_RESERVED_7_Msk                                                        (0x1UL << PCC_REG_LPWDT_VPON_RESERVED_7_Pos)

#define PCC_REG_LPWDT_VPON_RESERVED_6_Pos                                                        17U
#define PCC_REG_LPWDT_VPON_RESERVED_6_Msk                                                        (0x1UL << PCC_REG_LPWDT_VPON_RESERVED_6_Pos)

#define PCC_REG_LPWDT_VPON_WDT_CLK_FORCE_Pos                                                     18U
#define PCC_REG_LPWDT_VPON_WDT_CLK_FORCE_Msk                                                     (0x1UL << PCC_REG_LPWDT_VPON_WDT_CLK_FORCE_Pos)

#define PCC_REG_LPWDT_VPON_RSVD_1_Pos                                                            19U
#define PCC_REG_LPWDT_VPON_RSVD_1_Msk                                                            (0x7UL << PCC_REG_LPWDT_VPON_RSVD_1_Pos)

#define PCC_REG_LPWDT_VPON_RESERVED_5_Pos                                                        22U
#define PCC_REG_LPWDT_VPON_RESERVED_5_Msk                                                        (0x1UL << PCC_REG_LPWDT_VPON_RESERVED_5_Pos)

#define PCC_REG_LPWDT_VPON_RESERVED_4_Pos                                                        23U
#define PCC_REG_LPWDT_VPON_RESERVED_4_Msk                                                        (0x1UL << PCC_REG_LPWDT_VPON_RESERVED_4_Pos)

#define PCC_REG_LPWDT_VPON_RESERVED_3_Pos                                                        24U
#define PCC_REG_LPWDT_VPON_RESERVED_3_Msk                                                        (0x1UL << PCC_REG_LPWDT_VPON_RESERVED_3_Pos)

#define PCC_REG_LPWDT_VPON_RESERVED_2_Pos                                                        25U
#define PCC_REG_LPWDT_VPON_RESERVED_2_Msk                                                        (0x1UL << PCC_REG_LPWDT_VPON_RESERVED_2_Pos)

#define PCC_REG_LPWDT_VPON_RESERVED_1_Pos                                                        26U
#define PCC_REG_LPWDT_VPON_RESERVED_1_Msk                                                        (0x1UL << PCC_REG_LPWDT_VPON_RESERVED_1_Pos)

#define PCC_REG_LPWDT_VPON_RESERVED_Pos                                                          27U
#define PCC_REG_LPWDT_VPON_RESERVED_Msk                                                          (0x1UL << PCC_REG_LPWDT_VPON_RESERVED_Pos)

#define PCC_REG_LPWDT_VPON_RSVD_Pos                                                              28U
#define PCC_REG_LPWDT_VPON_RSVD_Msk                                                              (0x7UL << PCC_REG_LPWDT_VPON_RSVD_Pos)

#define PCC_REG_LPWDT_VPON_R_PON_FEN_WDT_Pos                                                     31U
#define PCC_REG_LPWDT_VPON_R_PON_FEN_WDT_Msk                                                     (0x1UL << PCC_REG_LPWDT_VPON_R_PON_FEN_WDT_Pos)

/* 0x3F4    0x4000_03f4
    28:0    R/W     RESERVED                                        29'h0
    31:29   R/W     AON_HF_DIV_SEL                                  3'b000
 */
typedef union _PCC_REG_PERION_CLK_AON_REG0X_TYPE
{
    uint32_t d32;
    struct
    {
        uint32_t RESERVED: 29;
        uint32_t AON_HF_DIV_SEL: 3;
    };
} PCC_REG_PERION_CLK_AON_REG0X_TYPE;

/*0x4000_03f4 PCC_REG_PERION_CLK_AON_REG0X*/
#define PCC_REG_PERION_CLK_AON_REG0X_RESERVED_Pos                                                0U
#define PCC_REG_PERION_CLK_AON_REG0X_RESERVED_Msk                                                (0x1FFFFFFFUL << PCC_REG_PERION_CLK_AON_REG0X_RESERVED_Pos)

#define PCC_REG_PERION_CLK_AON_REG0X_AON_HF_DIV_SEL_Pos                                          29U
#define PCC_REG_PERION_CLK_AON_REG0X_AON_HF_DIV_SEL_Msk                                          (0x7UL << PCC_REG_PERION_CLK_AON_REG0X_AON_HF_DIV_SEL_Pos)

/* 0x3F8    0x4000_03f8
    0       R/W     RESERVED_15                                     1'b0
    1       R/W     RESERVED_14                                     1'b0
    2       R/W     RESERVED_13                                     1'b0
    3       R/W     RESERVED_12                                     1'b0
    4       R/W     RESERVED_11                                     1'b0
    5       R/W     RESERVED_10                                     1'b0
    15:6    R/W     RSVD_2                                          10'h0
    16      R/W     RESERVED_9                                      1'b0
    17      R/W     RESERVED_8                                      1'b0
    18      R/W     RESERVED_7                                      1'b1
    21:19   R/W     RSVD_1                                          3'b000
    22      R/W     RESERVED_6                                      1'b0
    23      R/W     RESERVED_5                                      1'b0
    24      R/W     RESERVED_4                                      1'b0
    25      R/W     RESERVED_3                                      1'b0
    26      R/W     RESERVED_2                                      1'b0
    27      R/W     RESERVED_1                                      1'b0
    30:28   R/W     RSVD                                            3'b000
    31      R/W     RESERVED                                        1'b0
 */
typedef union _PCC_REG_PCK600_TYPE
{
    uint32_t d32;
    struct
    {
        uint32_t RESERVED_15: 1;
        uint32_t RESERVED_14: 1;
        uint32_t RESERVED_13: 1;
        uint32_t RESERVED_12: 1;
        uint32_t RESERVED_11: 1;
        uint32_t RESERVED_10: 1;
        uint32_t RSVD_2: 10;
        uint32_t RESERVED_9: 1;
        uint32_t RESERVED_8: 1;
        uint32_t RESERVED_7: 1;
        uint32_t RSVD_1: 3;
        uint32_t RESERVED_6: 1;
        uint32_t RESERVED_5: 1;
        uint32_t RESERVED_4: 1;
        uint32_t RESERVED_3: 1;
        uint32_t RESERVED_2: 1;
        uint32_t RESERVED_1: 1;
        uint32_t RSVD: 3;
        uint32_t RESERVED: 1;
    };
} PCC_REG_PCK600_TYPE;

/*0x4000_03f8 PCC_REG_PCK600*/
#define PCC_REG_PCK600_RESERVED_15_Pos                                                           0U
#define PCC_REG_PCK600_RESERVED_15_Msk                                                           (0x1UL << PCC_REG_PCK600_RESERVED_15_Pos)

#define PCC_REG_PCK600_RESERVED_14_Pos                                                           1U
#define PCC_REG_PCK600_RESERVED_14_Msk                                                           (0x1UL << PCC_REG_PCK600_RESERVED_14_Pos)

#define PCC_REG_PCK600_RESERVED_13_Pos                                                           2U
#define PCC_REG_PCK600_RESERVED_13_Msk                                                           (0x1UL << PCC_REG_PCK600_RESERVED_13_Pos)

#define PCC_REG_PCK600_RESERVED_12_Pos                                                           3U
#define PCC_REG_PCK600_RESERVED_12_Msk                                                           (0x1UL << PCC_REG_PCK600_RESERVED_12_Pos)

#define PCC_REG_PCK600_RESERVED_11_Pos                                                           4U
#define PCC_REG_PCK600_RESERVED_11_Msk                                                           (0x1UL << PCC_REG_PCK600_RESERVED_11_Pos)

#define PCC_REG_PCK600_RESERVED_10_Pos                                                           5U
#define PCC_REG_PCK600_RESERVED_10_Msk                                                           (0x1UL << PCC_REG_PCK600_RESERVED_10_Pos)

