rtkconnectivity/hal_realtek_mainline/bee/soc/inc/rtl87x2j/pcc_reg.h
#define PCC_REG_PCK600_RSVD_2_Pos                                                                6U
#define PCC_REG_PCK600_RSVD_2_Msk                                                                (0x3FFUL << PCC_REG_PCK600_RSVD_2_Pos)

#define PCC_REG_PCK600_RESERVED_9_Pos                                                            16U
#define PCC_REG_PCK600_RESERVED_9_Msk                                                            (0x1UL << PCC_REG_PCK600_RESERVED_9_Pos)

#define PCC_REG_PCK600_RESERVED_8_Pos                                                            17U
#define PCC_REG_PCK600_RESERVED_8_Msk                                                            (0x1UL << PCC_REG_PCK600_RESERVED_8_Pos)

#define PCC_REG_PCK600_RESERVED_7_Pos                                                            18U
#define PCC_REG_PCK600_RESERVED_7_Msk                                                            (0x1UL << PCC_REG_PCK600_RESERVED_7_Pos)

#define PCC_REG_PCK600_RSVD_1_Pos                                                                19U
#define PCC_REG_PCK600_RSVD_1_Msk                                                                (0x7UL << PCC_REG_PCK600_RSVD_1_Pos)

#define PCC_REG_PCK600_RESERVED_6_Pos                                                            22U
#define PCC_REG_PCK600_RESERVED_6_Msk                                                            (0x1UL << PCC_REG_PCK600_RESERVED_6_Pos)

#define PCC_REG_PCK600_RESERVED_5_Pos                                                            23U
#define PCC_REG_PCK600_RESERVED_5_Msk                                                            (0x1UL << PCC_REG_PCK600_RESERVED_5_Pos)

#define PCC_REG_PCK600_RESERVED_4_Pos                                                            24U
#define PCC_REG_PCK600_RESERVED_4_Msk                                                            (0x1UL << PCC_REG_PCK600_RESERVED_4_Pos)

#define PCC_REG_PCK600_RESERVED_3_Pos                                                            25U
#define PCC_REG_PCK600_RESERVED_3_Msk                                                            (0x1UL << PCC_REG_PCK600_RESERVED_3_Pos)

#define PCC_REG_PCK600_RESERVED_2_Pos                                                            26U
#define PCC_REG_PCK600_RESERVED_2_Msk                                                            (0x1UL << PCC_REG_PCK600_RESERVED_2_Pos)

#define PCC_REG_PCK600_RESERVED_1_Pos                                                            27U
#define PCC_REG_PCK600_RESERVED_1_Msk                                                            (0x1UL << PCC_REG_PCK600_RESERVED_1_Pos)

#define PCC_REG_PCK600_RSVD_Pos                                                                  28U
#define PCC_REG_PCK600_RSVD_Msk                                                                  (0x7UL << PCC_REG_PCK600_RSVD_Pos)

#define PCC_REG_PCK600_RESERVED_Pos                                                              31U
#define PCC_REG_PCK600_RESERVED_Msk                                                              (0x1UL << PCC_REG_PCK600_RESERVED_Pos)

/* 0x3FC    0x4000_03fc
    7:0     R/W     ENTRY_DELAY_DEV_LPC                             8'b0
    15:8    R/W     RSVD_2                                          8'h0
    16      R/W     RESERVED_7                                      1'b0
    17      R/W     RESERVED_6                                      1'b0
    18      R/W     LPC_CLK_FORCE                                   1'b0
    21:19   R/W     RSVD_1                                          3'b000
    22      R/W     RESERVED_5                                      1'b0
    23      R/W     RESERVED_4                                      1'b0
    24      R/W     RESERVED_3                                      1'b0
    25      R/W     RESERVED_2                                      1'b0
    26      R/W     RESERVED_1                                      1'b0
    27      R/W     RESERVED                                        1'b0
    30:28   R/W     RSVD                                            3'b000
    31      R/W     R_PON_FEN_LPC                                   1'b0
 */
typedef union _PCC_REG_LPC_TYPE
{
    uint32_t d32;
    struct
    {
        uint32_t ENTRY_DELAY_DEV_LPC: 8;
        uint32_t RSVD_2: 8;
        uint32_t RESERVED_7: 1;
        uint32_t RESERVED_6: 1;
        uint32_t LPC_CLK_FORCE: 1;
        uint32_t RSVD_1: 3;
        uint32_t RESERVED_5: 1;
        uint32_t RESERVED_4: 1;
        uint32_t RESERVED_3: 1;
        uint32_t RESERVED_2: 1;
        uint32_t RESERVED_1: 1;
        uint32_t RESERVED: 1;
        uint32_t RSVD: 3;
        uint32_t R_PON_FEN_LPC: 1;
    };
} PCC_REG_LPC_TYPE;

/*0x4000_03fc PCC_REG_LPC*/
#define PCC_REG_LPC_ENTRY_DELAY_DEV_LPC_Pos                                                      0U
#define PCC_REG_LPC_ENTRY_DELAY_DEV_LPC_Msk                                                      (0xFFUL << PCC_REG_LPC_ENTRY_DELAY_DEV_LPC_Pos)

#define PCC_REG_LPC_RSVD_2_Pos                                                                   8U
#define PCC_REG_LPC_RSVD_2_Msk                                                                   (0xFFUL << PCC_REG_LPC_RSVD_2_Pos)

#define PCC_REG_LPC_RESERVED_7_Pos                                                               16U
#define PCC_REG_LPC_RESERVED_7_Msk                                                               (0x1UL << PCC_REG_LPC_RESERVED_7_Pos)

#define PCC_REG_LPC_RESERVED_6_Pos                                                               17U
#define PCC_REG_LPC_RESERVED_6_Msk                                                               (0x1UL << PCC_REG_LPC_RESERVED_6_Pos)

#define PCC_REG_LPC_LPC_CLK_FORCE_Pos                                                            18U
#define PCC_REG_LPC_LPC_CLK_FORCE_Msk                                                            (0x1UL << PCC_REG_LPC_LPC_CLK_FORCE_Pos)

#define PCC_REG_LPC_RSVD_1_Pos                                                                   19U
#define PCC_REG_LPC_RSVD_1_Msk                                                                   (0x7UL << PCC_REG_LPC_RSVD_1_Pos)

