rtkconnectivity/hal_realtek_mainline/bee/soc/inc/rtl87x2j/pcc_reg.h
#define PCC_REG_LPC_RESERVED_5_Pos                                                               22U
#define PCC_REG_LPC_RESERVED_5_Msk                                                               (0x1UL << PCC_REG_LPC_RESERVED_5_Pos)

#define PCC_REG_LPC_RESERVED_4_Pos                                                               23U
#define PCC_REG_LPC_RESERVED_4_Msk                                                               (0x1UL << PCC_REG_LPC_RESERVED_4_Pos)

#define PCC_REG_LPC_RESERVED_3_Pos                                                               24U
#define PCC_REG_LPC_RESERVED_3_Msk                                                               (0x1UL << PCC_REG_LPC_RESERVED_3_Pos)

#define PCC_REG_LPC_RESERVED_2_Pos                                                               25U
#define PCC_REG_LPC_RESERVED_2_Msk                                                               (0x1UL << PCC_REG_LPC_RESERVED_2_Pos)

#define PCC_REG_LPC_RESERVED_1_Pos                                                               26U
#define PCC_REG_LPC_RESERVED_1_Msk                                                               (0x1UL << PCC_REG_LPC_RESERVED_1_Pos)

#define PCC_REG_LPC_RESERVED_Pos                                                                 27U
#define PCC_REG_LPC_RESERVED_Msk                                                                 (0x1UL << PCC_REG_LPC_RESERVED_Pos)

#define PCC_REG_LPC_RSVD_Pos                                                                     28U
#define PCC_REG_LPC_RSVD_Msk                                                                     (0x7UL << PCC_REG_LPC_RSVD_Pos)

#define PCC_REG_LPC_R_PON_FEN_LPC_Pos                                                            31U
#define PCC_REG_LPC_R_PON_FEN_LPC_Msk                                                            (0x1UL << PCC_REG_LPC_R_PON_FEN_LPC_Pos)

/* 0x2C0    0x4000_02c0
    7:0     R/W     R_PMUX_GPIO_P0_0                                8'h00
    15:8    R/W     R_PMUX_GPIO_P0_1                                8'h00
    23:16   R/W     R_PMUX_GPIO_P0_2                                8'h00
    31:24   R/W     R_PMUX_GPIO_P0_3                                8'h1D
 */
typedef union _PCC_r_PMUX_GPIO_P0_0to3_TYPE
{
    uint32_t d32;
    struct
    {
        uint32_t R_PMUX_GPIO_P0_0: 8;
        uint32_t R_PMUX_GPIO_P0_1: 8;
        uint32_t R_PMUX_GPIO_P0_2: 8;
        uint32_t R_PMUX_GPIO_P0_3: 8;
    };
} PCC_r_PMUX_GPIO_P0_0to3_TYPE;

/*0x4000_02c0 PCC_r_PMUX_GPIO_P0_0to3*/
#define PCC_r_PMUX_GPIO_P0_0to3_R_PMUX_GPIO_P0_0_Pos                                             0U
#define PCC_r_PMUX_GPIO_P0_0to3_R_PMUX_GPIO_P0_0_Msk                                             (0xFFUL << PCC_r_PMUX_GPIO_P0_0to3_R_PMUX_GPIO_P0_0_Pos)

#define PCC_r_PMUX_GPIO_P0_0to3_R_PMUX_GPIO_P0_1_Pos                                             8U
#define PCC_r_PMUX_GPIO_P0_0to3_R_PMUX_GPIO_P0_1_Msk                                             (0xFFUL << PCC_r_PMUX_GPIO_P0_0to3_R_PMUX_GPIO_P0_1_Pos)

#define PCC_r_PMUX_GPIO_P0_0to3_R_PMUX_GPIO_P0_2_Pos                                             16U
#define PCC_r_PMUX_GPIO_P0_0to3_R_PMUX_GPIO_P0_2_Msk                                             (0xFFUL << PCC_r_PMUX_GPIO_P0_0to3_R_PMUX_GPIO_P0_2_Pos)

#define PCC_r_PMUX_GPIO_P0_0to3_R_PMUX_GPIO_P0_3_Pos                                             24U
#define PCC_r_PMUX_GPIO_P0_0to3_R_PMUX_GPIO_P0_3_Msk                                             (0xFFUL << PCC_r_PMUX_GPIO_P0_0to3_R_PMUX_GPIO_P0_3_Pos)

/* 0x2C4    0x4000_02c4
    7:0     R/W     R_PMUX_GPIO_P0_4                                8'h00
    15:8    R/W     R_PMUX_GPIO_P0_5                                8'h00
    23:16   R/W     R_PMUX_GPIO_P0_6                                8'h00
    31:24   R/W     R_PMUX_GPIO_P0_7                                8'h00
 */
typedef union _PCC_r_PMUX_GPIO_P0_4to7_TYPE
{
    uint32_t d32;
    struct
    {
        uint32_t R_PMUX_GPIO_P0_4: 8;
        uint32_t R_PMUX_GPIO_P0_5: 8;
        uint32_t R_PMUX_GPIO_P0_6: 8;
        uint32_t R_PMUX_GPIO_P0_7: 8;
    };
} PCC_r_PMUX_GPIO_P0_4to7_TYPE;

/*0x4000_02c4 PCC_r_PMUX_GPIO_P0_4to7*/
#define PCC_r_PMUX_GPIO_P0_4to7_R_PMUX_GPIO_P0_4_Pos                                             0U
#define PCC_r_PMUX_GPIO_P0_4to7_R_PMUX_GPIO_P0_4_Msk                                             (0xFFUL << PCC_r_PMUX_GPIO_P0_4to7_R_PMUX_GPIO_P0_4_Pos)

#define PCC_r_PMUX_GPIO_P0_4to7_R_PMUX_GPIO_P0_5_Pos                                             8U
#define PCC_r_PMUX_GPIO_P0_4to7_R_PMUX_GPIO_P0_5_Msk                                             (0xFFUL << PCC_r_PMUX_GPIO_P0_4to7_R_PMUX_GPIO_P0_5_Pos)

#define PCC_r_PMUX_GPIO_P0_4to7_R_PMUX_GPIO_P0_6_Pos                                             16U
#define PCC_r_PMUX_GPIO_P0_4to7_R_PMUX_GPIO_P0_6_Msk                                             (0xFFUL << PCC_r_PMUX_GPIO_P0_4to7_R_PMUX_GPIO_P0_6_Pos)

#define PCC_r_PMUX_GPIO_P0_4to7_R_PMUX_GPIO_P0_7_Pos                                             24U
#define PCC_r_PMUX_GPIO_P0_4to7_R_PMUX_GPIO_P0_7_Msk                                             (0xFFUL << PCC_r_PMUX_GPIO_P0_4to7_R_PMUX_GPIO_P0_7_Pos)

/* 0x2C8    0x4000_02c8
    7:0     R/W     R_PMUX_GPIO_P1_0                                8'h3C
    15:8    R/W     R_PMUX_GPIO_P1_1                                8'h3B
    23:16   R/W     R_PMUX_GPIO_P1_6                                8'h00
    31:24   R/W     R_PMUX_GPIO_P1_7                                8'h00
 */
typedef union _PCC_r_PMUX_GPIO_P1_0to7_TYPE
{
    uint32_t d32;
    struct
    {
        uint32_t R_PMUX_GPIO_P1_0: 8;
        uint32_t R_PMUX_GPIO_P1_1: 8;
        uint32_t R_PMUX_GPIO_P1_6: 8;
        uint32_t R_PMUX_GPIO_P1_7: 8;
    };
} PCC_r_PMUX_GPIO_P1_0to7_TYPE;

/*0x4000_02c8 PCC_r_PMUX_GPIO_P1_0to7*/
#define PCC_r_PMUX_GPIO_P1_0to7_R_PMUX_GPIO_P1_0_Pos                                             0U
#define PCC_r_PMUX_GPIO_P1_0to7_R_PMUX_GPIO_P1_0_Msk                                             (0xFFUL << PCC_r_PMUX_GPIO_P1_0to7_R_PMUX_GPIO_P1_0_Pos)

#define PCC_r_PMUX_GPIO_P1_0to7_R_PMUX_GPIO_P1_1_Pos                                             8U
#define PCC_r_PMUX_GPIO_P1_0to7_R_PMUX_GPIO_P1_1_Msk                                             (0xFFUL << PCC_r_PMUX_GPIO_P1_0to7_R_PMUX_GPIO_P1_1_Pos)

#define PCC_r_PMUX_GPIO_P1_0to7_R_PMUX_GPIO_P1_6_Pos                                             16U
#define PCC_r_PMUX_GPIO_P1_0to7_R_PMUX_GPIO_P1_6_Msk                                             (0xFFUL << PCC_r_PMUX_GPIO_P1_0to7_R_PMUX_GPIO_P1_6_Pos)

#define PCC_r_PMUX_GPIO_P1_0to7_R_PMUX_GPIO_P1_7_Pos                                             24U
#define PCC_r_PMUX_GPIO_P1_0to7_R_PMUX_GPIO_P1_7_Msk                                             (0xFFUL << PCC_r_PMUX_GPIO_P1_0to7_R_PMUX_GPIO_P1_7_Pos)

/* 0x2CC    0x4000_02cc
    7:0     R/W     R_PMUX_GPIO_P2_0                                8'h00
    15:8    R/W     R_PMUX_GPIO_P2_1                                8'h00
    23:16   R/W     R_PMUX_GPIO_P2_2                                8'h00
    31:24   R/W     R_PMUX_GPIO_P2_3                                8'h00
 */
typedef union _PCC_r_PMUX_GPIO_P2_0to3_TYPE
{
    uint32_t d32;
    struct
    {
        uint32_t R_PMUX_GPIO_P2_0: 8;
        uint32_t R_PMUX_GPIO_P2_1: 8;
        uint32_t R_PMUX_GPIO_P2_2: 8;
        uint32_t R_PMUX_GPIO_P2_3: 8;
    };
} PCC_r_PMUX_GPIO_P2_0to3_TYPE;

/*0x4000_02cc PCC_r_PMUX_GPIO_P2_0to3*/
#define PCC_r_PMUX_GPIO_P2_0to3_R_PMUX_GPIO_P2_0_Pos                                             0U
#define PCC_r_PMUX_GPIO_P2_0to3_R_PMUX_GPIO_P2_0_Msk                                             (0xFFUL << PCC_r_PMUX_GPIO_P2_0to3_R_PMUX_GPIO_P2_0_Pos)

#define PCC_r_PMUX_GPIO_P2_0to3_R_PMUX_GPIO_P2_1_Pos                                             8U
#define PCC_r_PMUX_GPIO_P2_0to3_R_PMUX_GPIO_P2_1_Msk                                             (0xFFUL << PCC_r_PMUX_GPIO_P2_0to3_R_PMUX_GPIO_P2_1_Pos)

#define PCC_r_PMUX_GPIO_P2_0to3_R_PMUX_GPIO_P2_2_Pos                                             16U
#define PCC_r_PMUX_GPIO_P2_0to3_R_PMUX_GPIO_P2_2_Msk                                             (0xFFUL << PCC_r_PMUX_GPIO_P2_0to3_R_PMUX_GPIO_P2_2_Pos)

#define PCC_r_PMUX_GPIO_P2_0to3_R_PMUX_GPIO_P2_3_Pos                                             24U
#define PCC_r_PMUX_GPIO_P2_0to3_R_PMUX_GPIO_P2_3_Msk                                             (0xFFUL << PCC_r_PMUX_GPIO_P2_0to3_R_PMUX_GPIO_P2_3_Pos)

