rtkconnectivity/hal_realtek_mainline/bee/soc/inc/rtl87x2j/pcc_reg.h
/* 0x2D0    0x4000_02d0
    7:0     R/W     R_PMUX_GPIO_P2_4                                8'h00
    15:8    R/W     R_PMUX_GPIO_P2_5                                8'h00
    23:16   R/W     R_PMUX_GPIO_P2_6                                8'h00
    31:24   R/W     R_PMUX_GPIO_P2_7                                8'h00
 */
typedef union _PCC_r_PMUX_GPIO_P2_4to7_TYPE
{
    uint32_t d32;
    struct
    {
        uint32_t R_PMUX_GPIO_P2_4: 8;
        uint32_t R_PMUX_GPIO_P2_5: 8;
        uint32_t R_PMUX_GPIO_P2_6: 8;
        uint32_t R_PMUX_GPIO_P2_7: 8;
    };
} PCC_r_PMUX_GPIO_P2_4to7_TYPE;

/*0x4000_02d0 PCC_r_PMUX_GPIO_P2_4to7*/
#define PCC_r_PMUX_GPIO_P2_4to7_R_PMUX_GPIO_P2_4_Pos                                             0U
#define PCC_r_PMUX_GPIO_P2_4to7_R_PMUX_GPIO_P2_4_Msk                                             (0xFFUL << PCC_r_PMUX_GPIO_P2_4to7_R_PMUX_GPIO_P2_4_Pos)

#define PCC_r_PMUX_GPIO_P2_4to7_R_PMUX_GPIO_P2_5_Pos                                             8U
#define PCC_r_PMUX_GPIO_P2_4to7_R_PMUX_GPIO_P2_5_Msk                                             (0xFFUL << PCC_r_PMUX_GPIO_P2_4to7_R_PMUX_GPIO_P2_5_Pos)

#define PCC_r_PMUX_GPIO_P2_4to7_R_PMUX_GPIO_P2_6_Pos                                             16U
#define PCC_r_PMUX_GPIO_P2_4to7_R_PMUX_GPIO_P2_6_Msk                                             (0xFFUL << PCC_r_PMUX_GPIO_P2_4to7_R_PMUX_GPIO_P2_6_Pos)

#define PCC_r_PMUX_GPIO_P2_4to7_R_PMUX_GPIO_P2_7_Pos                                             24U
#define PCC_r_PMUX_GPIO_P2_4to7_R_PMUX_GPIO_P2_7_Msk                                             (0xFFUL << PCC_r_PMUX_GPIO_P2_4to7_R_PMUX_GPIO_P2_7_Pos)

/* 0x2D4    0x4000_02d4
    7:0     R/W     R_PMUX_GPIO_P3_0                                8'h00
    15:8    R/W     R_PMUX_GPIO_P3_1                                8'h00
    23:16   R/W     R_PMUX_GPIO_P3_2                                8'h00
    31:24   R/W     R_PMUX_GPIO_P3_3                                8'h00
 */
typedef union _PCC_r_PMUX_GPIO_P3_0to3_TYPE
{
    uint32_t d32;
    struct
    {
        uint32_t R_PMUX_GPIO_P3_0: 8;
        uint32_t R_PMUX_GPIO_P3_1: 8;
        uint32_t R_PMUX_GPIO_P3_2: 8;
        uint32_t R_PMUX_GPIO_P3_3: 8;
    };
} PCC_r_PMUX_GPIO_P3_0to3_TYPE;

/*0x4000_02d4 PCC_r_PMUX_GPIO_P3_0to3*/
#define PCC_r_PMUX_GPIO_P3_0to3_R_PMUX_GPIO_P3_0_Pos                                             0U
#define PCC_r_PMUX_GPIO_P3_0to3_R_PMUX_GPIO_P3_0_Msk                                             (0xFFUL << PCC_r_PMUX_GPIO_P3_0to3_R_PMUX_GPIO_P3_0_Pos)

#define PCC_r_PMUX_GPIO_P3_0to3_R_PMUX_GPIO_P3_1_Pos                                             8U
#define PCC_r_PMUX_GPIO_P3_0to3_R_PMUX_GPIO_P3_1_Msk                                             (0xFFUL << PCC_r_PMUX_GPIO_P3_0to3_R_PMUX_GPIO_P3_1_Pos)

#define PCC_r_PMUX_GPIO_P3_0to3_R_PMUX_GPIO_P3_2_Pos                                             16U
#define PCC_r_PMUX_GPIO_P3_0to3_R_PMUX_GPIO_P3_2_Msk                                             (0xFFUL << PCC_r_PMUX_GPIO_P3_0to3_R_PMUX_GPIO_P3_2_Pos)

#define PCC_r_PMUX_GPIO_P3_0to3_R_PMUX_GPIO_P3_3_Pos                                             24U
#define PCC_r_PMUX_GPIO_P3_0to3_R_PMUX_GPIO_P3_3_Msk                                             (0xFFUL << PCC_r_PMUX_GPIO_P3_0to3_R_PMUX_GPIO_P3_3_Pos)

/* 0x2D8    0x4000_02d8
    7:0     R/W     R_PMUX_GPIO_P3_4                                8'h23
    15:8    R/W     R_PMUX_GPIO_P3_5                                8'h24
    23:16   R/W     R_PMUX_GPIO_P3_6                                8'h00
    31:24   R/W     DUMMY                                           8'h00
 */
typedef union _PCC_r_PMUX_GPIO_P3_4to6_TYPE
{
    uint32_t d32;
    struct
    {
        uint32_t R_PMUX_GPIO_P3_4: 8;
        uint32_t R_PMUX_GPIO_P3_5: 8;
        uint32_t R_PMUX_GPIO_P3_6: 8;
        uint32_t DUMMY: 8;
    };
} PCC_r_PMUX_GPIO_P3_4to6_TYPE;

/*0x4000_02d8 PCC_r_PMUX_GPIO_P3_4to6*/
#define PCC_r_PMUX_GPIO_P3_4to6_R_PMUX_GPIO_P3_4_Pos                                             0U
#define PCC_r_PMUX_GPIO_P3_4to6_R_PMUX_GPIO_P3_4_Msk                                             (0xFFUL << PCC_r_PMUX_GPIO_P3_4to6_R_PMUX_GPIO_P3_4_Pos)

#define PCC_r_PMUX_GPIO_P3_4to6_R_PMUX_GPIO_P3_5_Pos                                             8U
#define PCC_r_PMUX_GPIO_P3_4to6_R_PMUX_GPIO_P3_5_Msk                                             (0xFFUL << PCC_r_PMUX_GPIO_P3_4to6_R_PMUX_GPIO_P3_5_Pos)

#define PCC_r_PMUX_GPIO_P3_4to6_R_PMUX_GPIO_P3_6_Pos                                             16U
#define PCC_r_PMUX_GPIO_P3_4to6_R_PMUX_GPIO_P3_6_Msk                                             (0xFFUL << PCC_r_PMUX_GPIO_P3_4to6_R_PMUX_GPIO_P3_6_Pos)

#define PCC_r_PMUX_GPIO_P3_4to6_DUMMY_Pos                                                        24U
#define PCC_r_PMUX_GPIO_P3_4to6_DUMMY_Msk                                                        (0xFFUL << PCC_r_PMUX_GPIO_P3_4to6_DUMMY_Pos)

/* 0x2DC    0x4000_02dc
    7:0     R/W     R_PMUX_GPIO_P4_0                                8'h00
    15:8    R/W     R_PMUX_GPIO_P4_1                                8'h00
    23:16   R/W     R_PMUX_GPIO_P4_2                                8'h00
    31:24   R/W     R_PMUX_GPIO_P4_3                                8'h00
 */
typedef union _PCC_r_PMUX_GPIO_P4_0to3_TYPE
{
    uint32_t d32;
    struct
    {
        uint32_t R_PMUX_GPIO_P4_0: 8;
        uint32_t R_PMUX_GPIO_P4_1: 8;
        uint32_t R_PMUX_GPIO_P4_2: 8;
        uint32_t R_PMUX_GPIO_P4_3: 8;
    };
} PCC_r_PMUX_GPIO_P4_0to3_TYPE;

/*0x4000_02dc PCC_r_PMUX_GPIO_P4_0to3*/
#define PCC_r_PMUX_GPIO_P4_0to3_R_PMUX_GPIO_P4_0_Pos                                             0U
#define PCC_r_PMUX_GPIO_P4_0to3_R_PMUX_GPIO_P4_0_Msk                                             (0xFFUL << PCC_r_PMUX_GPIO_P4_0to3_R_PMUX_GPIO_P4_0_Pos)

#define PCC_r_PMUX_GPIO_P4_0to3_R_PMUX_GPIO_P4_1_Pos                                             8U
#define PCC_r_PMUX_GPIO_P4_0to3_R_PMUX_GPIO_P4_1_Msk                                             (0xFFUL << PCC_r_PMUX_GPIO_P4_0to3_R_PMUX_GPIO_P4_1_Pos)

#define PCC_r_PMUX_GPIO_P4_0to3_R_PMUX_GPIO_P4_2_Pos                                             16U
#define PCC_r_PMUX_GPIO_P4_0to3_R_PMUX_GPIO_P4_2_Msk                                             (0xFFUL << PCC_r_PMUX_GPIO_P4_0to3_R_PMUX_GPIO_P4_2_Pos)

