rtkconnectivity/hal_realtek_mainline/bee/soc/inc/rtl87x2j/pcc_reg.h
#define PCC_r_PMUX_GPIO_P4_0to3_R_PMUX_GPIO_P4_3_Pos                                             24U
#define PCC_r_PMUX_GPIO_P4_0to3_R_PMUX_GPIO_P4_3_Msk                                             (0xFFUL << PCC_r_PMUX_GPIO_P4_0to3_R_PMUX_GPIO_P4_3_Pos)

/* 0x2E0    0x4000_02e0
    7:0     R/W     R_PMUX_GPIO_MICBIAS_0                           8'h00
    15:8    R/W     R_PMUX_GPIO_P5_1                                8'h00
    23:16   R/W     R_PMUX_GPIO_P5_2                                8'h00
    31:24   R/W     DUMMY37                                         8'h00
 */
typedef union _PCC_r_PMUX_GPIO_H_0to2_TYPE
{
    uint32_t d32;
    struct
    {
        uint32_t R_PMUX_GPIO_MICBIAS_0: 8;
        uint32_t R_PMUX_GPIO_P5_1: 8;
        uint32_t R_PMUX_GPIO_P5_2: 8;
        uint32_t DUMMY37: 8;
    };
} PCC_r_PMUX_GPIO_H_0to2_TYPE;

/*0x4000_02e0 PCC_r_PMUX_GPIO_H_0to2*/
#define PCC_r_PMUX_GPIO_H_0to2_R_PMUX_GPIO_MICBIAS_0_Pos                                         0U
#define PCC_r_PMUX_GPIO_H_0to2_R_PMUX_GPIO_MICBIAS_0_Msk                                         (0xFFUL << PCC_r_PMUX_GPIO_H_0to2_R_PMUX_GPIO_MICBIAS_0_Pos)

#define PCC_r_PMUX_GPIO_H_0to2_R_PMUX_GPIO_P5_1_Pos                                              8U
#define PCC_r_PMUX_GPIO_H_0to2_R_PMUX_GPIO_P5_1_Msk                                              (0xFFUL << PCC_r_PMUX_GPIO_H_0to2_R_PMUX_GPIO_P5_1_Pos)

#define PCC_r_PMUX_GPIO_H_0to2_R_PMUX_GPIO_P5_2_Pos                                              16U
#define PCC_r_PMUX_GPIO_H_0to2_R_PMUX_GPIO_P5_2_Msk                                              (0xFFUL << PCC_r_PMUX_GPIO_H_0to2_R_PMUX_GPIO_P5_2_Pos)

#define PCC_r_PMUX_GPIO_H_0to2_DUMMY37_Pos                                                       24U
#define PCC_r_PMUX_GPIO_H_0to2_DUMMY37_Msk                                                       (0xFFUL << PCC_r_PMUX_GPIO_H_0to2_DUMMY37_Pos)

/* 0x2E4    0x4000_02e4
    7:0     R/W     R_PMUX_GPIO_P6_0                                8'h00
    15:8    R/W     R_PMUX_GPIO_P6_1                                8'h00
    23:16   R/W     R_PMUX_GPIO_P6_2                                8'h00
    31:24   R/W     R_PMUX_GPIO_P6_3                                8'h00
 */
typedef union _PCC_REG_PMUX_GPIO_6_0to3_TYPE
{
    uint32_t d32;
    struct
    {
        uint32_t R_PMUX_GPIO_P6_0: 8;
        uint32_t R_PMUX_GPIO_P6_1: 8;
        uint32_t R_PMUX_GPIO_P6_2: 8;
        uint32_t R_PMUX_GPIO_P6_3: 8;
    };
} PCC_REG_PMUX_GPIO_6_0to3_TYPE;

/*0x4000_02e4 PCC_REG_PMUX_GPIO_6_0to3*/
#define PCC_REG_PMUX_GPIO_6_0to3_R_PMUX_GPIO_P6_0_Pos                                            0U
#define PCC_REG_PMUX_GPIO_6_0to3_R_PMUX_GPIO_P6_0_Msk                                            (0xFFUL << PCC_REG_PMUX_GPIO_6_0to3_R_PMUX_GPIO_P6_0_Pos)

#define PCC_REG_PMUX_GPIO_6_0to3_R_PMUX_GPIO_P6_1_Pos                                            8U
#define PCC_REG_PMUX_GPIO_6_0to3_R_PMUX_GPIO_P6_1_Msk                                            (0xFFUL << PCC_REG_PMUX_GPIO_6_0to3_R_PMUX_GPIO_P6_1_Pos)

#define PCC_REG_PMUX_GPIO_6_0to3_R_PMUX_GPIO_P6_2_Pos                                            16U
#define PCC_REG_PMUX_GPIO_6_0to3_R_PMUX_GPIO_P6_2_Msk                                            (0xFFUL << PCC_REG_PMUX_GPIO_6_0to3_R_PMUX_GPIO_P6_2_Pos)

#define PCC_REG_PMUX_GPIO_6_0to3_R_PMUX_GPIO_P6_3_Pos                                            24U
#define PCC_REG_PMUX_GPIO_6_0to3_R_PMUX_GPIO_P6_3_Msk                                            (0xFFUL << PCC_REG_PMUX_GPIO_6_0to3_R_PMUX_GPIO_P6_3_Pos)

/* 0x2E8    0x4000_02e8
    7:0     R/W     R_PMUX_GPIO_P6_4                                8'h00
    15:8    R/W     R_PMUX_GPIO_P6_5                                8'h00
    23:16   R/W     R_PMUX_GPIO_P6_6                                8'h00
    31:24   R/W     R_PMUX_GPIO_P6_7                                8'h00
 */
typedef union _PCC_REG_PMUX_GPIO_6_4to7_TYPE
{
    uint32_t d32;
    struct
    {
        uint32_t R_PMUX_GPIO_P6_4: 8;
        uint32_t R_PMUX_GPIO_P6_5: 8;
        uint32_t R_PMUX_GPIO_P6_6: 8;
        uint32_t R_PMUX_GPIO_P6_7: 8;
    };
} PCC_REG_PMUX_GPIO_6_4to7_TYPE;

/*0x4000_02e8 PCC_REG_PMUX_GPIO_6_4to7*/
#define PCC_REG_PMUX_GPIO_6_4to7_R_PMUX_GPIO_P6_4_Pos                                            0U
#define PCC_REG_PMUX_GPIO_6_4to7_R_PMUX_GPIO_P6_4_Msk                                            (0xFFUL << PCC_REG_PMUX_GPIO_6_4to7_R_PMUX_GPIO_P6_4_Pos)

#define PCC_REG_PMUX_GPIO_6_4to7_R_PMUX_GPIO_P6_5_Pos                                            8U
#define PCC_REG_PMUX_GPIO_6_4to7_R_PMUX_GPIO_P6_5_Msk                                            (0xFFUL << PCC_REG_PMUX_GPIO_6_4to7_R_PMUX_GPIO_P6_5_Pos)

#define PCC_REG_PMUX_GPIO_6_4to7_R_PMUX_GPIO_P6_6_Pos                                            16U
#define PCC_REG_PMUX_GPIO_6_4to7_R_PMUX_GPIO_P6_6_Msk                                            (0xFFUL << PCC_REG_PMUX_GPIO_6_4to7_R_PMUX_GPIO_P6_6_Pos)

#define PCC_REG_PMUX_GPIO_6_4to7_R_PMUX_GPIO_P6_7_Pos                                            24U
#define PCC_REG_PMUX_GPIO_6_4to7_R_PMUX_GPIO_P6_7_Msk                                            (0xFFUL << PCC_REG_PMUX_GPIO_6_4to7_R_PMUX_GPIO_P6_7_Pos)

/* 0x2EC    0x4000_02ec
    7:0     R/W     R_PMUX_GPIO_P7_0                                8'h00
    15:8    R/W     R_PMUX_GPIO_P7_1                                8'h00
    23:16   R/W     R_PMUX_GPIO_SPIC_CSN                            8'h00
    31:24   R/W     R_PMUX_GPIO_SPIC_SCK                            8'h00
 */
typedef union _PCC_REG_PMUX_GPIO_7_0to1_SPIC_1_TYPE
{
    uint32_t d32;
    struct
    {
        uint32_t R_PMUX_GPIO_P7_0: 8;
        uint32_t R_PMUX_GPIO_P7_1: 8;
        uint32_t R_PMUX_GPIO_SPIC_CSN: 8;
        uint32_t R_PMUX_GPIO_SPIC_SCK: 8;
    };
} PCC_REG_PMUX_GPIO_7_0to1_SPIC_1_TYPE;

/*0x4000_02ec PCC_REG_PMUX_GPIO_7_0to1_SPIC_1*/
#define PCC_REG_PMUX_GPIO_7_0to1_SPIC_1_R_PMUX_GPIO_P7_0_Pos                                     0U
#define PCC_REG_PMUX_GPIO_7_0to1_SPIC_1_R_PMUX_GPIO_P7_0_Msk                                     (0xFFUL << PCC_REG_PMUX_GPIO_7_0to1_SPIC_1_R_PMUX_GPIO_P7_0_Pos)

#define PCC_REG_PMUX_GPIO_7_0to1_SPIC_1_R_PMUX_GPIO_P7_1_Pos                                     8U
#define PCC_REG_PMUX_GPIO_7_0to1_SPIC_1_R_PMUX_GPIO_P7_1_Msk                                     (0xFFUL << PCC_REG_PMUX_GPIO_7_0to1_SPIC_1_R_PMUX_GPIO_P7_1_Pos)

#define PCC_REG_PMUX_GPIO_7_0to1_SPIC_1_R_PMUX_GPIO_SPIC_CSN_Pos                                 16U
#define PCC_REG_PMUX_GPIO_7_0to1_SPIC_1_R_PMUX_GPIO_SPIC_CSN_Msk                                 (0xFFUL << PCC_REG_PMUX_GPIO_7_0to1_SPIC_1_R_PMUX_GPIO_SPIC_CSN_Pos)

#define PCC_REG_PMUX_GPIO_7_0to1_SPIC_1_R_PMUX_GPIO_SPIC_SCK_Pos                                 24U
#define PCC_REG_PMUX_GPIO_7_0to1_SPIC_1_R_PMUX_GPIO_SPIC_SCK_Msk                                 (0xFFUL << PCC_REG_PMUX_GPIO_7_0to1_SPIC_1_R_PMUX_GPIO_SPIC_SCK_Pos)

/* 0x2F0    0x4000_02f0
    7:0     R/W     R_PMUX_GPIO_SPIC_SI                             8'h00
    15:8    R/W     R_PMUX_GPIO_SPIC_SO                             8'h00
    23:16   R/W     R_PMUX_GPIO_P1_4                                8'h00
    31:24   R/W     R_PMUX_GPIO_P1_3                                8'h00
 */
typedef union _PCC_REG_PMUX_GPIO_SPIC_2_TYPE
{
    uint32_t d32;
    struct
    {
        uint32_t R_PMUX_GPIO_SPIC_SI: 8;
        uint32_t R_PMUX_GPIO_SPIC_SO: 8;
        uint32_t R_PMUX_GPIO_P1_4: 8;
        uint32_t R_PMUX_GPIO_P1_3: 8;
    };
} PCC_REG_PMUX_GPIO_SPIC_2_TYPE;

