rtkconnectivity/hal_realtek_mainline/bee/soc/inc/rtl87x2j/pcc_reg.h
/*0x4000_02f0 PCC_REG_PMUX_GPIO_SPIC_2*/
#define PCC_REG_PMUX_GPIO_SPIC_2_R_PMUX_GPIO_SPIC_SI_Pos                                         0U
#define PCC_REG_PMUX_GPIO_SPIC_2_R_PMUX_GPIO_SPIC_SI_Msk                                         (0xFFUL << PCC_REG_PMUX_GPIO_SPIC_2_R_PMUX_GPIO_SPIC_SI_Pos)

#define PCC_REG_PMUX_GPIO_SPIC_2_R_PMUX_GPIO_SPIC_SO_Pos                                         8U
#define PCC_REG_PMUX_GPIO_SPIC_2_R_PMUX_GPIO_SPIC_SO_Msk                                         (0xFFUL << PCC_REG_PMUX_GPIO_SPIC_2_R_PMUX_GPIO_SPIC_SO_Pos)

#define PCC_REG_PMUX_GPIO_SPIC_2_R_PMUX_GPIO_P1_4_Pos                                            16U
#define PCC_REG_PMUX_GPIO_SPIC_2_R_PMUX_GPIO_P1_4_Msk                                            (0xFFUL << PCC_REG_PMUX_GPIO_SPIC_2_R_PMUX_GPIO_P1_4_Pos)

#define PCC_REG_PMUX_GPIO_SPIC_2_R_PMUX_GPIO_P1_3_Pos                                            24U
#define PCC_REG_PMUX_GPIO_SPIC_2_R_PMUX_GPIO_P1_3_Msk                                            (0xFFUL << PCC_REG_PMUX_GPIO_SPIC_2_R_PMUX_GPIO_P1_3_Pos)

/* 0x2F4    0x4000_02f4
    3:0     R/W     R_PMUX_TEST_MODE                                4'h1
    6:4     R/W     R_DW_SPIM_EN                                    3'h0
    7       R/W     R_PMUX_TEST_MODE_EN                             0
    8       R/W     R_SAR_TM_DAT_SEL                                0
    9       R/W     DUMMY62                                         0
    13:10   R/W     R_PMUX_1_WIRE_UART_EN                           4'h0
    14      R/W     R_SAR_TM_CLK_SEL                                1'b0
    15      R/W     R_SAR_TM_CH_SEL                                 1'b0
    17:16   R/W     R_OSC80M_TEST_MODE_CLK_DIV                      2'h0
    19:18   R/W     R_PLL_TEST_MODE_CLK_DIV                         2'h0
    20      R/W     R_PMUX_DBG_SPIC0                                0
    21      R/W     DUMMY60                                         0
    22      R/W     DUMMY59                                         0
    23      R/W     R_PMUX_DIG_SMUX_EN                              0
    24      R/W     R_PON_PMUX_SPIM0_EN                             0
    25      R/W     R_PMUX_SPIM_EN_OPT                              0
    26      R/W     R_PMUX_FLASH_EXTC_EN                            0
    27      R/W     R_PMUX_FLASH_EN                                 0
    29:28   R/W     DUMMY58                                         2'h0
    30      R/W     DUMMY57                                         0
    31      R/W     DUMMY56                                         0
 */
typedef union _PCC_r_PMUX_TEST_MODE_TYPE
{
    uint32_t d32;
    struct
    {
        uint32_t R_PMUX_TEST_MODE: 4;
        uint32_t R_DW_SPIM_EN: 3;
        uint32_t R_PMUX_TEST_MODE_EN: 1;
        uint32_t R_SAR_TM_DAT_SEL: 1;
        uint32_t DUMMY62: 1;
        uint32_t R_PMUX_1_WIRE_UART_EN: 4;
        uint32_t R_SAR_TM_CLK_SEL: 1;
        uint32_t R_SAR_TM_CH_SEL: 1;
        uint32_t R_OSC80M_TEST_MODE_CLK_DIV: 2;
        uint32_t R_PLL_TEST_MODE_CLK_DIV: 2;
        uint32_t R_PMUX_DBG_SPIC0: 1;
        uint32_t DUMMY60: 1;
        uint32_t DUMMY59: 1;
        uint32_t R_PMUX_DIG_SMUX_EN: 1;
        uint32_t R_PON_PMUX_SPIM0_EN: 1;
        uint32_t R_PMUX_SPIM_EN_OPT: 1;
        uint32_t R_PMUX_FLASH_EXTC_EN: 1;
        uint32_t R_PMUX_FLASH_EN: 1;
        uint32_t DUMMY58: 2;
        uint32_t DUMMY57: 1;
        uint32_t DUMMY56: 1;
    };
} PCC_r_PMUX_TEST_MODE_TYPE;

/*0x4000_02f4 PCC_r_PMUX_TEST_MODE*/
#define PCC_r_PMUX_TEST_MODE_R_PMUX_TEST_MODE_Pos                                                0U
#define PCC_r_PMUX_TEST_MODE_R_PMUX_TEST_MODE_Msk                                                (0xFUL << PCC_r_PMUX_TEST_MODE_R_PMUX_TEST_MODE_Pos)

#define PCC_r_PMUX_TEST_MODE_R_DW_SPIM_EN_Pos                                                    4U
#define PCC_r_PMUX_TEST_MODE_R_DW_SPIM_EN_Msk                                                    (0x7UL << PCC_r_PMUX_TEST_MODE_R_DW_SPIM_EN_Pos)

#define PCC_r_PMUX_TEST_MODE_R_PMUX_TEST_MODE_EN_Pos                                             7U
#define PCC_r_PMUX_TEST_MODE_R_PMUX_TEST_MODE_EN_Msk                                             (0x1UL << PCC_r_PMUX_TEST_MODE_R_PMUX_TEST_MODE_EN_Pos)

#define PCC_r_PMUX_TEST_MODE_R_SAR_TM_DAT_SEL_Pos                                                8U
#define PCC_r_PMUX_TEST_MODE_R_SAR_TM_DAT_SEL_Msk                                                (0x1UL << PCC_r_PMUX_TEST_MODE_R_SAR_TM_DAT_SEL_Pos)

#define PCC_r_PMUX_TEST_MODE_DUMMY62_Pos                                                         9U
#define PCC_r_PMUX_TEST_MODE_DUMMY62_Msk                                                         (0x1UL << PCC_r_PMUX_TEST_MODE_DUMMY62_Pos)

#define PCC_r_PMUX_TEST_MODE_R_PMUX_1_WIRE_UART_EN_Pos                                           10U
#define PCC_r_PMUX_TEST_MODE_R_PMUX_1_WIRE_UART_EN_Msk                                           (0xFUL << PCC_r_PMUX_TEST_MODE_R_PMUX_1_WIRE_UART_EN_Pos)

#define PCC_r_PMUX_TEST_MODE_R_SAR_TM_CLK_SEL_Pos                                                14U
#define PCC_r_PMUX_TEST_MODE_R_SAR_TM_CLK_SEL_Msk                                                (0x1UL << PCC_r_PMUX_TEST_MODE_R_SAR_TM_CLK_SEL_Pos)

#define PCC_r_PMUX_TEST_MODE_R_SAR_TM_CH_SEL_Pos                                                 15U
#define PCC_r_PMUX_TEST_MODE_R_SAR_TM_CH_SEL_Msk                                                 (0x1UL << PCC_r_PMUX_TEST_MODE_R_SAR_TM_CH_SEL_Pos)

#define PCC_r_PMUX_TEST_MODE_R_OSC80M_TEST_MODE_CLK_DIV_Pos                                      16U
#define PCC_r_PMUX_TEST_MODE_R_OSC80M_TEST_MODE_CLK_DIV_Msk                                      (0x3UL << PCC_r_PMUX_TEST_MODE_R_OSC80M_TEST_MODE_CLK_DIV_Pos)

#define PCC_r_PMUX_TEST_MODE_R_PLL_TEST_MODE_CLK_DIV_Pos                                         18U
#define PCC_r_PMUX_TEST_MODE_R_PLL_TEST_MODE_CLK_DIV_Msk                                         (0x3UL << PCC_r_PMUX_TEST_MODE_R_PLL_TEST_MODE_CLK_DIV_Pos)

