rtkconnectivity/hal_realtek_mainline/bee/soc/inc/rtl87x2j/pcc_reg.h
#define PCC_r_PMUX_TEST_MODE_R_PMUX_DBG_SPIC0_Pos                                                20U
#define PCC_r_PMUX_TEST_MODE_R_PMUX_DBG_SPIC0_Msk                                                (0x1UL << PCC_r_PMUX_TEST_MODE_R_PMUX_DBG_SPIC0_Pos)

#define PCC_r_PMUX_TEST_MODE_DUMMY60_Pos                                                         21U
#define PCC_r_PMUX_TEST_MODE_DUMMY60_Msk                                                         (0x1UL << PCC_r_PMUX_TEST_MODE_DUMMY60_Pos)

#define PCC_r_PMUX_TEST_MODE_DUMMY59_Pos                                                         22U
#define PCC_r_PMUX_TEST_MODE_DUMMY59_Msk                                                         (0x1UL << PCC_r_PMUX_TEST_MODE_DUMMY59_Pos)

#define PCC_r_PMUX_TEST_MODE_R_PMUX_DIG_SMUX_EN_Pos                                              23U
#define PCC_r_PMUX_TEST_MODE_R_PMUX_DIG_SMUX_EN_Msk                                              (0x1UL << PCC_r_PMUX_TEST_MODE_R_PMUX_DIG_SMUX_EN_Pos)

#define PCC_r_PMUX_TEST_MODE_R_PON_PMUX_SPIM0_EN_Pos                                             24U
#define PCC_r_PMUX_TEST_MODE_R_PON_PMUX_SPIM0_EN_Msk                                             (0x1UL << PCC_r_PMUX_TEST_MODE_R_PON_PMUX_SPIM0_EN_Pos)

#define PCC_r_PMUX_TEST_MODE_R_PMUX_SPIM_EN_OPT_Pos                                              25U
#define PCC_r_PMUX_TEST_MODE_R_PMUX_SPIM_EN_OPT_Msk                                              (0x1UL << PCC_r_PMUX_TEST_MODE_R_PMUX_SPIM_EN_OPT_Pos)

#define PCC_r_PMUX_TEST_MODE_R_PMUX_FLASH_EXTC_EN_Pos                                            26U
#define PCC_r_PMUX_TEST_MODE_R_PMUX_FLASH_EXTC_EN_Msk                                            (0x1UL << PCC_r_PMUX_TEST_MODE_R_PMUX_FLASH_EXTC_EN_Pos)

#define PCC_r_PMUX_TEST_MODE_R_PMUX_FLASH_EN_Pos                                                 27U
#define PCC_r_PMUX_TEST_MODE_R_PMUX_FLASH_EN_Msk                                                 (0x1UL << PCC_r_PMUX_TEST_MODE_R_PMUX_FLASH_EN_Pos)

#define PCC_r_PMUX_TEST_MODE_DUMMY58_Pos                                                         28U
#define PCC_r_PMUX_TEST_MODE_DUMMY58_Msk                                                         (0x3UL << PCC_r_PMUX_TEST_MODE_DUMMY58_Pos)

#define PCC_r_PMUX_TEST_MODE_DUMMY57_Pos                                                         30U
#define PCC_r_PMUX_TEST_MODE_DUMMY57_Msk                                                         (0x1UL << PCC_r_PMUX_TEST_MODE_DUMMY57_Pos)

#define PCC_r_PMUX_TEST_MODE_DUMMY56_Pos                                                         31U
#define PCC_r_PMUX_TEST_MODE_DUMMY56_Msk                                                         (0x1UL << PCC_r_PMUX_TEST_MODE_DUMMY56_Pos)

/* 0x2F8    0x4000_02f8
    0       R/W     DET_ENABLE                                      1'b0
    1       R/W     VBUS_DET                                        1'b0
    2       R/W     SKIP_SEC_DET                                    1'b0
    3       R/W     DUMMY68                                         1'b0
    7:4     R/W     DUMMY67                                         4'h0
    8       R       SDP_0P5A                                        1'h0
    9       R       DCP_CDP_1P5A                                    1'h0
    10      R       CDP_DET                                         1'h0
    11      R       DCP_DET                                         1'h0
    12      R       OTHERS_0P5A                                     1'h0
    13      R       RSVD_4                                          1'h0
    14      R       RSVD_3                                          1'h0
    15      R       RSVD_2                                          1'h0
    16      R       DET_IS_DONE                                     1'h0
    17      R       RSVD_1                                          1'h0
    18      R       RSVD                                            1'h0
    28:19   R/W     DUMMY66                                         10'h0
    29      R/W     DCP_OPTION                                      1'h1
    30      R/W     DUMMY65                                         1'h1
    31      R/W     BYPASS_DCD_DBNC                                 1'h0
 */
typedef union _PCC_REG_BC12_CTRL1_TYPE
{
    uint32_t d32;
    struct
    {
        uint32_t DET_ENABLE: 1;
        uint32_t VBUS_DET: 1;
        uint32_t SKIP_SEC_DET: 1;
        uint32_t DUMMY68: 1;
        uint32_t DUMMY67: 4;
        uint32_t SDP_0P5A: 1;
        uint32_t DCP_CDP_1P5A: 1;
        uint32_t CDP_DET: 1;
        uint32_t DCP_DET: 1;
        uint32_t OTHERS_0P5A: 1;
        uint32_t RSVD_4: 1;
        uint32_t RSVD_3: 1;
        uint32_t RSVD_2: 1;
        uint32_t DET_IS_DONE: 1;
        uint32_t RSVD_1: 1;
        uint32_t RSVD: 1;
        uint32_t DUMMY66: 10;
        uint32_t DCP_OPTION: 1;
        uint32_t DUMMY65: 1;
        uint32_t BYPASS_DCD_DBNC: 1;
    };
} PCC_REG_BC12_CTRL1_TYPE;

/*0x4000_02f8 PCC_REG_BC12_CTRL1*/
#define PCC_REG_BC12_CTRL1_DET_ENABLE_Pos                                                        0U
#define PCC_REG_BC12_CTRL1_DET_ENABLE_Msk                                                        (0x1UL << PCC_REG_BC12_CTRL1_DET_ENABLE_Pos)

#define PCC_REG_BC12_CTRL1_VBUS_DET_Pos                                                          1U
#define PCC_REG_BC12_CTRL1_VBUS_DET_Msk                                                          (0x1UL << PCC_REG_BC12_CTRL1_VBUS_DET_Pos)

#define PCC_REG_BC12_CTRL1_SKIP_SEC_DET_Pos                                                      2U
#define PCC_REG_BC12_CTRL1_SKIP_SEC_DET_Msk                                                      (0x1UL << PCC_REG_BC12_CTRL1_SKIP_SEC_DET_Pos)

#define PCC_REG_BC12_CTRL1_DUMMY68_Pos                                                           3U
#define PCC_REG_BC12_CTRL1_DUMMY68_Msk                                                           (0x1UL << PCC_REG_BC12_CTRL1_DUMMY68_Pos)

#define PCC_REG_BC12_CTRL1_DUMMY67_Pos                                                           4U
#define PCC_REG_BC12_CTRL1_DUMMY67_Msk                                                           (0xFUL << PCC_REG_BC12_CTRL1_DUMMY67_Pos)

#define PCC_REG_BC12_CTRL1_SDP_0P5A_Pos                                                          8U
#define PCC_REG_BC12_CTRL1_SDP_0P5A_Msk                                                          (0x1UL << PCC_REG_BC12_CTRL1_SDP_0P5A_Pos)

#define PCC_REG_BC12_CTRL1_DCP_CDP_1P5A_Pos                                                      9U
#define PCC_REG_BC12_CTRL1_DCP_CDP_1P5A_Msk                                                      (0x1UL << PCC_REG_BC12_CTRL1_DCP_CDP_1P5A_Pos)

#define PCC_REG_BC12_CTRL1_CDP_DET_Pos                                                           10U
#define PCC_REG_BC12_CTRL1_CDP_DET_Msk                                                           (0x1UL << PCC_REG_BC12_CTRL1_CDP_DET_Pos)

