rtkconnectivity/hal_realtek_mainline/bee/soc/inc/rtl87x2j/pcc_reg.h
#define PCC_REG_BC12_CTRL1_DCP_DET_Pos                                                           11U
#define PCC_REG_BC12_CTRL1_DCP_DET_Msk                                                           (0x1UL << PCC_REG_BC12_CTRL1_DCP_DET_Pos)

#define PCC_REG_BC12_CTRL1_OTHERS_0P5A_Pos                                                       12U
#define PCC_REG_BC12_CTRL1_OTHERS_0P5A_Msk                                                       (0x1UL << PCC_REG_BC12_CTRL1_OTHERS_0P5A_Pos)

#define PCC_REG_BC12_CTRL1_RSVD_4_Pos                                                            13U
#define PCC_REG_BC12_CTRL1_RSVD_4_Msk                                                            (0x1UL << PCC_REG_BC12_CTRL1_RSVD_4_Pos)

#define PCC_REG_BC12_CTRL1_RSVD_3_Pos                                                            14U
#define PCC_REG_BC12_CTRL1_RSVD_3_Msk                                                            (0x1UL << PCC_REG_BC12_CTRL1_RSVD_3_Pos)

#define PCC_REG_BC12_CTRL1_RSVD_2_Pos                                                            15U
#define PCC_REG_BC12_CTRL1_RSVD_2_Msk                                                            (0x1UL << PCC_REG_BC12_CTRL1_RSVD_2_Pos)

#define PCC_REG_BC12_CTRL1_DET_IS_DONE_Pos                                                       16U
#define PCC_REG_BC12_CTRL1_DET_IS_DONE_Msk                                                       (0x1UL << PCC_REG_BC12_CTRL1_DET_IS_DONE_Pos)

#define PCC_REG_BC12_CTRL1_RSVD_1_Pos                                                            17U
#define PCC_REG_BC12_CTRL1_RSVD_1_Msk                                                            (0x1UL << PCC_REG_BC12_CTRL1_RSVD_1_Pos)

#define PCC_REG_BC12_CTRL1_RSVD_Pos                                                              18U
#define PCC_REG_BC12_CTRL1_RSVD_Msk                                                              (0x1UL << PCC_REG_BC12_CTRL1_RSVD_Pos)

#define PCC_REG_BC12_CTRL1_DUMMY66_Pos                                                           19U
#define PCC_REG_BC12_CTRL1_DUMMY66_Msk                                                           (0x3FFUL << PCC_REG_BC12_CTRL1_DUMMY66_Pos)

#define PCC_REG_BC12_CTRL1_DCP_OPTION_Pos                                                        29U
#define PCC_REG_BC12_CTRL1_DCP_OPTION_Msk                                                        (0x1UL << PCC_REG_BC12_CTRL1_DCP_OPTION_Pos)

#define PCC_REG_BC12_CTRL1_DUMMY65_Pos                                                           30U
#define PCC_REG_BC12_CTRL1_DUMMY65_Msk                                                           (0x1UL << PCC_REG_BC12_CTRL1_DUMMY65_Pos)

#define PCC_REG_BC12_CTRL1_BYPASS_DCD_DBNC_Pos                                                   31U
#define PCC_REG_BC12_CTRL1_BYPASS_DCD_DBNC_Msk                                                   (0x1UL << PCC_REG_BC12_CTRL1_BYPASS_DCD_DBNC_Pos)

/* 0x2FC    0x4000_02fc
    7:0     R/W     FW_WRITE_BUS                                    8'h0
    8       R/W     FW_CTRL_MODE                                    1'h0
    15:9    R/W     DUMMY70                                         7'h0
    19:16   R       VDP_COMP_L                                      4'h0
    20      R       VDP_LT_VLOW_L                                   1'h0
    24:21   R       VDM_COMP_L                                      4'h0
    25      R       VDM_LT_VLOW_L                                   1'h0
    31:26   R/W     DUMMY69                                         6'h0
 */
typedef union _PCC_REG_BC12_CTRL2_TYPE
{
    uint32_t d32;
    struct
    {
        uint32_t FW_WRITE_BUS: 8;
        uint32_t FW_CTRL_MODE: 1;
        uint32_t DUMMY70: 7;
        uint32_t VDP_COMP_L: 4;
        uint32_t VDP_LT_VLOW_L: 1;
        uint32_t VDM_COMP_L: 4;
        uint32_t VDM_LT_VLOW_L: 1;
        uint32_t DUMMY69: 6;
    };
} PCC_REG_BC12_CTRL2_TYPE;

/*0x4000_02fc PCC_REG_BC12_CTRL2*/
#define PCC_REG_BC12_CTRL2_FW_WRITE_BUS_Pos                                                      0U
#define PCC_REG_BC12_CTRL2_FW_WRITE_BUS_Msk                                                      (0xFFUL << PCC_REG_BC12_CTRL2_FW_WRITE_BUS_Pos)

#define PCC_REG_BC12_CTRL2_FW_CTRL_MODE_Pos                                                      8U
#define PCC_REG_BC12_CTRL2_FW_CTRL_MODE_Msk                                                      (0x1UL << PCC_REG_BC12_CTRL2_FW_CTRL_MODE_Pos)

#define PCC_REG_BC12_CTRL2_DUMMY70_Pos                                                           9U
#define PCC_REG_BC12_CTRL2_DUMMY70_Msk                                                           (0x7FUL << PCC_REG_BC12_CTRL2_DUMMY70_Pos)

#define PCC_REG_BC12_CTRL2_VDP_COMP_L_Pos                                                        16U
#define PCC_REG_BC12_CTRL2_VDP_COMP_L_Msk                                                        (0xFUL << PCC_REG_BC12_CTRL2_VDP_COMP_L_Pos)

#define PCC_REG_BC12_CTRL2_VDP_LT_VLOW_L_Pos                                                     20U
#define PCC_REG_BC12_CTRL2_VDP_LT_VLOW_L_Msk                                                     (0x1UL << PCC_REG_BC12_CTRL2_VDP_LT_VLOW_L_Pos)

#define PCC_REG_BC12_CTRL2_VDM_COMP_L_Pos                                                        21U
#define PCC_REG_BC12_CTRL2_VDM_COMP_L_Msk                                                        (0xFUL << PCC_REG_BC12_CTRL2_VDM_COMP_L_Pos)

#define PCC_REG_BC12_CTRL2_VDM_LT_VLOW_L_Pos                                                     25U
#define PCC_REG_BC12_CTRL2_VDM_LT_VLOW_L_Msk                                                     (0x1UL << PCC_REG_BC12_CTRL2_VDM_LT_VLOW_L_Pos)

#define PCC_REG_BC12_CTRL2_DUMMY69_Pos                                                           26U
#define PCC_REG_BC12_CTRL2_DUMMY69_Msk                                                           (0x3FUL << PCC_REG_BC12_CTRL2_DUMMY69_Pos)

/* 0x300    0x4000_0300
    15:0    R/W     DCD_A_MIN_TIME                                  16'h200
    31:16   R/W     DCD_B_MIN_TIME                                  16'h3E80
 */
typedef union _PCC_REG_BC12_CTRL3_TYPE
{
    uint32_t d32;
    struct
    {
        uint32_t DCD_A_MIN_TIME: 16;
        uint32_t DCD_B_MIN_TIME: 16;
    };
} PCC_REG_BC12_CTRL3_TYPE;

/*0x4000_0300 PCC_REG_BC12_CTRL3*/
#define PCC_REG_BC12_CTRL3_DCD_A_MIN_TIME_Pos                                                    0U
#define PCC_REG_BC12_CTRL3_DCD_A_MIN_TIME_Msk                                                    (0xFFFFUL << PCC_REG_BC12_CTRL3_DCD_A_MIN_TIME_Pos)

#define PCC_REG_BC12_CTRL3_DCD_B_MIN_TIME_Pos                                                    16U
#define PCC_REG_BC12_CTRL3_DCD_B_MIN_TIME_Msk                                                    (0xFFFFUL << PCC_REG_BC12_CTRL3_DCD_B_MIN_TIME_Pos)

