rtkconnectivity/hal_realtek_mainline/bee/soc/inc/rtl87x2j/pcc_reg.h
/* 0x304    0x4000_0304
    15:0    R/W     PRI_DET_MIN_TIME                                16'h500
    31:16   R/W     NOTE_DET_MIN_TIME                               16'h140
 */
typedef union _PCC_REG_BC12_CTRL4_TYPE
{
    uint32_t d32;
    struct
    {
        uint32_t PRI_DET_MIN_TIME: 16;
        uint32_t NOTE_DET_MIN_TIME: 16;
    };
} PCC_REG_BC12_CTRL4_TYPE;

/*0x4000_0304 PCC_REG_BC12_CTRL4*/
#define PCC_REG_BC12_CTRL4_PRI_DET_MIN_TIME_Pos                                                  0U
#define PCC_REG_BC12_CTRL4_PRI_DET_MIN_TIME_Msk                                                  (0xFFFFUL << PCC_REG_BC12_CTRL4_PRI_DET_MIN_TIME_Pos)

#define PCC_REG_BC12_CTRL4_NOTE_DET_MIN_TIME_Pos                                                 16U
#define PCC_REG_BC12_CTRL4_NOTE_DET_MIN_TIME_Msk                                                 (0xFFFFUL << PCC_REG_BC12_CTRL4_NOTE_DET_MIN_TIME_Pos)

/* 0x308    0x4000_0308
    15:0    R/W     WAIT_A_MIN_TIME                                 16'h280
    31:16   R/W     SECOND_DET_MIN_TIME                             16'h540
 */
typedef union _PCC_REG_BC12_CTRL5_TYPE
{
    uint32_t d32;
    struct
    {
        uint32_t WAIT_A_MIN_TIME: 16;
        uint32_t SECOND_DET_MIN_TIME: 16;
    };
} PCC_REG_BC12_CTRL5_TYPE;

/*0x4000_0308 PCC_REG_BC12_CTRL5*/
#define PCC_REG_BC12_CTRL5_WAIT_A_MIN_TIME_Pos                                                   0U
#define PCC_REG_BC12_CTRL5_WAIT_A_MIN_TIME_Msk                                                   (0xFFFFUL << PCC_REG_BC12_CTRL5_WAIT_A_MIN_TIME_Pos)

#define PCC_REG_BC12_CTRL5_SECOND_DET_MIN_TIME_Pos                                               16U
#define PCC_REG_BC12_CTRL5_SECOND_DET_MIN_TIME_Msk                                               (0xFFFFUL << PCC_REG_BC12_CTRL5_SECOND_DET_MIN_TIME_Pos)

/* 0x30C    0x4000_030c
    15:0    R/W     SA_DET_MIN_TIME                                 16'h140
    31:16   R/W     DUMMY71                                         16'h0
 */
typedef union _PCC_REG_BC12_CTRL6_TYPE
{
    uint32_t d32;
    struct
    {
        uint32_t SA_DET_MIN_TIME: 16;
        uint32_t DUMMY71: 16;
    };
} PCC_REG_BC12_CTRL6_TYPE;

/*0x4000_030c PCC_REG_BC12_CTRL6*/
#define PCC_REG_BC12_CTRL6_SA_DET_MIN_TIME_Pos                                                   0U
#define PCC_REG_BC12_CTRL6_SA_DET_MIN_TIME_Msk                                                   (0xFFFFUL << PCC_REG_BC12_CTRL6_SA_DET_MIN_TIME_Pos)

#define PCC_REG_BC12_CTRL6_DUMMY71_Pos                                                           16U
#define PCC_REG_BC12_CTRL6_DUMMY71_Msk                                                           (0xFFFFUL << PCC_REG_BC12_CTRL6_DUMMY71_Pos)

/* 0x310    0x4000_0310
    3:0     R/W     R_PMUX_DBG_MODE_SEL_G0                          4'h0
    7:4     R/W     R_PMUX_DBG_MODE_SEL_G1                          4'h0
    11:8    R/W     R_PMUX_DBG_MODE_SEL_G2                          4'h0
    15:12   R/W     R_PMUX_DBG_MODE_SEL_G3                          4'h0
    17:16   R/W     R_DBG_MUX_SEC_SEL_G0                            2'h0
    19:18   R/W     R_DBG_MUX_SEC_SEL_G1                            2'h0
    21:20   R/W     R_DBG_MUX_SEC_SEL_G2                            2'h0
    23:22   R/W     R_DBG_MUX_SEC_SEL_G3                            2'h0
    31:24   R       RSVD                                            8'h00
 */
typedef union _PCC_REG_DBG_MUX_CTRL_TYPE
{
    uint32_t d32;
    struct
    {
        uint32_t R_PMUX_DBG_MODE_SEL_G0: 4;
        uint32_t R_PMUX_DBG_MODE_SEL_G1: 4;
        uint32_t R_PMUX_DBG_MODE_SEL_G2: 4;
        uint32_t R_PMUX_DBG_MODE_SEL_G3: 4;
        uint32_t R_DBG_MUX_SEC_SEL_G0: 2;
        uint32_t R_DBG_MUX_SEC_SEL_G1: 2;
        uint32_t R_DBG_MUX_SEC_SEL_G2: 2;
        uint32_t R_DBG_MUX_SEC_SEL_G3: 2;
        uint32_t RSVD: 8;
    };
} PCC_REG_DBG_MUX_CTRL_TYPE;

/*0x4000_0310 PCC_REG_DBG_MUX_CTRL*/
#define PCC_REG_DBG_MUX_CTRL_R_PMUX_DBG_MODE_SEL_G0_Pos                                          0U
#define PCC_REG_DBG_MUX_CTRL_R_PMUX_DBG_MODE_SEL_G0_Msk                                          (0xFUL << PCC_REG_DBG_MUX_CTRL_R_PMUX_DBG_MODE_SEL_G0_Pos)

#define PCC_REG_DBG_MUX_CTRL_R_PMUX_DBG_MODE_SEL_G1_Pos                                          4U
#define PCC_REG_DBG_MUX_CTRL_R_PMUX_DBG_MODE_SEL_G1_Msk                                          (0xFUL << PCC_REG_DBG_MUX_CTRL_R_PMUX_DBG_MODE_SEL_G1_Pos)

#define PCC_REG_DBG_MUX_CTRL_R_PMUX_DBG_MODE_SEL_G2_Pos                                          8U
#define PCC_REG_DBG_MUX_CTRL_R_PMUX_DBG_MODE_SEL_G2_Msk                                          (0xFUL << PCC_REG_DBG_MUX_CTRL_R_PMUX_DBG_MODE_SEL_G2_Pos)

#define PCC_REG_DBG_MUX_CTRL_R_PMUX_DBG_MODE_SEL_G3_Pos                                          12U
#define PCC_REG_DBG_MUX_CTRL_R_PMUX_DBG_MODE_SEL_G3_Msk                                          (0xFUL << PCC_REG_DBG_MUX_CTRL_R_PMUX_DBG_MODE_SEL_G3_Pos)

#define PCC_REG_DBG_MUX_CTRL_R_DBG_MUX_SEC_SEL_G0_Pos                                            16U
#define PCC_REG_DBG_MUX_CTRL_R_DBG_MUX_SEC_SEL_G0_Msk                                            (0x3UL << PCC_REG_DBG_MUX_CTRL_R_DBG_MUX_SEC_SEL_G0_Pos)

#define PCC_REG_DBG_MUX_CTRL_R_DBG_MUX_SEC_SEL_G1_Pos                                            18U
#define PCC_REG_DBG_MUX_CTRL_R_DBG_MUX_SEC_SEL_G1_Msk                                            (0x3UL << PCC_REG_DBG_MUX_CTRL_R_DBG_MUX_SEC_SEL_G1_Pos)

#define PCC_REG_DBG_MUX_CTRL_R_DBG_MUX_SEC_SEL_G2_Pos                                            20U
#define PCC_REG_DBG_MUX_CTRL_R_DBG_MUX_SEC_SEL_G2_Msk                                            (0x3UL << PCC_REG_DBG_MUX_CTRL_R_DBG_MUX_SEC_SEL_G2_Pos)

#define PCC_REG_DBG_MUX_CTRL_R_DBG_MUX_SEC_SEL_G3_Pos                                            22U
#define PCC_REG_DBG_MUX_CTRL_R_DBG_MUX_SEC_SEL_G3_Msk                                            (0x3UL << PCC_REG_DBG_MUX_CTRL_R_DBG_MUX_SEC_SEL_G3_Pos)

#define PCC_REG_DBG_MUX_CTRL_RSVD_Pos                                                            24U
#define PCC_REG_DBG_MUX_CTRL_RSVD_Msk                                                            (0xFFUL << PCC_REG_DBG_MUX_CTRL_RSVD_Pos)

/* 0x314    0x4000_0314
    31:0    R       RSVD                                            32'hEAEAEAEA
 */
typedef union _PCC_REG_RSVD_2D8_TYPE
{
    uint32_t d32;
    struct
    {
        uint32_t RSVD;
    };
} PCC_REG_RSVD_2D8_TYPE;

/*0x4000_0314 PCC_REG_RSVD_2D8*/
#define PCC_REG_RSVD_2D8_RSVD_Pos                                                                0U
#define PCC_REG_RSVD_2D8_RSVD_Msk                                                                (0xFFFFFFFFUL << PCC_REG_RSVD_2D8_RSVD_Pos)

/* 0x318    0x4000_0318
    2:0     R/W     RF_0_REMAP_TABLE                                3'b000
    3       R       RSVD_4                                          1'b0
    6:4     R/W     RF_4_REMAP_TABLE                                3'b000
    7       R       RSVD_3                                          1'b0
    10:8    R/W     RF_5_REMAP_TABLE                                3'b001
    11      R       RSVD_2                                          1'b0
    14:12   R/W     RF_6_REMAP_TABLE                                3'b000
    15      R       RSVD_1                                          1'b0
    18:16   R/W     RF_7_REMAP_TABLE                                3'b010
    30:19   R       RSVD                                            12'b000001100000
    31      R/W     AUTO_SWITCH_UPDATE                              1'b0
 */
typedef union _PCC_REG_SWITCH_PAR_TYPE
{
    uint32_t d32;
    struct
    {
        uint32_t RF_0_REMAP_TABLE: 3;
        uint32_t RSVD_4: 1;
        uint32_t RF_4_REMAP_TABLE: 3;
        uint32_t RSVD_3: 1;
        uint32_t RF_5_REMAP_TABLE: 3;
        uint32_t RSVD_2: 1;
        uint32_t RF_6_REMAP_TABLE: 3;
        uint32_t RSVD_1: 1;
        uint32_t RF_7_REMAP_TABLE: 3;
        uint32_t RSVD: 12;
        uint32_t AUTO_SWITCH_UPDATE: 1;
    };
} PCC_REG_SWITCH_PAR_TYPE;

/*0x4000_0318 PCC_REG_SWITCH_PAR*/
#define PCC_REG_SWITCH_PAR_RF_0_REMAP_TABLE_Pos                                                  0U
#define PCC_REG_SWITCH_PAR_RF_0_REMAP_TABLE_Msk                                                  (0x7UL << PCC_REG_SWITCH_PAR_RF_0_REMAP_TABLE_Pos)

#define PCC_REG_SWITCH_PAR_RSVD_4_Pos                                                            3U
#define PCC_REG_SWITCH_PAR_RSVD_4_Msk                                                            (0x1UL << PCC_REG_SWITCH_PAR_RSVD_4_Pos)

#define PCC_REG_SWITCH_PAR_RF_4_REMAP_TABLE_Pos                                                  4U
#define PCC_REG_SWITCH_PAR_RF_4_REMAP_TABLE_Msk                                                  (0x7UL << PCC_REG_SWITCH_PAR_RF_4_REMAP_TABLE_Pos)

