rtkconnectivity/hal_realtek_mainline/bee/soc/inc/rtl87x2j/pcc_reg.h
#define PCC_REG_SWITCH_PAR_RSVD_3_Pos                                                            7U
#define PCC_REG_SWITCH_PAR_RSVD_3_Msk                                                            (0x1UL << PCC_REG_SWITCH_PAR_RSVD_3_Pos)

#define PCC_REG_SWITCH_PAR_RF_5_REMAP_TABLE_Pos                                                  8U
#define PCC_REG_SWITCH_PAR_RF_5_REMAP_TABLE_Msk                                                  (0x7UL << PCC_REG_SWITCH_PAR_RF_5_REMAP_TABLE_Pos)

#define PCC_REG_SWITCH_PAR_RSVD_2_Pos                                                            11U
#define PCC_REG_SWITCH_PAR_RSVD_2_Msk                                                            (0x1UL << PCC_REG_SWITCH_PAR_RSVD_2_Pos)

#define PCC_REG_SWITCH_PAR_RF_6_REMAP_TABLE_Pos                                                  12U
#define PCC_REG_SWITCH_PAR_RF_6_REMAP_TABLE_Msk                                                  (0x7UL << PCC_REG_SWITCH_PAR_RF_6_REMAP_TABLE_Pos)

#define PCC_REG_SWITCH_PAR_RSVD_1_Pos                                                            15U
#define PCC_REG_SWITCH_PAR_RSVD_1_Msk                                                            (0x1UL << PCC_REG_SWITCH_PAR_RSVD_1_Pos)

#define PCC_REG_SWITCH_PAR_RF_7_REMAP_TABLE_Pos                                                  16U
#define PCC_REG_SWITCH_PAR_RF_7_REMAP_TABLE_Msk                                                  (0x7UL << PCC_REG_SWITCH_PAR_RF_7_REMAP_TABLE_Pos)

#define PCC_REG_SWITCH_PAR_RSVD_Pos                                                              19U
#define PCC_REG_SWITCH_PAR_RSVD_Msk                                                              (0xFFFUL << PCC_REG_SWITCH_PAR_RSVD_Pos)

#define PCC_REG_SWITCH_PAR_AUTO_SWITCH_UPDATE_Pos                                                31U
#define PCC_REG_SWITCH_PAR_AUTO_SWITCH_UPDATE_Msk                                                (0x1UL << PCC_REG_SWITCH_PAR_AUTO_SWITCH_UPDATE_Pos)

/* 0x31C    0x4000_031c
    31:0    R/W     R_PMUX_DIGI_DBG_REG                             32'h0
 */
typedef union _PCC_REG_PINMUX_DBG_REG_TYPE
{
    uint32_t d32;
    struct
    {
        uint32_t R_PMUX_DIGI_DBG_REG;
    };
} PCC_REG_PINMUX_DBG_REG_TYPE;

/*0x4000_031c PCC_REG_PINMUX_DBG_REG*/
#define PCC_REG_PINMUX_DBG_REG_R_PMUX_DIGI_DBG_REG_Pos                                           0U
#define PCC_REG_PINMUX_DBG_REG_R_PMUX_DIGI_DBG_REG_Msk                                           (0xFFFFFFFFUL << PCC_REG_PINMUX_DBG_REG_R_PMUX_DIGI_DBG_REG_Pos)

/* 0x320    0x4000_0320
    15:0    R/W     DUMMY73                                         15'h0
    24:16   R       RSVD_1                                          10'h0
    25      R/W     RSVD                                            1'b0
    31:26   R/W     LDOPA_VOUT_SW_VOUT_TUNE                         6'b000101
 */
typedef union _PCC_LDO_PA_SWR_AUTO_SW_TYPE
{
    uint32_t d32;
    struct
    {
        uint32_t DUMMY73: 16;
        uint32_t RSVD_1: 9;
        uint32_t RSVD: 1;
        uint32_t LDOPA_VOUT_SW_VOUT_TUNE: 6;
    };
} PCC_LDO_PA_SWR_AUTO_SW_TYPE;

/*0x4000_0320 PCC_LDO_PA_SWR_AUTO_SW*/
#define PCC_LDO_PA_SWR_AUTO_SW_DUMMY73_Pos                                                       0U
#define PCC_LDO_PA_SWR_AUTO_SW_DUMMY73_Msk                                                       (0xFFFFUL << PCC_LDO_PA_SWR_AUTO_SW_DUMMY73_Pos)

#define PCC_LDO_PA_SWR_AUTO_SW_RSVD_1_Pos                                                        16U
#define PCC_LDO_PA_SWR_AUTO_SW_RSVD_1_Msk                                                        (0x1FFUL << PCC_LDO_PA_SWR_AUTO_SW_RSVD_1_Pos)

#define PCC_LDO_PA_SWR_AUTO_SW_RSVD_Pos                                                          25U
#define PCC_LDO_PA_SWR_AUTO_SW_RSVD_Msk                                                          (0x1UL << PCC_LDO_PA_SWR_AUTO_SW_RSVD_Pos)

#define PCC_LDO_PA_SWR_AUTO_SW_LDOPA_VOUT_SW_VOUT_TUNE_Pos                                       26U
#define PCC_LDO_PA_SWR_AUTO_SW_LDOPA_VOUT_SW_VOUT_TUNE_Msk                                       (0x3FUL << PCC_LDO_PA_SWR_AUTO_SW_LDOPA_VOUT_SW_VOUT_TUNE_Pos)

/* 0x324    0x4000_0324
    7:0     R/W     TUNE_VDDCORE_0                                  8'b01100010
    12:8    R/W     TON2_TUNE_0                                     5'b01000
    17:13   R/W     TON1_TUNE_0                                     5'b01000
    18      R/W     RESERVED                                        1'b1
    23:19   R/W     LDO_TUNE_LDOANA_0                               5'b00101
    31:24   R/W     TUNE_VDDPA_0                                    8'b00100010
 */
typedef union _PCC_CORE_SWR_PAR_TAB_0_0_TYPE
{
    uint32_t d32;
    struct
    {
        uint32_t TUNE_VDDCORE_0: 8;
        uint32_t TON2_TUNE_0: 5;
        uint32_t TON1_TUNE_0: 5;
        uint32_t RESERVED: 1;
        uint32_t LDO_TUNE_LDOANA_0: 5;
        uint32_t TUNE_VDDPA_0: 8;
    };
} PCC_CORE_SWR_PAR_TAB_0_0_TYPE;

/*0x4000_0324 PCC_CORE_SWR_PAR_TAB_0_0*/
#define PCC_CORE_SWR_PAR_TAB_0_0_TUNE_VDDCORE_0_Pos                                              0U
#define PCC_CORE_SWR_PAR_TAB_0_0_TUNE_VDDCORE_0_Msk                                              (0xFFUL << PCC_CORE_SWR_PAR_TAB_0_0_TUNE_VDDCORE_0_Pos)

#define PCC_CORE_SWR_PAR_TAB_0_0_TON2_TUNE_0_Pos                                                 8U
#define PCC_CORE_SWR_PAR_TAB_0_0_TON2_TUNE_0_Msk                                                 (0x1FUL << PCC_CORE_SWR_PAR_TAB_0_0_TON2_TUNE_0_Pos)

#define PCC_CORE_SWR_PAR_TAB_0_0_TON1_TUNE_0_Pos                                                 13U
#define PCC_CORE_SWR_PAR_TAB_0_0_TON1_TUNE_0_Msk                                                 (0x1FUL << PCC_CORE_SWR_PAR_TAB_0_0_TON1_TUNE_0_Pos)

#define PCC_CORE_SWR_PAR_TAB_0_0_RESERVED_Pos                                                    18U
#define PCC_CORE_SWR_PAR_TAB_0_0_RESERVED_Msk                                                    (0x1UL << PCC_CORE_SWR_PAR_TAB_0_0_RESERVED_Pos)

#define PCC_CORE_SWR_PAR_TAB_0_0_LDO_TUNE_LDOANA_0_Pos                                           19U
#define PCC_CORE_SWR_PAR_TAB_0_0_LDO_TUNE_LDOANA_0_Msk                                           (0x1FUL << PCC_CORE_SWR_PAR_TAB_0_0_LDO_TUNE_LDOANA_0_Pos)

