rtkconnectivity/hal_realtek_mainline/bee/soc/inc/rtl87x2j/pcc_reg.h
#define PCC_CORE_SWR_PAR_TAB_0_0_TUNE_VDDPA_0_Pos                                                24U
#define PCC_CORE_SWR_PAR_TAB_0_0_TUNE_VDDPA_0_Msk                                                (0xFFUL << PCC_CORE_SWR_PAR_TAB_0_0_TUNE_VDDPA_0_Pos)

/* 0x328    0x4000_0328
    7:0     R/W     TUNE_VDDCORE_4                                  8'b01100010
    12:8    R/W     TON2_TUNE_4                                     5'b01000
    17:13   R/W     TON1_TUNE_4                                     5'b01000
    18      R/W     RESERVED                                        1'b1
    23:19   R/W     LDO_TUNE_LDOANA_4                               5'b00101
    31:24   R/W     TUNE_VDDPA_4                                    8'b01111010
 */
typedef union _PCC_CORE_SWR_PAR_TAB_4_0_TYPE
{
    uint32_t d32;
    struct
    {
        uint32_t TUNE_VDDCORE_4: 8;
        uint32_t TON2_TUNE_4: 5;
        uint32_t TON1_TUNE_4: 5;
        uint32_t RESERVED: 1;
        uint32_t LDO_TUNE_LDOANA_4: 5;
        uint32_t TUNE_VDDPA_4: 8;
    };
} PCC_CORE_SWR_PAR_TAB_4_0_TYPE;

/*0x4000_0328 PCC_CORE_SWR_PAR_TAB_4_0*/
#define PCC_CORE_SWR_PAR_TAB_4_0_TUNE_VDDCORE_4_Pos                                              0U
#define PCC_CORE_SWR_PAR_TAB_4_0_TUNE_VDDCORE_4_Msk                                              (0xFFUL << PCC_CORE_SWR_PAR_TAB_4_0_TUNE_VDDCORE_4_Pos)

#define PCC_CORE_SWR_PAR_TAB_4_0_TON2_TUNE_4_Pos                                                 8U
#define PCC_CORE_SWR_PAR_TAB_4_0_TON2_TUNE_4_Msk                                                 (0x1FUL << PCC_CORE_SWR_PAR_TAB_4_0_TON2_TUNE_4_Pos)

#define PCC_CORE_SWR_PAR_TAB_4_0_TON1_TUNE_4_Pos                                                 13U
#define PCC_CORE_SWR_PAR_TAB_4_0_TON1_TUNE_4_Msk                                                 (0x1FUL << PCC_CORE_SWR_PAR_TAB_4_0_TON1_TUNE_4_Pos)

#define PCC_CORE_SWR_PAR_TAB_4_0_RESERVED_Pos                                                    18U
#define PCC_CORE_SWR_PAR_TAB_4_0_RESERVED_Msk                                                    (0x1UL << PCC_CORE_SWR_PAR_TAB_4_0_RESERVED_Pos)

#define PCC_CORE_SWR_PAR_TAB_4_0_LDO_TUNE_LDOANA_4_Pos                                           19U
#define PCC_CORE_SWR_PAR_TAB_4_0_LDO_TUNE_LDOANA_4_Msk                                           (0x1FUL << PCC_CORE_SWR_PAR_TAB_4_0_LDO_TUNE_LDOANA_4_Pos)

#define PCC_CORE_SWR_PAR_TAB_4_0_TUNE_VDDPA_4_Pos                                                24U
#define PCC_CORE_SWR_PAR_TAB_4_0_TUNE_VDDPA_4_Msk                                                (0xFFUL << PCC_CORE_SWR_PAR_TAB_4_0_TUNE_VDDPA_4_Pos)

/* 0x32C    0x4000_032c
    7:0     R/W     TUNE_VDDCORE_5                                  8'b01100010
    12:8    R/W     TON2_TUNE_5                                     5'b01000
    17:13   R/W     TON1_TUNE_5                                     5'b01000
    18      R/W     RESERVED                                        1'b1
    23:19   R/W     LDO_TUNE_LDOANA_5                               5'b00101
    31:24   R/W     TUNE_VDDPA_5                                    8'b01111010
 */
typedef union _PCC_CORE_SWR_PAR_TAB_5_0_TYPE
{
    uint32_t d32;
    struct
    {
        uint32_t TUNE_VDDCORE_5: 8;
        uint32_t TON2_TUNE_5: 5;
        uint32_t TON1_TUNE_5: 5;
        uint32_t RESERVED: 1;
        uint32_t LDO_TUNE_LDOANA_5: 5;
        uint32_t TUNE_VDDPA_5: 8;
    };
} PCC_CORE_SWR_PAR_TAB_5_0_TYPE;

/*0x4000_032c PCC_CORE_SWR_PAR_TAB_5_0*/
#define PCC_CORE_SWR_PAR_TAB_5_0_TUNE_VDDCORE_5_Pos                                              0U
#define PCC_CORE_SWR_PAR_TAB_5_0_TUNE_VDDCORE_5_Msk                                              (0xFFUL << PCC_CORE_SWR_PAR_TAB_5_0_TUNE_VDDCORE_5_Pos)

#define PCC_CORE_SWR_PAR_TAB_5_0_TON2_TUNE_5_Pos                                                 8U
#define PCC_CORE_SWR_PAR_TAB_5_0_TON2_TUNE_5_Msk                                                 (0x1FUL << PCC_CORE_SWR_PAR_TAB_5_0_TON2_TUNE_5_Pos)

#define PCC_CORE_SWR_PAR_TAB_5_0_TON1_TUNE_5_Pos                                                 13U
#define PCC_CORE_SWR_PAR_TAB_5_0_TON1_TUNE_5_Msk                                                 (0x1FUL << PCC_CORE_SWR_PAR_TAB_5_0_TON1_TUNE_5_Pos)

#define PCC_CORE_SWR_PAR_TAB_5_0_RESERVED_Pos                                                    18U
#define PCC_CORE_SWR_PAR_TAB_5_0_RESERVED_Msk                                                    (0x1UL << PCC_CORE_SWR_PAR_TAB_5_0_RESERVED_Pos)

#define PCC_CORE_SWR_PAR_TAB_5_0_LDO_TUNE_LDOANA_5_Pos                                           19U
#define PCC_CORE_SWR_PAR_TAB_5_0_LDO_TUNE_LDOANA_5_Msk                                           (0x1FUL << PCC_CORE_SWR_PAR_TAB_5_0_LDO_TUNE_LDOANA_5_Pos)

#define PCC_CORE_SWR_PAR_TAB_5_0_TUNE_VDDPA_5_Pos                                                24U
#define PCC_CORE_SWR_PAR_TAB_5_0_TUNE_VDDPA_5_Msk                                                (0xFFUL << PCC_CORE_SWR_PAR_TAB_5_0_TUNE_VDDPA_5_Pos)

/* 0x330    0x4000_0330
    7:0     R/W     TUNE_VDDCORE_6                                  8'b01100010
    12:8    R/W     TON2_TUNE_6                                     5'b01000
    17:13   R/W     TON1_TUNE_6                                     5'b01000
    18      R/W     RESERVED                                        1'b1
    23:19   R/W     LDO_TUNE_LDOANA_6                               5'b00101
    31:24   R/W     TUNE_VDDPA_6                                    8'b01111010
 */
typedef union _PCC_CORE_SWR_PAR_TAB_6_0_TYPE
{
    uint32_t d32;
    struct
    {
        uint32_t TUNE_VDDCORE_6: 8;
        uint32_t TON2_TUNE_6: 5;
        uint32_t TON1_TUNE_6: 5;
        uint32_t RESERVED: 1;
        uint32_t LDO_TUNE_LDOANA_6: 5;
        uint32_t TUNE_VDDPA_6: 8;
    };
} PCC_CORE_SWR_PAR_TAB_6_0_TYPE;

/*0x4000_0330 PCC_CORE_SWR_PAR_TAB_6_0*/
#define PCC_CORE_SWR_PAR_TAB_6_0_TUNE_VDDCORE_6_Pos                                              0U
#define PCC_CORE_SWR_PAR_TAB_6_0_TUNE_VDDCORE_6_Msk                                              (0xFFUL << PCC_CORE_SWR_PAR_TAB_6_0_TUNE_VDDCORE_6_Pos)

#define PCC_CORE_SWR_PAR_TAB_6_0_TON2_TUNE_6_Pos                                                 8U
#define PCC_CORE_SWR_PAR_TAB_6_0_TON2_TUNE_6_Msk                                                 (0x1FUL << PCC_CORE_SWR_PAR_TAB_6_0_TON2_TUNE_6_Pos)

#define PCC_CORE_SWR_PAR_TAB_6_0_TON1_TUNE_6_Pos                                                 13U
#define PCC_CORE_SWR_PAR_TAB_6_0_TON1_TUNE_6_Msk                                                 (0x1FUL << PCC_CORE_SWR_PAR_TAB_6_0_TON1_TUNE_6_Pos)

#define PCC_CORE_SWR_PAR_TAB_6_0_RESERVED_Pos                                                    18U
#define PCC_CORE_SWR_PAR_TAB_6_0_RESERVED_Msk                                                    (0x1UL << PCC_CORE_SWR_PAR_TAB_6_0_RESERVED_Pos)

#define PCC_CORE_SWR_PAR_TAB_6_0_LDO_TUNE_LDOANA_6_Pos                                           19U
#define PCC_CORE_SWR_PAR_TAB_6_0_LDO_TUNE_LDOANA_6_Msk                                           (0x1FUL << PCC_CORE_SWR_PAR_TAB_6_0_LDO_TUNE_LDOANA_6_Pos)

#define PCC_CORE_SWR_PAR_TAB_6_0_TUNE_VDDPA_6_Pos                                                24U
#define PCC_CORE_SWR_PAR_TAB_6_0_TUNE_VDDPA_6_Msk                                                (0xFFUL << PCC_CORE_SWR_PAR_TAB_6_0_TUNE_VDDPA_6_Pos)

/* 0x334    0x4000_0334
    7:0     R/W     TUNE_VDDCORE_7                                  8'b01100010
    12:8    R/W     TON2_TUNE_7                                     5'b01000
    17:13   R/W     TON1_TUNE_7                                     5'b01000
    18      R/W     RESERVED                                        1'b1
    23:19   R/W     LDO_TUNE_LDOANA_7                               5'b00101
    31:24   R/W     TUNE_VDDPA_7                                    8'b01111010
 */
typedef union _PCC_CORE_SWR_PAR_TAB_7_0_TYPE
{
    uint32_t d32;
    struct
    {
        uint32_t TUNE_VDDCORE_7: 8;
        uint32_t TON2_TUNE_7: 5;
        uint32_t TON1_TUNE_7: 5;
        uint32_t RESERVED: 1;
        uint32_t LDO_TUNE_LDOANA_7: 5;
        uint32_t TUNE_VDDPA_7: 8;
    };
} PCC_CORE_SWR_PAR_TAB_7_0_TYPE;

/*0x4000_0334 PCC_CORE_SWR_PAR_TAB_7_0*/
#define PCC_CORE_SWR_PAR_TAB_7_0_TUNE_VDDCORE_7_Pos                                              0U
#define PCC_CORE_SWR_PAR_TAB_7_0_TUNE_VDDCORE_7_Msk                                              (0xFFUL << PCC_CORE_SWR_PAR_TAB_7_0_TUNE_VDDCORE_7_Pos)

#define PCC_CORE_SWR_PAR_TAB_7_0_TON2_TUNE_7_Pos                                                 8U
#define PCC_CORE_SWR_PAR_TAB_7_0_TON2_TUNE_7_Msk                                                 (0x1FUL << PCC_CORE_SWR_PAR_TAB_7_0_TON2_TUNE_7_Pos)

#define PCC_CORE_SWR_PAR_TAB_7_0_TON1_TUNE_7_Pos                                                 13U
#define PCC_CORE_SWR_PAR_TAB_7_0_TON1_TUNE_7_Msk                                                 (0x1FUL << PCC_CORE_SWR_PAR_TAB_7_0_TON1_TUNE_7_Pos)

#define PCC_CORE_SWR_PAR_TAB_7_0_RESERVED_Pos                                                    18U
#define PCC_CORE_SWR_PAR_TAB_7_0_RESERVED_Msk                                                    (0x1UL << PCC_CORE_SWR_PAR_TAB_7_0_RESERVED_Pos)

#define PCC_CORE_SWR_PAR_TAB_7_0_LDO_TUNE_LDOANA_7_Pos                                           19U
#define PCC_CORE_SWR_PAR_TAB_7_0_LDO_TUNE_LDOANA_7_Msk                                           (0x1FUL << PCC_CORE_SWR_PAR_TAB_7_0_LDO_TUNE_LDOANA_7_Pos)

#define PCC_CORE_SWR_PAR_TAB_7_0_TUNE_VDDPA_7_Pos                                                24U
#define PCC_CORE_SWR_PAR_TAB_7_0_TUNE_VDDPA_7_Msk                                                (0xFFUL << PCC_CORE_SWR_PAR_TAB_7_0_TUNE_VDDPA_7_Pos)

