rtkconnectivity/hal_realtek_mainline/bee/soc/inc/rtl87x2j/pcc_reg.h
/* 0x338    0x4000_0338
    5:0     R/W     CORE_SWR_PAR_TAB_7                              6'h0
    11:6    R/W     CORE_SWR_PAR_TAB_6                              6'h0
    17:12   R/W     CORE_SWR_PAR_TAB_5                              6'h0
    23:18   R/W     CORE_SWR_PAR_TAB_4                              6'h0
    29:24   R/W     CORE_SWR_PAR_TAB_0                              6'h0
    31:30   R/W     DUMMY74                                         2'b00
 */
typedef union _PCC_REG_CORE_PAR_TYPE
{
    uint32_t d32;
    struct
    {
        uint32_t CORE_SWR_PAR_TAB_7: 6;
        uint32_t CORE_SWR_PAR_TAB_6: 6;
        uint32_t CORE_SWR_PAR_TAB_5: 6;
        uint32_t CORE_SWR_PAR_TAB_4: 6;
        uint32_t CORE_SWR_PAR_TAB_0: 6;
        uint32_t DUMMY74: 2;
    };
} PCC_REG_CORE_PAR_TYPE;

/*0x4000_0338 PCC_REG_CORE_PAR*/
#define PCC_REG_CORE_PAR_CORE_SWR_PAR_TAB_7_Pos                                                  0U
#define PCC_REG_CORE_PAR_CORE_SWR_PAR_TAB_7_Msk                                                  (0x3FUL << PCC_REG_CORE_PAR_CORE_SWR_PAR_TAB_7_Pos)

#define PCC_REG_CORE_PAR_CORE_SWR_PAR_TAB_6_Pos                                                  6U
#define PCC_REG_CORE_PAR_CORE_SWR_PAR_TAB_6_Msk                                                  (0x3FUL << PCC_REG_CORE_PAR_CORE_SWR_PAR_TAB_6_Pos)

#define PCC_REG_CORE_PAR_CORE_SWR_PAR_TAB_5_Pos                                                  12U
#define PCC_REG_CORE_PAR_CORE_SWR_PAR_TAB_5_Msk                                                  (0x3FUL << PCC_REG_CORE_PAR_CORE_SWR_PAR_TAB_5_Pos)

#define PCC_REG_CORE_PAR_CORE_SWR_PAR_TAB_4_Pos                                                  18U
#define PCC_REG_CORE_PAR_CORE_SWR_PAR_TAB_4_Msk                                                  (0x3FUL << PCC_REG_CORE_PAR_CORE_SWR_PAR_TAB_4_Pos)

#define PCC_REG_CORE_PAR_CORE_SWR_PAR_TAB_0_Pos                                                  24U
#define PCC_REG_CORE_PAR_CORE_SWR_PAR_TAB_0_Msk                                                  (0x3FUL << PCC_REG_CORE_PAR_CORE_SWR_PAR_TAB_0_Pos)

#define PCC_REG_CORE_PAR_DUMMY74_Pos                                                             30U
#define PCC_REG_CORE_PAR_DUMMY74_Msk                                                             (0x3UL << PCC_REG_CORE_PAR_DUMMY74_Pos)

/* 0x33C    0x4000_033c
    7:0     R/W     PON_PERI_DLYSEL_CTRL                            8'h0
    15:8    R/W     DUMMY79                                         8'h0
    23:16   R/W     DUMMY78                                         8'h0
    24      R/W     R_FLASH0_CLK_INV_EN                             0
    25      R/W     DUMMY77                                         0
    26      R/W     DUMMY76                                         0
    30:27   R/W     DUMMY75                                         4'h0
    31      R/W     R_SPIC2_DMA_TX_REQ_AS_SINGLE                    0
 */
typedef union _PCC_PON_PERI_DLYSEL_CTRL_TYPE
{
    uint32_t d32;
    struct
    {
        uint32_t PON_PERI_DLYSEL_CTRL: 8;
        uint32_t DUMMY79: 8;
        uint32_t DUMMY78: 8;
        uint32_t R_FLASH0_CLK_INV_EN: 1;
        uint32_t DUMMY77: 1;
        uint32_t DUMMY76: 1;
        uint32_t DUMMY75: 4;
        uint32_t R_SPIC2_DMA_TX_REQ_AS_SINGLE: 1;
    };
} PCC_PON_PERI_DLYSEL_CTRL_TYPE;

/*0x4000_033c PCC_PON_PERI_DLYSEL_CTRL*/
#define PCC_PON_PERI_DLYSEL_CTRL_PON_PERI_DLYSEL_CTRL_Pos                                        0U
#define PCC_PON_PERI_DLYSEL_CTRL_PON_PERI_DLYSEL_CTRL_Msk                                        (0xFFUL << PCC_PON_PERI_DLYSEL_CTRL_PON_PERI_DLYSEL_CTRL_Pos)

#define PCC_PON_PERI_DLYSEL_CTRL_DUMMY79_Pos                                                     8U
#define PCC_PON_PERI_DLYSEL_CTRL_DUMMY79_Msk                                                     (0xFFUL << PCC_PON_PERI_DLYSEL_CTRL_DUMMY79_Pos)

#define PCC_PON_PERI_DLYSEL_CTRL_DUMMY78_Pos                                                     16U
#define PCC_PON_PERI_DLYSEL_CTRL_DUMMY78_Msk                                                     (0xFFUL << PCC_PON_PERI_DLYSEL_CTRL_DUMMY78_Pos)

#define PCC_PON_PERI_DLYSEL_CTRL_R_FLASH0_CLK_INV_EN_Pos                                         24U
#define PCC_PON_PERI_DLYSEL_CTRL_R_FLASH0_CLK_INV_EN_Msk                                         (0x1UL << PCC_PON_PERI_DLYSEL_CTRL_R_FLASH0_CLK_INV_EN_Pos)

#define PCC_PON_PERI_DLYSEL_CTRL_DUMMY77_Pos                                                     25U
#define PCC_PON_PERI_DLYSEL_CTRL_DUMMY77_Msk                                                     (0x1UL << PCC_PON_PERI_DLYSEL_CTRL_DUMMY77_Pos)

#define PCC_PON_PERI_DLYSEL_CTRL_DUMMY76_Pos                                                     26U
#define PCC_PON_PERI_DLYSEL_CTRL_DUMMY76_Msk                                                     (0x1UL << PCC_PON_PERI_DLYSEL_CTRL_DUMMY76_Pos)

#define PCC_PON_PERI_DLYSEL_CTRL_DUMMY75_Pos                                                     27U
#define PCC_PON_PERI_DLYSEL_CTRL_DUMMY75_Msk                                                     (0xFUL << PCC_PON_PERI_DLYSEL_CTRL_DUMMY75_Pos)

#define PCC_PON_PERI_DLYSEL_CTRL_R_SPIC2_DMA_TX_REQ_AS_SINGLE_Pos                                31U
#define PCC_PON_PERI_DLYSEL_CTRL_R_SPIC2_DMA_TX_REQ_AS_SINGLE_Msk                                (0x1UL << PCC_PON_PERI_DLYSEL_CTRL_R_SPIC2_DMA_TX_REQ_AS_SINGLE_Pos)

/* 0x340    0x4000_0340
    19:0    R/W     R_DSS_DATA_IN                                   20'h1543d
    22:20   R/W     R_DSS_RO_SEL                                    3'd0
    23      R/W     R_DSS_WIRE_SEL                                  1'd0
    24      R/W     R_DSS_CLK_EN                                    1'd0
    25      R/W     R_DSS_SPEED_EN                                  1'd0
    31:26   R/W     DUMMY80                                         6'h0
 */
typedef union _PCC_REG_DSS_CTRL0_TYPE
{
    uint32_t d32;
    struct
    {
        uint32_t R_DSS_DATA_IN: 20;
        uint32_t R_DSS_RO_SEL: 3;
        uint32_t R_DSS_WIRE_SEL: 1;
        uint32_t R_DSS_CLK_EN: 1;
        uint32_t R_DSS_SPEED_EN: 1;
        uint32_t DUMMY80: 6;
    };
} PCC_REG_DSS_CTRL0_TYPE;

