rtkconnectivity/hal_realtek_mainline/bee/soc/inc/rtl87x2j/pcc_reg.h
/*0x4000_0340 PCC_REG_DSS_CTRL0*/
#define PCC_REG_DSS_CTRL0_R_DSS_DATA_IN_Pos                                                      0U
#define PCC_REG_DSS_CTRL0_R_DSS_DATA_IN_Msk                                                      (0xFFFFFUL << PCC_REG_DSS_CTRL0_R_DSS_DATA_IN_Pos)

#define PCC_REG_DSS_CTRL0_R_DSS_RO_SEL_Pos                                                       20U
#define PCC_REG_DSS_CTRL0_R_DSS_RO_SEL_Msk                                                       (0x7UL << PCC_REG_DSS_CTRL0_R_DSS_RO_SEL_Pos)

#define PCC_REG_DSS_CTRL0_R_DSS_WIRE_SEL_Pos                                                     23U
#define PCC_REG_DSS_CTRL0_R_DSS_WIRE_SEL_Msk                                                     (0x1UL << PCC_REG_DSS_CTRL0_R_DSS_WIRE_SEL_Pos)

#define PCC_REG_DSS_CTRL0_R_DSS_CLK_EN_Pos                                                       24U
#define PCC_REG_DSS_CTRL0_R_DSS_CLK_EN_Msk                                                       (0x1UL << PCC_REG_DSS_CTRL0_R_DSS_CLK_EN_Pos)

#define PCC_REG_DSS_CTRL0_R_DSS_SPEED_EN_Pos                                                     25U
#define PCC_REG_DSS_CTRL0_R_DSS_SPEED_EN_Msk                                                     (0x1UL << PCC_REG_DSS_CTRL0_R_DSS_SPEED_EN_Pos)

#define PCC_REG_DSS_CTRL0_DUMMY80_Pos                                                            26U
#define PCC_REG_DSS_CTRL0_DUMMY80_Msk                                                            (0x3FUL << PCC_REG_DSS_CTRL0_DUMMY80_Pos)

/* 0x344    0x4000_0344
    19:0    R       DSS_POW_COUNT                                   20'd0
    20      R       DSS_POW_WSORT_GO                                0
    21      R       DSS_POW_READY                                   0
    31:22   R       RSVD                                            10'h0
 */
typedef union _PCC_REG_DSS_CTRL1_TYPE
{
    uint32_t d32;
    struct
    {
        uint32_t DSS_POW_COUNT: 20;
        uint32_t DSS_POW_WSORT_GO: 1;
        uint32_t DSS_POW_READY: 1;
        uint32_t RSVD: 10;
    };
} PCC_REG_DSS_CTRL1_TYPE;

/*0x4000_0344 PCC_REG_DSS_CTRL1*/
#define PCC_REG_DSS_CTRL1_DSS_POW_COUNT_Pos                                                      0U
#define PCC_REG_DSS_CTRL1_DSS_POW_COUNT_Msk                                                      (0xFFFFFUL << PCC_REG_DSS_CTRL1_DSS_POW_COUNT_Pos)

#define PCC_REG_DSS_CTRL1_DSS_POW_WSORT_GO_Pos                                                   20U
#define PCC_REG_DSS_CTRL1_DSS_POW_WSORT_GO_Msk                                                   (0x1UL << PCC_REG_DSS_CTRL1_DSS_POW_WSORT_GO_Pos)

#define PCC_REG_DSS_CTRL1_DSS_POW_READY_Pos                                                      21U
#define PCC_REG_DSS_CTRL1_DSS_POW_READY_Msk                                                      (0x1UL << PCC_REG_DSS_CTRL1_DSS_POW_READY_Pos)

#define PCC_REG_DSS_CTRL1_RSVD_Pos                                                               22U
#define PCC_REG_DSS_CTRL1_RSVD_Msk                                                               (0x3FFUL << PCC_REG_DSS_CTRL1_RSVD_Pos)

/* 0x348    0x4000_0348
    19:0    R       DSS_IR_COUNT                                    20'd0
    20      R       DSS_IR_WSORT_GO                                 0
    21      R       DSS_IR_READY                                    0
    31:22   R       RSVD                                            10'h0
 */
typedef union _PCC_REG_DSS_CTRL2_TYPE
{
    uint32_t d32;
    struct
    {
        uint32_t DSS_IR_COUNT: 20;
        uint32_t DSS_IR_WSORT_GO: 1;
        uint32_t DSS_IR_READY: 1;
        uint32_t RSVD: 10;
    };
} PCC_REG_DSS_CTRL2_TYPE;

/*0x4000_0348 PCC_REG_DSS_CTRL2*/
#define PCC_REG_DSS_CTRL2_DSS_IR_COUNT_Pos                                                       0U
#define PCC_REG_DSS_CTRL2_DSS_IR_COUNT_Msk                                                       (0xFFFFFUL << PCC_REG_DSS_CTRL2_DSS_IR_COUNT_Pos)

#define PCC_REG_DSS_CTRL2_DSS_IR_WSORT_GO_Pos                                                    20U
#define PCC_REG_DSS_CTRL2_DSS_IR_WSORT_GO_Msk                                                    (0x1UL << PCC_REG_DSS_CTRL2_DSS_IR_WSORT_GO_Pos)

#define PCC_REG_DSS_CTRL2_DSS_IR_READY_Pos                                                       21U
#define PCC_REG_DSS_CTRL2_DSS_IR_READY_Msk                                                       (0x1UL << PCC_REG_DSS_CTRL2_DSS_IR_READY_Pos)

#define PCC_REG_DSS_CTRL2_RSVD_Pos                                                               22U
#define PCC_REG_DSS_CTRL2_RSVD_Msk                                                               (0x3FFUL << PCC_REG_DSS_CTRL2_RSVD_Pos)

/* 0x34C    0x4000_034c
    3:0     R       OSC40_FSET                                      4'h0
    7:4     R       RSVD                                            4'h0
    31:8    R/W     DUMMY84                                         24'h000109
 */
typedef union _PCC_REG_OSC40_CTRL_TYPE
{
    uint32_t d32;
    struct
    {
        uint32_t OSC40_FSET: 4;
        uint32_t RSVD: 4;
        uint32_t DUMMY84: 24;
    };
} PCC_REG_OSC40_CTRL_TYPE;

/*0x4000_034c PCC_REG_OSC40_CTRL*/
#define PCC_REG_OSC40_CTRL_OSC40_FSET_Pos                                                        0U
#define PCC_REG_OSC40_CTRL_OSC40_FSET_Msk                                                        (0xFUL << PCC_REG_OSC40_CTRL_OSC40_FSET_Pos)

#define PCC_REG_OSC40_CTRL_RSVD_Pos                                                              4U
#define PCC_REG_OSC40_CTRL_RSVD_Msk                                                              (0xFUL << PCC_REG_OSC40_CTRL_RSVD_Pos)

#define PCC_REG_OSC40_CTRL_DUMMY84_Pos                                                           8U
#define PCC_REG_OSC40_CTRL_DUMMY84_Msk                                                           (0xFFFFFFUL << PCC_REG_OSC40_CTRL_DUMMY84_Pos)

/* 0x350    0x4000_0350
    0       R/W     RST_N_AAC                                       0
    1       R/W     OFFSET_PLUS                                     0
    7:2     R/W     XAAC_GM_OFFSET                                  6'b000000
    8       R/W     GM_STEP                                         0
    14:9    R/W     GM_INIT                                         6'b111110
    17:15   R/W     XTAL_CLK_SET                                    3'b101
    23:18   R/W     GM_STUP                                         6'b111111
    29:24   R/W     GM_MANUAL                                       6'b111111
    30      R/W     R_EN_XTAL_AAC_DIGI                              0
    31      R/W     R_EN_XTAL_AAC_TRIG                              0
 */
typedef union _PCC_REG_AAC_0_TYPE
{
    uint32_t d32;
    struct
    {
        uint32_t RST_N_AAC: 1;
        uint32_t OFFSET_PLUS: 1;
        uint32_t XAAC_GM_OFFSET: 6;
        uint32_t GM_STEP: 1;
        uint32_t GM_INIT: 6;
        uint32_t XTAL_CLK_SET: 3;
        uint32_t GM_STUP: 6;
        uint32_t GM_MANUAL: 6;
        uint32_t R_EN_XTAL_AAC_DIGI: 1;
        uint32_t R_EN_XTAL_AAC_TRIG: 1;
    };
} PCC_REG_AAC_0_TYPE;

/*0x4000_0350 PCC_REG_AAC_0*/
#define PCC_REG_AAC_0_RST_N_AAC_Pos                                                              0U
#define PCC_REG_AAC_0_RST_N_AAC_Msk                                                              (0x1UL << PCC_REG_AAC_0_RST_N_AAC_Pos)

