rtkconnectivity/hal_realtek_mainline/bee/soc/inc/rtl87x2j/pcc_reg.h
#define PCC_REG_AAC_0_OFFSET_PLUS_Pos                                                            1U
#define PCC_REG_AAC_0_OFFSET_PLUS_Msk                                                            (0x1UL << PCC_REG_AAC_0_OFFSET_PLUS_Pos)

#define PCC_REG_AAC_0_XAAC_GM_OFFSET_Pos                                                         2U
#define PCC_REG_AAC_0_XAAC_GM_OFFSET_Msk                                                         (0x3FUL << PCC_REG_AAC_0_XAAC_GM_OFFSET_Pos)

#define PCC_REG_AAC_0_GM_STEP_Pos                                                                8U
#define PCC_REG_AAC_0_GM_STEP_Msk                                                                (0x1UL << PCC_REG_AAC_0_GM_STEP_Pos)

#define PCC_REG_AAC_0_GM_INIT_Pos                                                                9U
#define PCC_REG_AAC_0_GM_INIT_Msk                                                                (0x3FUL << PCC_REG_AAC_0_GM_INIT_Pos)

#define PCC_REG_AAC_0_XTAL_CLK_SET_Pos                                                           15U
#define PCC_REG_AAC_0_XTAL_CLK_SET_Msk                                                           (0x7UL << PCC_REG_AAC_0_XTAL_CLK_SET_Pos)

#define PCC_REG_AAC_0_GM_STUP_Pos                                                                18U
#define PCC_REG_AAC_0_GM_STUP_Msk                                                                (0x3FUL << PCC_REG_AAC_0_GM_STUP_Pos)

#define PCC_REG_AAC_0_GM_MANUAL_Pos                                                              24U
#define PCC_REG_AAC_0_GM_MANUAL_Msk                                                              (0x3FUL << PCC_REG_AAC_0_GM_MANUAL_Pos)

#define PCC_REG_AAC_0_R_EN_XTAL_AAC_DIGI_Pos                                                     30U
#define PCC_REG_AAC_0_R_EN_XTAL_AAC_DIGI_Msk                                                     (0x1UL << PCC_REG_AAC_0_R_EN_XTAL_AAC_DIGI_Pos)

#define PCC_REG_AAC_0_R_EN_XTAL_AAC_TRIG_Pos                                                     31U
#define PCC_REG_AAC_0_R_EN_XTAL_AAC_TRIG_Msk                                                     (0x1UL << PCC_REG_AAC_0_R_EN_XTAL_AAC_TRIG_Pos)

/* 0x354    0x4000_0354
    0       R       XAAC_BUSY                                       0
    1       R       XTAL_AAC_OK                                     0
    7:2     R       XTAL_GM_OUT                                     6'h3F
    11:8    R       XAAC_CURR_STATE                                 4'h0
    12      R/W     XTAL_EN_DAAC_GM                                 0
    13      R/W     XTAL_EN_AAC_PKDET                               0
    14      R       XTAL_PKDET_OUT                                  0
    15      R/W     DUMMY86                                         0
    31:16   R/W     DUMMY85                                         16'h0129
 */
typedef union _PCC_REG_AAC_1_TYPE
{
    uint32_t d32;
    struct
    {
        uint32_t XAAC_BUSY: 1;
        uint32_t XTAL_AAC_OK: 1;
        uint32_t XTAL_GM_OUT: 6;
        uint32_t XAAC_CURR_STATE: 4;
        uint32_t XTAL_EN_DAAC_GM: 1;
        uint32_t XTAL_EN_AAC_PKDET: 1;
        uint32_t XTAL_PKDET_OUT: 1;
        uint32_t DUMMY86: 1;
        uint32_t DUMMY85: 16;
    };
} PCC_REG_AAC_1_TYPE;

/*0x4000_0354 PCC_REG_AAC_1*/
#define PCC_REG_AAC_1_XAAC_BUSY_Pos                                                              0U
#define PCC_REG_AAC_1_XAAC_BUSY_Msk                                                              (0x1UL << PCC_REG_AAC_1_XAAC_BUSY_Pos)

#define PCC_REG_AAC_1_XTAL_AAC_OK_Pos                                                            1U
#define PCC_REG_AAC_1_XTAL_AAC_OK_Msk                                                            (0x1UL << PCC_REG_AAC_1_XTAL_AAC_OK_Pos)

#define PCC_REG_AAC_1_XTAL_GM_OUT_Pos                                                            2U
#define PCC_REG_AAC_1_XTAL_GM_OUT_Msk                                                            (0x3FUL << PCC_REG_AAC_1_XTAL_GM_OUT_Pos)

#define PCC_REG_AAC_1_XAAC_CURR_STATE_Pos                                                        8U
#define PCC_REG_AAC_1_XAAC_CURR_STATE_Msk                                                        (0xFUL << PCC_REG_AAC_1_XAAC_CURR_STATE_Pos)

#define PCC_REG_AAC_1_XTAL_EN_DAAC_GM_Pos                                                        12U
#define PCC_REG_AAC_1_XTAL_EN_DAAC_GM_Msk                                                        (0x1UL << PCC_REG_AAC_1_XTAL_EN_DAAC_GM_Pos)

#define PCC_REG_AAC_1_XTAL_EN_AAC_PKDET_Pos                                                      13U
#define PCC_REG_AAC_1_XTAL_EN_AAC_PKDET_Msk                                                      (0x1UL << PCC_REG_AAC_1_XTAL_EN_AAC_PKDET_Pos)

#define PCC_REG_AAC_1_XTAL_PKDET_OUT_Pos                                                         14U
#define PCC_REG_AAC_1_XTAL_PKDET_OUT_Msk                                                         (0x1UL << PCC_REG_AAC_1_XTAL_PKDET_OUT_Pos)

#define PCC_REG_AAC_1_DUMMY86_Pos                                                                15U
#define PCC_REG_AAC_1_DUMMY86_Msk                                                                (0x1UL << PCC_REG_AAC_1_DUMMY86_Pos)

#define PCC_REG_AAC_1_DUMMY85_Pos                                                                16U
#define PCC_REG_AAC_1_DUMMY85_Msk                                                                (0xFFFFUL << PCC_REG_AAC_1_DUMMY85_Pos)

/* 0x358    0x4000_0358
    0       R/W     DISABLE_PLL_PRE_GATING                          0
    15:1    R/W     DUMMY88                                         15'h0
    17:16   R/W     DUMMY87                                         2'h3
    23:18   R       RSVD_1                                          6'h0
    24      R       BT_PLL_READY                                    0
    25      R       XTAL_OK                                         0
    31:26   R       RSVD                                            6'h0
 */
typedef union _PCC_REG_XTAL_PLL_TYPE
{
    uint32_t d32;
    struct
    {
        uint32_t DISABLE_PLL_PRE_GATING: 1;
        uint32_t DUMMY88: 15;
        uint32_t DUMMY87: 2;
        uint32_t RSVD_1: 6;
        uint32_t BT_PLL_READY: 1;
        uint32_t XTAL_OK: 1;
        uint32_t RSVD: 6;
    };
} PCC_REG_XTAL_PLL_TYPE;

/*0x4000_0358 PCC_REG_XTAL_PLL*/
#define PCC_REG_XTAL_PLL_DISABLE_PLL_PRE_GATING_Pos                                              0U
#define PCC_REG_XTAL_PLL_DISABLE_PLL_PRE_GATING_Msk                                              (0x1UL << PCC_REG_XTAL_PLL_DISABLE_PLL_PRE_GATING_Pos)

#define PCC_REG_XTAL_PLL_DUMMY88_Pos                                                             1U
#define PCC_REG_XTAL_PLL_DUMMY88_Msk                                                             (0x7FFFUL << PCC_REG_XTAL_PLL_DUMMY88_Pos)

#define PCC_REG_XTAL_PLL_DUMMY87_Pos                                                             16U
#define PCC_REG_XTAL_PLL_DUMMY87_Msk                                                             (0x3UL << PCC_REG_XTAL_PLL_DUMMY87_Pos)

#define PCC_REG_XTAL_PLL_RSVD_1_Pos                                                              18U
#define PCC_REG_XTAL_PLL_RSVD_1_Msk                                                              (0x3FUL << PCC_REG_XTAL_PLL_RSVD_1_Pos)

#define PCC_REG_XTAL_PLL_BT_PLL_READY_Pos                                                        24U
#define PCC_REG_XTAL_PLL_BT_PLL_READY_Msk                                                        (0x1UL << PCC_REG_XTAL_PLL_BT_PLL_READY_Pos)

#define PCC_REG_XTAL_PLL_XTAL_OK_Pos                                                             25U
#define PCC_REG_XTAL_PLL_XTAL_OK_Msk                                                             (0x1UL << PCC_REG_XTAL_PLL_XTAL_OK_Pos)

#define PCC_REG_XTAL_PLL_RSVD_Pos                                                                26U
#define PCC_REG_XTAL_PLL_RSVD_Msk                                                                (0x3FUL << PCC_REG_XTAL_PLL_RSVD_Pos)

/* 0x35C    0x4000_035c
    0       R/W     RESERVED_10                                     0
    1       R/W     RESERVED_9                                      1
    2       R/W     RESERVED_8                                      0
    4:3     R/W     RESERVED_7                                      2'b01
    9:5     R/W     RESERVED_6                                      5'b10000
    14:10   R/W     RESERVED_5                                      5'b11111
    16:15   R/W     RESERVED_4                                      2'b10
    21:17   R/W     RESERVED_3                                      5'b00000
    22      R/W     RESERVED_2                                      0
    27:23   R/W     RESERVED_1                                      5'h0
    31:28   R       RESERVED                                        4'h0
 */
typedef union _PCC_REG_XTALPDCK_TYPE
{
    uint32_t d32;
    struct
    {
        uint32_t RESERVED_10: 1;
        uint32_t RESERVED_9: 1;
        uint32_t RESERVED_8: 1;
        uint32_t RESERVED_7: 2;
        uint32_t RESERVED_6: 5;
        uint32_t RESERVED_5: 5;
        uint32_t RESERVED_4: 2;
        uint32_t RESERVED_3: 5;
        uint32_t RESERVED_2: 1;
        uint32_t RESERVED_1: 5;
        uint32_t RESERVED: 4;
    };
} PCC_REG_XTALPDCK_TYPE;

/*0x4000_035c PCC_REG_XTALPDCK*/
#define PCC_REG_XTALPDCK_RESERVED_10_Pos                                                         0U
#define PCC_REG_XTALPDCK_RESERVED_10_Msk                                                         (0x1UL << PCC_REG_XTALPDCK_RESERVED_10_Pos)

#define PCC_REG_XTALPDCK_RESERVED_9_Pos                                                          1U
#define PCC_REG_XTALPDCK_RESERVED_9_Msk                                                          (0x1UL << PCC_REG_XTALPDCK_RESERVED_9_Pos)

#define PCC_REG_XTALPDCK_RESERVED_8_Pos                                                          2U
#define PCC_REG_XTALPDCK_RESERVED_8_Msk                                                          (0x1UL << PCC_REG_XTALPDCK_RESERVED_8_Pos)

