rtkconnectivity/hal_realtek_mainline/bee/soc/inc/rtl87x2j/pcc_reg.h
#define PCC_REG_PADMUX_AS_CFG0_RESERVED_9_Pos                                                    17U
#define PCC_REG_PADMUX_AS_CFG0_RESERVED_9_Msk                                                    (0x1UL << PCC_REG_PADMUX_AS_CFG0_RESERVED_9_Pos)

#define PCC_REG_PADMUX_AS_CFG0_RESERVED_8_Pos                                                    18U
#define PCC_REG_PADMUX_AS_CFG0_RESERVED_8_Msk                                                    (0x1UL << PCC_REG_PADMUX_AS_CFG0_RESERVED_8_Pos)

#define PCC_REG_PADMUX_AS_CFG0_RESERVED_7_Pos                                                    19U
#define PCC_REG_PADMUX_AS_CFG0_RESERVED_7_Msk                                                    (0x1UL << PCC_REG_PADMUX_AS_CFG0_RESERVED_7_Pos)

#define PCC_REG_PADMUX_AS_CFG0_RESERVED_6_Pos                                                    20U
#define PCC_REG_PADMUX_AS_CFG0_RESERVED_6_Msk                                                    (0xFUL << PCC_REG_PADMUX_AS_CFG0_RESERVED_6_Pos)

#define PCC_REG_PADMUX_AS_CFG0_RESERVED_5_Pos                                                    24U
#define PCC_REG_PADMUX_AS_CFG0_RESERVED_5_Msk                                                    (0x1UL << PCC_REG_PADMUX_AS_CFG0_RESERVED_5_Pos)

#define PCC_REG_PADMUX_AS_CFG0_RESERVED_4_Pos                                                    25U
#define PCC_REG_PADMUX_AS_CFG0_RESERVED_4_Msk                                                    (0x1UL << PCC_REG_PADMUX_AS_CFG0_RESERVED_4_Pos)

#define PCC_REG_PADMUX_AS_CFG0_RESERVED_3_Pos                                                    26U
#define PCC_REG_PADMUX_AS_CFG0_RESERVED_3_Msk                                                    (0x1UL << PCC_REG_PADMUX_AS_CFG0_RESERVED_3_Pos)

#define PCC_REG_PADMUX_AS_CFG0_RESERVED_2_Pos                                                    27U
#define PCC_REG_PADMUX_AS_CFG0_RESERVED_2_Msk                                                    (0x1UL << PCC_REG_PADMUX_AS_CFG0_RESERVED_2_Pos)

#define PCC_REG_PADMUX_AS_CFG0_RESERVED_1_Pos                                                    28U
#define PCC_REG_PADMUX_AS_CFG0_RESERVED_1_Msk                                                    (0x7UL << PCC_REG_PADMUX_AS_CFG0_RESERVED_1_Pos)

#define PCC_REG_PADMUX_AS_CFG0_RESERVED_Pos                                                      31U
#define PCC_REG_PADMUX_AS_CFG0_RESERVED_Msk                                                      (0x1UL << PCC_REG_PADMUX_AS_CFG0_RESERVED_Pos)

/* 0x364    0x4000_0364
    0       R/W     RESERVED_11                                     1'b0
    1       R/W     RESERVED_10                                     1'b0
    2       R/W     RESERVED_9                                      1'b0
    3       R/W     RESERVED_8                                      1'b0
    7:4     R/W     RESERVED_7                                      4'd0
    8       R/W     RESERVED_6                                      1'b0
    9       R/W     RESERVED_5                                      1'b0
    10      R/W     RESERVED_4                                      1'b0
    11      R/W     RESERVED_3                                      1'b0
    14:12   R/W     RESERVED_2                                      3'd0
    15      R/W     RESERVED_1                                      1'b0
    31:16   R/W     RESERVED                                        16'd0
 */
typedef union _PCC_REG_PADMUX_AS_CFG1_TYPE
{
    uint32_t d32;
    struct
    {
        uint32_t RESERVED_11: 1;
        uint32_t RESERVED_10: 1;
        uint32_t RESERVED_9: 1;
        uint32_t RESERVED_8: 1;
        uint32_t RESERVED_7: 4;
        uint32_t RESERVED_6: 1;
        uint32_t RESERVED_5: 1;
        uint32_t RESERVED_4: 1;
        uint32_t RESERVED_3: 1;
        uint32_t RESERVED_2: 3;
        uint32_t RESERVED_1: 1;
        uint32_t RESERVED: 16;
    };
} PCC_REG_PADMUX_AS_CFG1_TYPE;

/*0x4000_0364 PCC_REG_PADMUX_AS_CFG1*/
#define PCC_REG_PADMUX_AS_CFG1_RESERVED_11_Pos                                                   0U
#define PCC_REG_PADMUX_AS_CFG1_RESERVED_11_Msk                                                   (0x1UL << PCC_REG_PADMUX_AS_CFG1_RESERVED_11_Pos)

#define PCC_REG_PADMUX_AS_CFG1_RESERVED_10_Pos                                                   1U
#define PCC_REG_PADMUX_AS_CFG1_RESERVED_10_Msk                                                   (0x1UL << PCC_REG_PADMUX_AS_CFG1_RESERVED_10_Pos)

#define PCC_REG_PADMUX_AS_CFG1_RESERVED_9_Pos                                                    2U
#define PCC_REG_PADMUX_AS_CFG1_RESERVED_9_Msk                                                    (0x1UL << PCC_REG_PADMUX_AS_CFG1_RESERVED_9_Pos)

#define PCC_REG_PADMUX_AS_CFG1_RESERVED_8_Pos                                                    3U
#define PCC_REG_PADMUX_AS_CFG1_RESERVED_8_Msk                                                    (0x1UL << PCC_REG_PADMUX_AS_CFG1_RESERVED_8_Pos)

#define PCC_REG_PADMUX_AS_CFG1_RESERVED_7_Pos                                                    4U
#define PCC_REG_PADMUX_AS_CFG1_RESERVED_7_Msk                                                    (0xFUL << PCC_REG_PADMUX_AS_CFG1_RESERVED_7_Pos)

#define PCC_REG_PADMUX_AS_CFG1_RESERVED_6_Pos                                                    8U
#define PCC_REG_PADMUX_AS_CFG1_RESERVED_6_Msk                                                    (0x1UL << PCC_REG_PADMUX_AS_CFG1_RESERVED_6_Pos)

#define PCC_REG_PADMUX_AS_CFG1_RESERVED_5_Pos                                                    9U
#define PCC_REG_PADMUX_AS_CFG1_RESERVED_5_Msk                                                    (0x1UL << PCC_REG_PADMUX_AS_CFG1_RESERVED_5_Pos)

#define PCC_REG_PADMUX_AS_CFG1_RESERVED_4_Pos                                                    10U
#define PCC_REG_PADMUX_AS_CFG1_RESERVED_4_Msk                                                    (0x1UL << PCC_REG_PADMUX_AS_CFG1_RESERVED_4_Pos)

#define PCC_REG_PADMUX_AS_CFG1_RESERVED_3_Pos                                                    11U
#define PCC_REG_PADMUX_AS_CFG1_RESERVED_3_Msk                                                    (0x1UL << PCC_REG_PADMUX_AS_CFG1_RESERVED_3_Pos)

