rtkconnectivity/hal_realtek_mainline/bee/soc/inc/rtl87x2j/pcc_reg.h
#define PCC_REG_PADMUX_AS_CFG2_RESERVED_6_Pos                                                    20U
#define PCC_REG_PADMUX_AS_CFG2_RESERVED_6_Msk                                                    (0xFUL << PCC_REG_PADMUX_AS_CFG2_RESERVED_6_Pos)

#define PCC_REG_PADMUX_AS_CFG2_RESERVED_5_Pos                                                    24U
#define PCC_REG_PADMUX_AS_CFG2_RESERVED_5_Msk                                                    (0x1UL << PCC_REG_PADMUX_AS_CFG2_RESERVED_5_Pos)

#define PCC_REG_PADMUX_AS_CFG2_RESERVED_4_Pos                                                    25U
#define PCC_REG_PADMUX_AS_CFG2_RESERVED_4_Msk                                                    (0x1UL << PCC_REG_PADMUX_AS_CFG2_RESERVED_4_Pos)

#define PCC_REG_PADMUX_AS_CFG2_RESERVED_3_Pos                                                    26U
#define PCC_REG_PADMUX_AS_CFG2_RESERVED_3_Msk                                                    (0x1UL << PCC_REG_PADMUX_AS_CFG2_RESERVED_3_Pos)

#define PCC_REG_PADMUX_AS_CFG2_RESERVED_2_Pos                                                    27U
#define PCC_REG_PADMUX_AS_CFG2_RESERVED_2_Msk                                                    (0x1UL << PCC_REG_PADMUX_AS_CFG2_RESERVED_2_Pos)

#define PCC_REG_PADMUX_AS_CFG2_RESERVED_1_Pos                                                    28U
#define PCC_REG_PADMUX_AS_CFG2_RESERVED_1_Msk                                                    (0x7UL << PCC_REG_PADMUX_AS_CFG2_RESERVED_1_Pos)

#define PCC_REG_PADMUX_AS_CFG2_RESERVED_Pos                                                      31U
#define PCC_REG_PADMUX_AS_CFG2_RESERVED_Msk                                                      (0x1UL << PCC_REG_PADMUX_AS_CFG2_RESERVED_Pos)

/* 0x36C    0x4000_036c
    0       R/W     RESERVED_11                                     1'b0
    1       R/W     RESERVED_10                                     1'b0
    2       R/W     RESERVED_9                                      1'b0
    3       R/W     RESERVED_8                                      1'b0
    7:4     R/W     RESERVED_7                                      4'd0
    8       R/W     RESERVED_6                                      1'b0
    9       R/W     RESERVED_5                                      1'b0
    10      R/W     RESERVED_4                                      1'b0
    11      R/W     RESERVED_3                                      1'b0
    14:12   R/W     RESERVED_2                                      3'd0
    15      R/W     RESERVED_1                                      1'b0
    31:16   R/W     RESERVED                                        16'd0
 */
typedef union _PCC_REG_PADMUX_AS_CFG3_TYPE
{
    uint32_t d32;
    struct
    {
        uint32_t RESERVED_11: 1;
        uint32_t RESERVED_10: 1;
        uint32_t RESERVED_9: 1;
        uint32_t RESERVED_8: 1;
        uint32_t RESERVED_7: 4;
        uint32_t RESERVED_6: 1;
        uint32_t RESERVED_5: 1;
        uint32_t RESERVED_4: 1;
        uint32_t RESERVED_3: 1;
        uint32_t RESERVED_2: 3;
        uint32_t RESERVED_1: 1;
        uint32_t RESERVED: 16;
    };
} PCC_REG_PADMUX_AS_CFG3_TYPE;

/*0x4000_036c PCC_REG_PADMUX_AS_CFG3*/
#define PCC_REG_PADMUX_AS_CFG3_RESERVED_11_Pos                                                   0U
#define PCC_REG_PADMUX_AS_CFG3_RESERVED_11_Msk                                                   (0x1UL << PCC_REG_PADMUX_AS_CFG3_RESERVED_11_Pos)

#define PCC_REG_PADMUX_AS_CFG3_RESERVED_10_Pos                                                   1U
#define PCC_REG_PADMUX_AS_CFG3_RESERVED_10_Msk                                                   (0x1UL << PCC_REG_PADMUX_AS_CFG3_RESERVED_10_Pos)

#define PCC_REG_PADMUX_AS_CFG3_RESERVED_9_Pos                                                    2U
#define PCC_REG_PADMUX_AS_CFG3_RESERVED_9_Msk                                                    (0x1UL << PCC_REG_PADMUX_AS_CFG3_RESERVED_9_Pos)

#define PCC_REG_PADMUX_AS_CFG3_RESERVED_8_Pos                                                    3U
#define PCC_REG_PADMUX_AS_CFG3_RESERVED_8_Msk                                                    (0x1UL << PCC_REG_PADMUX_AS_CFG3_RESERVED_8_Pos)

#define PCC_REG_PADMUX_AS_CFG3_RESERVED_7_Pos                                                    4U
#define PCC_REG_PADMUX_AS_CFG3_RESERVED_7_Msk                                                    (0xFUL << PCC_REG_PADMUX_AS_CFG3_RESERVED_7_Pos)

#define PCC_REG_PADMUX_AS_CFG3_RESERVED_6_Pos                                                    8U
#define PCC_REG_PADMUX_AS_CFG3_RESERVED_6_Msk                                                    (0x1UL << PCC_REG_PADMUX_AS_CFG3_RESERVED_6_Pos)

#define PCC_REG_PADMUX_AS_CFG3_RESERVED_5_Pos                                                    9U
#define PCC_REG_PADMUX_AS_CFG3_RESERVED_5_Msk                                                    (0x1UL << PCC_REG_PADMUX_AS_CFG3_RESERVED_5_Pos)

#define PCC_REG_PADMUX_AS_CFG3_RESERVED_4_Pos                                                    10U
#define PCC_REG_PADMUX_AS_CFG3_RESERVED_4_Msk                                                    (0x1UL << PCC_REG_PADMUX_AS_CFG3_RESERVED_4_Pos)

#define PCC_REG_PADMUX_AS_CFG3_RESERVED_3_Pos                                                    11U
#define PCC_REG_PADMUX_AS_CFG3_RESERVED_3_Msk                                                    (0x1UL << PCC_REG_PADMUX_AS_CFG3_RESERVED_3_Pos)

#define PCC_REG_PADMUX_AS_CFG3_RESERVED_2_Pos                                                    12U
#define PCC_REG_PADMUX_AS_CFG3_RESERVED_2_Msk                                                    (0x7UL << PCC_REG_PADMUX_AS_CFG3_RESERVED_2_Pos)

#define PCC_REG_PADMUX_AS_CFG3_RESERVED_1_Pos                                                    15U
#define PCC_REG_PADMUX_AS_CFG3_RESERVED_1_Msk                                                    (0x1UL << PCC_REG_PADMUX_AS_CFG3_RESERVED_1_Pos)

#define PCC_REG_PADMUX_AS_CFG3_RESERVED_Pos                                                      16U
#define PCC_REG_PADMUX_AS_CFG3_RESERVED_Msk                                                      (0xFFFFUL << PCC_REG_PADMUX_AS_CFG3_RESERVED_Pos)

/* 0x370    0x4000_0370
    0       R/W     RESERVED_21                                     1'b0
    1       R/W     RESERVED_20                                     1'b0
    2       R/W     RESERVED_19                                     1'b0
    3       R/W     RESERVED_18                                     1'b0
    7:4     R/W     RESERVED_17                                     4'd0
    8       R/W     RESERVED_16                                     1'b0
    9       R/W     RESERVED_15                                     1'b0
    10      R/W     RESERVED_14                                     1'b0
    11      R/W     RESERVED_13                                     1'b0
    14:12   R/W     RESERVED_12                                     3'd0
    15      R/W     RESERVED_11                                     1'b0
    16      R/W     RESERVED_10                                     1'b0
    17      R/W     RESERVED_9                                      1'b0
    18      R/W     RESERVED_8                                      1'b0
    19      R/W     RESERVED_7                                      1'b0
    23:20   R/W     RESERVED_6                                      4'd0
    24      R/W     RESERVED_5                                      1'b0
    25      R/W     RESERVED_4                                      1'b0
    26      R/W     RESERVED_3                                      1'b0
    27      R/W     RESERVED_2                                      1'b0
    30:28   R/W     RESERVED_1                                      3'd0
    31      R/W     RESERVED                                        1'b0
 */
typedef union _PCC_REG_PADMUX_AS_CFG4_TYPE
{
    uint32_t d32;
    struct
    {
        uint32_t RESERVED_21: 1;
        uint32_t RESERVED_20: 1;
        uint32_t RESERVED_19: 1;
        uint32_t RESERVED_18: 1;
        uint32_t RESERVED_17: 4;
        uint32_t RESERVED_16: 1;
        uint32_t RESERVED_15: 1;
        uint32_t RESERVED_14: 1;
        uint32_t RESERVED_13: 1;
        uint32_t RESERVED_12: 3;
        uint32_t RESERVED_11: 1;
        uint32_t RESERVED_10: 1;
        uint32_t RESERVED_9: 1;
        uint32_t RESERVED_8: 1;
        uint32_t RESERVED_7: 1;
        uint32_t RESERVED_6: 4;
        uint32_t RESERVED_5: 1;
        uint32_t RESERVED_4: 1;
        uint32_t RESERVED_3: 1;
        uint32_t RESERVED_2: 1;
        uint32_t RESERVED_1: 3;
        uint32_t RESERVED: 1;
    };
} PCC_REG_PADMUX_AS_CFG4_TYPE;

/*0x4000_0370 PCC_REG_PADMUX_AS_CFG4*/
#define PCC_REG_PADMUX_AS_CFG4_RESERVED_21_Pos                                                   0U
#define PCC_REG_PADMUX_AS_CFG4_RESERVED_21_Msk                                                   (0x1UL << PCC_REG_PADMUX_AS_CFG4_RESERVED_21_Pos)

#define PCC_REG_PADMUX_AS_CFG4_RESERVED_20_Pos                                                   1U
#define PCC_REG_PADMUX_AS_CFG4_RESERVED_20_Msk                                                   (0x1UL << PCC_REG_PADMUX_AS_CFG4_RESERVED_20_Pos)

#define PCC_REG_PADMUX_AS_CFG4_RESERVED_19_Pos                                                   2U
#define PCC_REG_PADMUX_AS_CFG4_RESERVED_19_Msk                                                   (0x1UL << PCC_REG_PADMUX_AS_CFG4_RESERVED_19_Pos)

#define PCC_REG_PADMUX_AS_CFG4_RESERVED_18_Pos                                                   3U
#define PCC_REG_PADMUX_AS_CFG4_RESERVED_18_Msk                                                   (0x1UL << PCC_REG_PADMUX_AS_CFG4_RESERVED_18_Pos)

#define PCC_REG_PADMUX_AS_CFG4_RESERVED_17_Pos                                                   4U
#define PCC_REG_PADMUX_AS_CFG4_RESERVED_17_Msk                                                   (0xFUL << PCC_REG_PADMUX_AS_CFG4_RESERVED_17_Pos)

