rtkconnectivity/hal_realtek_mainline/bee/soc/inc/rtl87x2j/pcc_reg.h
#define PCC_REG_PADMUX_AS_CFG9_RESERVED_20_Pos                                                   1U
#define PCC_REG_PADMUX_AS_CFG9_RESERVED_20_Msk                                                   (0x1UL << PCC_REG_PADMUX_AS_CFG9_RESERVED_20_Pos)

#define PCC_REG_PADMUX_AS_CFG9_RESERVED_19_Pos                                                   2U
#define PCC_REG_PADMUX_AS_CFG9_RESERVED_19_Msk                                                   (0x1UL << PCC_REG_PADMUX_AS_CFG9_RESERVED_19_Pos)

#define PCC_REG_PADMUX_AS_CFG9_RESERVED_18_Pos                                                   3U
#define PCC_REG_PADMUX_AS_CFG9_RESERVED_18_Msk                                                   (0x1UL << PCC_REG_PADMUX_AS_CFG9_RESERVED_18_Pos)

#define PCC_REG_PADMUX_AS_CFG9_RESERVED_17_Pos                                                   4U
#define PCC_REG_PADMUX_AS_CFG9_RESERVED_17_Msk                                                   (0xFUL << PCC_REG_PADMUX_AS_CFG9_RESERVED_17_Pos)

#define PCC_REG_PADMUX_AS_CFG9_RESERVED_16_Pos                                                   8U
#define PCC_REG_PADMUX_AS_CFG9_RESERVED_16_Msk                                                   (0x1UL << PCC_REG_PADMUX_AS_CFG9_RESERVED_16_Pos)

#define PCC_REG_PADMUX_AS_CFG9_RESERVED_15_Pos                                                   9U
#define PCC_REG_PADMUX_AS_CFG9_RESERVED_15_Msk                                                   (0x1UL << PCC_REG_PADMUX_AS_CFG9_RESERVED_15_Pos)

#define PCC_REG_PADMUX_AS_CFG9_RESERVED_14_Pos                                                   10U
#define PCC_REG_PADMUX_AS_CFG9_RESERVED_14_Msk                                                   (0x1UL << PCC_REG_PADMUX_AS_CFG9_RESERVED_14_Pos)

#define PCC_REG_PADMUX_AS_CFG9_RESERVED_13_Pos                                                   11U
#define PCC_REG_PADMUX_AS_CFG9_RESERVED_13_Msk                                                   (0x1UL << PCC_REG_PADMUX_AS_CFG9_RESERVED_13_Pos)

#define PCC_REG_PADMUX_AS_CFG9_RESERVED_12_Pos                                                   12U
#define PCC_REG_PADMUX_AS_CFG9_RESERVED_12_Msk                                                   (0x7UL << PCC_REG_PADMUX_AS_CFG9_RESERVED_12_Pos)

#define PCC_REG_PADMUX_AS_CFG9_RESERVED_11_Pos                                                   15U
#define PCC_REG_PADMUX_AS_CFG9_RESERVED_11_Msk                                                   (0x1UL << PCC_REG_PADMUX_AS_CFG9_RESERVED_11_Pos)

#define PCC_REG_PADMUX_AS_CFG9_RESERVED_10_Pos                                                   16U
#define PCC_REG_PADMUX_AS_CFG9_RESERVED_10_Msk                                                   (0x1UL << PCC_REG_PADMUX_AS_CFG9_RESERVED_10_Pos)

#define PCC_REG_PADMUX_AS_CFG9_RESERVED_9_Pos                                                    17U
#define PCC_REG_PADMUX_AS_CFG9_RESERVED_9_Msk                                                    (0x1UL << PCC_REG_PADMUX_AS_CFG9_RESERVED_9_Pos)

#define PCC_REG_PADMUX_AS_CFG9_RESERVED_8_Pos                                                    18U
#define PCC_REG_PADMUX_AS_CFG9_RESERVED_8_Msk                                                    (0x1UL << PCC_REG_PADMUX_AS_CFG9_RESERVED_8_Pos)

#define PCC_REG_PADMUX_AS_CFG9_RESERVED_7_Pos                                                    19U
#define PCC_REG_PADMUX_AS_CFG9_RESERVED_7_Msk                                                    (0x1UL << PCC_REG_PADMUX_AS_CFG9_RESERVED_7_Pos)

#define PCC_REG_PADMUX_AS_CFG9_RESERVED_6_Pos                                                    20U
#define PCC_REG_PADMUX_AS_CFG9_RESERVED_6_Msk                                                    (0xFUL << PCC_REG_PADMUX_AS_CFG9_RESERVED_6_Pos)

#define PCC_REG_PADMUX_AS_CFG9_RESERVED_5_Pos                                                    24U
#define PCC_REG_PADMUX_AS_CFG9_RESERVED_5_Msk                                                    (0x1UL << PCC_REG_PADMUX_AS_CFG9_RESERVED_5_Pos)

#define PCC_REG_PADMUX_AS_CFG9_RESERVED_4_Pos                                                    25U
#define PCC_REG_PADMUX_AS_CFG9_RESERVED_4_Msk                                                    (0x1UL << PCC_REG_PADMUX_AS_CFG9_RESERVED_4_Pos)

#define PCC_REG_PADMUX_AS_CFG9_RESERVED_3_Pos                                                    26U
#define PCC_REG_PADMUX_AS_CFG9_RESERVED_3_Msk                                                    (0x1UL << PCC_REG_PADMUX_AS_CFG9_RESERVED_3_Pos)

#define PCC_REG_PADMUX_AS_CFG9_RESERVED_2_Pos                                                    27U
#define PCC_REG_PADMUX_AS_CFG9_RESERVED_2_Msk                                                    (0x1UL << PCC_REG_PADMUX_AS_CFG9_RESERVED_2_Pos)

#define PCC_REG_PADMUX_AS_CFG9_RESERVED_1_Pos                                                    28U
#define PCC_REG_PADMUX_AS_CFG9_RESERVED_1_Msk                                                    (0x7UL << PCC_REG_PADMUX_AS_CFG9_RESERVED_1_Pos)

#define PCC_REG_PADMUX_AS_CFG9_RESERVED_Pos                                                      31U
#define PCC_REG_PADMUX_AS_CFG9_RESERVED_Msk                                                      (0x1UL << PCC_REG_PADMUX_AS_CFG9_RESERVED_Pos)

/* 0x388    0x4000_0388
    0       R       I2C0_BUS_QCH_BUSY_FLAG1                         1'b0
    1       R       I2C0_QCH_BUSY_FLAG1                             1'b0
    2       R       GPIO_DBNC_QCH_BUSY_FLAG1                        1'b0
    3       R       GPIO_BUS_QCH_BUSY_FLAG1                         1'b0
    4       R       GPIO_QCH_BUSY_FLAG1                             1'b0
    5       R       GDMA_BUS_QCH_BUSY_FLAG1                         1'b0
    6       R       ETIMER_PCLK_QCH_BUSY_FLAG1                      1'b0
    7       R       ETIMER_PWM_QCH_BUSY_FLAG1                       1'b0
    8       R       ETIMER_BUS_QCH_BUSY_FLAG1                       1'b0
    9       R       ETIMER_QCH_BUSY_FLAG1                           1'b0
    10      R       EFLASH_BUS_QCH_BUSY_FLAG1                       1'b0
    11      R       EFLASH_QCH_BUSY_FLAG1                           1'b0
    12      R       CPU_BUS_QCH_BUSY_FLAG1                          1'b0
    13      R       CAN_LP_QCH_BUSY_FLAG1                           1'b0
    14      R       CAN_BUS_QCH_BUSY_FLAG1                          1'b0
    15      R       CAN_PWR_QCH_BUSY_FLAG1                          1'b0
    16      R       CAN_QCH_BUSY_FLAG1                              1'b0
    17      R       AES_QCH_BUSY_FLAG1                              1'b0
    31:18   R       RESERVED                                        14'd0
 */
typedef union _PCC_REG_PADMUX_AS_CFG10_TYPE
{
    uint32_t d32;
    struct
    {
        uint32_t I2C0_BUS_QCH_BUSY_FLAG1: 1;
        uint32_t I2C0_QCH_BUSY_FLAG1: 1;
        uint32_t GPIO_DBNC_QCH_BUSY_FLAG1: 1;
        uint32_t GPIO_BUS_QCH_BUSY_FLAG1: 1;
        uint32_t GPIO_QCH_BUSY_FLAG1: 1;
        uint32_t GDMA_BUS_QCH_BUSY_FLAG1: 1;
        uint32_t ETIMER_PCLK_QCH_BUSY_FLAG1: 1;
        uint32_t ETIMER_PWM_QCH_BUSY_FLAG1: 1;
        uint32_t ETIMER_BUS_QCH_BUSY_FLAG1: 1;
        uint32_t ETIMER_QCH_BUSY_FLAG1: 1;
        uint32_t EFLASH_BUS_QCH_BUSY_FLAG1: 1;
        uint32_t EFLASH_QCH_BUSY_FLAG1: 1;
        uint32_t CPU_BUS_QCH_BUSY_FLAG1: 1;
        uint32_t CAN_LP_QCH_BUSY_FLAG1: 1;
        uint32_t CAN_BUS_QCH_BUSY_FLAG1: 1;
        uint32_t CAN_PWR_QCH_BUSY_FLAG1: 1;
        uint32_t CAN_QCH_BUSY_FLAG1: 1;
        uint32_t AES_QCH_BUSY_FLAG1: 1;
        uint32_t RESERVED: 14;
    };
} PCC_REG_PADMUX_AS_CFG10_TYPE;

/*0x4000_0388 PCC_REG_PADMUX_AS_CFG10*/
#define PCC_REG_PADMUX_AS_CFG10_I2C0_BUS_QCH_BUSY_FLAG1_Pos                                      0U
#define PCC_REG_PADMUX_AS_CFG10_I2C0_BUS_QCH_BUSY_FLAG1_Msk                                      (0x1UL << PCC_REG_PADMUX_AS_CFG10_I2C0_BUS_QCH_BUSY_FLAG1_Pos)

#define PCC_REG_PADMUX_AS_CFG10_I2C0_QCH_BUSY_FLAG1_Pos                                          1U
#define PCC_REG_PADMUX_AS_CFG10_I2C0_QCH_BUSY_FLAG1_Msk                                          (0x1UL << PCC_REG_PADMUX_AS_CFG10_I2C0_QCH_BUSY_FLAG1_Pos)

#define PCC_REG_PADMUX_AS_CFG10_GPIO_DBNC_QCH_BUSY_FLAG1_Pos                                     2U
#define PCC_REG_PADMUX_AS_CFG10_GPIO_DBNC_QCH_BUSY_FLAG1_Msk                                     (0x1UL << PCC_REG_PADMUX_AS_CFG10_GPIO_DBNC_QCH_BUSY_FLAG1_Pos)

#define PCC_REG_PADMUX_AS_CFG10_GPIO_BUS_QCH_BUSY_FLAG1_Pos                                      3U
#define PCC_REG_PADMUX_AS_CFG10_GPIO_BUS_QCH_BUSY_FLAG1_Msk                                      (0x1UL << PCC_REG_PADMUX_AS_CFG10_GPIO_BUS_QCH_BUSY_FLAG1_Pos)

#define PCC_REG_PADMUX_AS_CFG10_GPIO_QCH_BUSY_FLAG1_Pos                                          4U
#define PCC_REG_PADMUX_AS_CFG10_GPIO_QCH_BUSY_FLAG1_Msk                                          (0x1UL << PCC_REG_PADMUX_AS_CFG10_GPIO_QCH_BUSY_FLAG1_Pos)

#define PCC_REG_PADMUX_AS_CFG10_GDMA_BUS_QCH_BUSY_FLAG1_Pos                                      5U
#define PCC_REG_PADMUX_AS_CFG10_GDMA_BUS_QCH_BUSY_FLAG1_Msk                                      (0x1UL << PCC_REG_PADMUX_AS_CFG10_GDMA_BUS_QCH_BUSY_FLAG1_Pos)

#define PCC_REG_PADMUX_AS_CFG10_ETIMER_PCLK_QCH_BUSY_FLAG1_Pos                                   6U
#define PCC_REG_PADMUX_AS_CFG10_ETIMER_PCLK_QCH_BUSY_FLAG1_Msk                                   (0x1UL << PCC_REG_PADMUX_AS_CFG10_ETIMER_PCLK_QCH_BUSY_FLAG1_Pos)

#define PCC_REG_PADMUX_AS_CFG10_ETIMER_PWM_QCH_BUSY_FLAG1_Pos                                    7U
#define PCC_REG_PADMUX_AS_CFG10_ETIMER_PWM_QCH_BUSY_FLAG1_Msk                                    (0x1UL << PCC_REG_PADMUX_AS_CFG10_ETIMER_PWM_QCH_BUSY_FLAG1_Pos)

#define PCC_REG_PADMUX_AS_CFG10_ETIMER_BUS_QCH_BUSY_FLAG1_Pos                                    8U
#define PCC_REG_PADMUX_AS_CFG10_ETIMER_BUS_QCH_BUSY_FLAG1_Msk                                    (0x1UL << PCC_REG_PADMUX_AS_CFG10_ETIMER_BUS_QCH_BUSY_FLAG1_Pos)

