rtkconnectivity/hal_realtek_mainline/bee/soc/inc/rtl87x2j/pcc_reg.h
#define PCC_REG_PADMUX_AS_CFG10_ETIMER_QCH_BUSY_FLAG1_Pos                                        9U
#define PCC_REG_PADMUX_AS_CFG10_ETIMER_QCH_BUSY_FLAG1_Msk                                        (0x1UL << PCC_REG_PADMUX_AS_CFG10_ETIMER_QCH_BUSY_FLAG1_Pos)

#define PCC_REG_PADMUX_AS_CFG10_EFLASH_BUS_QCH_BUSY_FLAG1_Pos                                    10U
#define PCC_REG_PADMUX_AS_CFG10_EFLASH_BUS_QCH_BUSY_FLAG1_Msk                                    (0x1UL << PCC_REG_PADMUX_AS_CFG10_EFLASH_BUS_QCH_BUSY_FLAG1_Pos)

#define PCC_REG_PADMUX_AS_CFG10_EFLASH_QCH_BUSY_FLAG1_Pos                                        11U
#define PCC_REG_PADMUX_AS_CFG10_EFLASH_QCH_BUSY_FLAG1_Msk                                        (0x1UL << PCC_REG_PADMUX_AS_CFG10_EFLASH_QCH_BUSY_FLAG1_Pos)

#define PCC_REG_PADMUX_AS_CFG10_CPU_BUS_QCH_BUSY_FLAG1_Pos                                       12U
#define PCC_REG_PADMUX_AS_CFG10_CPU_BUS_QCH_BUSY_FLAG1_Msk                                       (0x1UL << PCC_REG_PADMUX_AS_CFG10_CPU_BUS_QCH_BUSY_FLAG1_Pos)

#define PCC_REG_PADMUX_AS_CFG10_CAN_LP_QCH_BUSY_FLAG1_Pos                                        13U
#define PCC_REG_PADMUX_AS_CFG10_CAN_LP_QCH_BUSY_FLAG1_Msk                                        (0x1UL << PCC_REG_PADMUX_AS_CFG10_CAN_LP_QCH_BUSY_FLAG1_Pos)

#define PCC_REG_PADMUX_AS_CFG10_CAN_BUS_QCH_BUSY_FLAG1_Pos                                       14U
#define PCC_REG_PADMUX_AS_CFG10_CAN_BUS_QCH_BUSY_FLAG1_Msk                                       (0x1UL << PCC_REG_PADMUX_AS_CFG10_CAN_BUS_QCH_BUSY_FLAG1_Pos)

#define PCC_REG_PADMUX_AS_CFG10_CAN_PWR_QCH_BUSY_FLAG1_Pos                                       15U
#define PCC_REG_PADMUX_AS_CFG10_CAN_PWR_QCH_BUSY_FLAG1_Msk                                       (0x1UL << PCC_REG_PADMUX_AS_CFG10_CAN_PWR_QCH_BUSY_FLAG1_Pos)

#define PCC_REG_PADMUX_AS_CFG10_CAN_QCH_BUSY_FLAG1_Pos                                           16U
#define PCC_REG_PADMUX_AS_CFG10_CAN_QCH_BUSY_FLAG1_Msk                                           (0x1UL << PCC_REG_PADMUX_AS_CFG10_CAN_QCH_BUSY_FLAG1_Pos)

#define PCC_REG_PADMUX_AS_CFG10_AES_QCH_BUSY_FLAG1_Pos                                           17U
#define PCC_REG_PADMUX_AS_CFG10_AES_QCH_BUSY_FLAG1_Msk                                           (0x1UL << PCC_REG_PADMUX_AS_CFG10_AES_QCH_BUSY_FLAG1_Pos)

#define PCC_REG_PADMUX_AS_CFG10_RESERVED_Pos                                                     18U
#define PCC_REG_PADMUX_AS_CFG10_RESERVED_Msk                                                     (0x3FFFUL << PCC_REG_PADMUX_AS_CFG10_RESERVED_Pos)

/* 0x38C    0x4000_038c
    0       R       TIMER3_QCH_BUSY_FLAG1                           1'b0
    1       R       TIMER2_QCH_BUSY_FLAG1                           1'b0
    2       R       TIMER1_PCLK_QCH_BUSY_FLAG1                      1'b0
    3       R       TIMER1_BUS_QCH_BUSY_FLAG1                       1'b0
    4       R       TIMER1_QCH_BUSY_FLAG1                           1'b0
    5       R       SPIC0_QCH_BUSY_FLAG1                            1'b0
    6       R       SPI3W_BUS_QCH_BUSY_FLAG1                        1'b0
    7       R       SPI3W_QCH_BUSY_FLAG1                            1'b0
    8       R       SPI2_PWR_QCH_BUSY_FLAG1                         1'b0
    9       R       SPI2_BUS_QCH_BUSY_FLAG1                         1'b0
    10      R       SPI2_QCH_BUSY_FLAG1                             1'b0
    11      R       SPI1_HS_BUS_QCH_BUSY_FLAG1                      1'b0
    12      R       SPI1_PWR_QCH_BUSY_FLAG1                         1'b0
    13      R       SPI1_BUS_QCH_BUSY_FLAG1                         1'b0
    14      R       SPI1_QCH_BUSY_FLAG1                             1'b0
    15      R       SPI0_HS_BUS_QCH_BUSY_FLAG1                      1'b0
    16      R       SPI0_PWR_QCH_BUSY_FLAG1                         1'b0
    17      R       SPI0_BUS_QCH_BUSY_FLAG1                         1'b0
    18      R       SPI0_QCH_BUSY_FLAG1                             1'b0
    19      R       SHA256_BUS_QCH_BUSY_FLAG1                       1'b0
    20      R       RNG_BUS_QCH_BUSY_FLAG1                          1'b0
    21      R       RNG_QCH_BUSY_FLAG1                              1'b0
    22      R       RXI300_QCH_BUSY_FLAG1                           1'b0
    23      R       KEYSCAN_BUS_QCH_BUSY_FLAG1                      1'b0
    24      R       KEYSCAN_QCH_BUSY_FLAG1                          1'b0
    25      R       IRRC_PWR_QCH_BUSY_FLAG1                         1'b0
    26      R       IRRC_BUS_QCH_BUSY_FLAG1                         1'b0
    27      R       IRRC_QCH_BUSY_FLAG1                             1'b0
    28      R       I2C1_PWR_QCH_BUSY_FLAG1                         1'b0
    29      R       I2C1_BUS_QCH_BUSY_FLAG1                         1'b0
    30      R       I2C1_QCH_BUSY_FLAG1                             1'b0
    31      R       I2C0_PWR_QCH_BUSY_FLAG1                         1'b0
 */
typedef union _PCC_REG_QCH_BUSY_FLAG1_PROC1_TYPE
{
    uint32_t d32;
    struct
    {
        uint32_t TIMER3_QCH_BUSY_FLAG1: 1;
        uint32_t TIMER2_QCH_BUSY_FLAG1: 1;
        uint32_t TIMER1_PCLK_QCH_BUSY_FLAG1: 1;
        uint32_t TIMER1_BUS_QCH_BUSY_FLAG1: 1;
        uint32_t TIMER1_QCH_BUSY_FLAG1: 1;
        uint32_t SPIC0_QCH_BUSY_FLAG1: 1;
        uint32_t SPI3W_BUS_QCH_BUSY_FLAG1: 1;
        uint32_t SPI3W_QCH_BUSY_FLAG1: 1;
        uint32_t SPI2_PWR_QCH_BUSY_FLAG1: 1;
        uint32_t SPI2_BUS_QCH_BUSY_FLAG1: 1;
        uint32_t SPI2_QCH_BUSY_FLAG1: 1;
        uint32_t SPI1_HS_BUS_QCH_BUSY_FLAG1: 1;
        uint32_t SPI1_PWR_QCH_BUSY_FLAG1: 1;
        uint32_t SPI1_BUS_QCH_BUSY_FLAG1: 1;
        uint32_t SPI1_QCH_BUSY_FLAG1: 1;
        uint32_t SPI0_HS_BUS_QCH_BUSY_FLAG1: 1;
        uint32_t SPI0_PWR_QCH_BUSY_FLAG1: 1;
        uint32_t SPI0_BUS_QCH_BUSY_FLAG1: 1;
        uint32_t SPI0_QCH_BUSY_FLAG1: 1;
        uint32_t SHA256_BUS_QCH_BUSY_FLAG1: 1;
        uint32_t RNG_BUS_QCH_BUSY_FLAG1: 1;
        uint32_t RNG_QCH_BUSY_FLAG1: 1;
        uint32_t RXI300_QCH_BUSY_FLAG1: 1;
        uint32_t KEYSCAN_BUS_QCH_BUSY_FLAG1: 1;
        uint32_t KEYSCAN_QCH_BUSY_FLAG1: 1;
        uint32_t IRRC_PWR_QCH_BUSY_FLAG1: 1;
        uint32_t IRRC_BUS_QCH_BUSY_FLAG1: 1;
        uint32_t IRRC_QCH_BUSY_FLAG1: 1;
        uint32_t I2C1_PWR_QCH_BUSY_FLAG1: 1;
        uint32_t I2C1_BUS_QCH_BUSY_FLAG1: 1;
        uint32_t I2C1_QCH_BUSY_FLAG1: 1;
        uint32_t I2C0_PWR_QCH_BUSY_FLAG1: 1;
    };
} PCC_REG_QCH_BUSY_FLAG1_PROC1_TYPE;

/*0x4000_038c PCC_REG_QCH_BUSY_FLAG1_PROC1*/
#define PCC_REG_QCH_BUSY_FLAG1_PROC1_TIMER3_QCH_BUSY_FLAG1_Pos                                   0U
#define PCC_REG_QCH_BUSY_FLAG1_PROC1_TIMER3_QCH_BUSY_FLAG1_Msk                                   (0x1UL << PCC_REG_QCH_BUSY_FLAG1_PROC1_TIMER3_QCH_BUSY_FLAG1_Pos)

#define PCC_REG_QCH_BUSY_FLAG1_PROC1_TIMER2_QCH_BUSY_FLAG1_Pos                                   1U
#define PCC_REG_QCH_BUSY_FLAG1_PROC1_TIMER2_QCH_BUSY_FLAG1_Msk                                   (0x1UL << PCC_REG_QCH_BUSY_FLAG1_PROC1_TIMER2_QCH_BUSY_FLAG1_Pos)

