rtkconnectivity/hal_realtek_mainline/bee/soc/inc/rtl87x2j/pcc_reg.h
#define PCC_REG_QCH_BUSY_FLAG1_PROC1_TIMER1_PCLK_QCH_BUSY_FLAG1_Pos                              2U
#define PCC_REG_QCH_BUSY_FLAG1_PROC1_TIMER1_PCLK_QCH_BUSY_FLAG1_Msk                              (0x1UL << PCC_REG_QCH_BUSY_FLAG1_PROC1_TIMER1_PCLK_QCH_BUSY_FLAG1_Pos)

#define PCC_REG_QCH_BUSY_FLAG1_PROC1_TIMER1_BUS_QCH_BUSY_FLAG1_Pos                               3U
#define PCC_REG_QCH_BUSY_FLAG1_PROC1_TIMER1_BUS_QCH_BUSY_FLAG1_Msk                               (0x1UL << PCC_REG_QCH_BUSY_FLAG1_PROC1_TIMER1_BUS_QCH_BUSY_FLAG1_Pos)

#define PCC_REG_QCH_BUSY_FLAG1_PROC1_TIMER1_QCH_BUSY_FLAG1_Pos                                   4U
#define PCC_REG_QCH_BUSY_FLAG1_PROC1_TIMER1_QCH_BUSY_FLAG1_Msk                                   (0x1UL << PCC_REG_QCH_BUSY_FLAG1_PROC1_TIMER1_QCH_BUSY_FLAG1_Pos)

#define PCC_REG_QCH_BUSY_FLAG1_PROC1_SPIC0_QCH_BUSY_FLAG1_Pos                                    5U
#define PCC_REG_QCH_BUSY_FLAG1_PROC1_SPIC0_QCH_BUSY_FLAG1_Msk                                    (0x1UL << PCC_REG_QCH_BUSY_FLAG1_PROC1_SPIC0_QCH_BUSY_FLAG1_Pos)

#define PCC_REG_QCH_BUSY_FLAG1_PROC1_SPI3W_BUS_QCH_BUSY_FLAG1_Pos                                6U
#define PCC_REG_QCH_BUSY_FLAG1_PROC1_SPI3W_BUS_QCH_BUSY_FLAG1_Msk                                (0x1UL << PCC_REG_QCH_BUSY_FLAG1_PROC1_SPI3W_BUS_QCH_BUSY_FLAG1_Pos)

#define PCC_REG_QCH_BUSY_FLAG1_PROC1_SPI3W_QCH_BUSY_FLAG1_Pos                                    7U
#define PCC_REG_QCH_BUSY_FLAG1_PROC1_SPI3W_QCH_BUSY_FLAG1_Msk                                    (0x1UL << PCC_REG_QCH_BUSY_FLAG1_PROC1_SPI3W_QCH_BUSY_FLAG1_Pos)

#define PCC_REG_QCH_BUSY_FLAG1_PROC1_SPI2_PWR_QCH_BUSY_FLAG1_Pos                                 8U
#define PCC_REG_QCH_BUSY_FLAG1_PROC1_SPI2_PWR_QCH_BUSY_FLAG1_Msk                                 (0x1UL << PCC_REG_QCH_BUSY_FLAG1_PROC1_SPI2_PWR_QCH_BUSY_FLAG1_Pos)

#define PCC_REG_QCH_BUSY_FLAG1_PROC1_SPI2_BUS_QCH_BUSY_FLAG1_Pos                                 9U
#define PCC_REG_QCH_BUSY_FLAG1_PROC1_SPI2_BUS_QCH_BUSY_FLAG1_Msk                                 (0x1UL << PCC_REG_QCH_BUSY_FLAG1_PROC1_SPI2_BUS_QCH_BUSY_FLAG1_Pos)

#define PCC_REG_QCH_BUSY_FLAG1_PROC1_SPI2_QCH_BUSY_FLAG1_Pos                                     10U
#define PCC_REG_QCH_BUSY_FLAG1_PROC1_SPI2_QCH_BUSY_FLAG1_Msk                                     (0x1UL << PCC_REG_QCH_BUSY_FLAG1_PROC1_SPI2_QCH_BUSY_FLAG1_Pos)

#define PCC_REG_QCH_BUSY_FLAG1_PROC1_SPI1_HS_BUS_QCH_BUSY_FLAG1_Pos                              11U
#define PCC_REG_QCH_BUSY_FLAG1_PROC1_SPI1_HS_BUS_QCH_BUSY_FLAG1_Msk                              (0x1UL << PCC_REG_QCH_BUSY_FLAG1_PROC1_SPI1_HS_BUS_QCH_BUSY_FLAG1_Pos)

#define PCC_REG_QCH_BUSY_FLAG1_PROC1_SPI1_PWR_QCH_BUSY_FLAG1_Pos                                 12U
#define PCC_REG_QCH_BUSY_FLAG1_PROC1_SPI1_PWR_QCH_BUSY_FLAG1_Msk                                 (0x1UL << PCC_REG_QCH_BUSY_FLAG1_PROC1_SPI1_PWR_QCH_BUSY_FLAG1_Pos)

#define PCC_REG_QCH_BUSY_FLAG1_PROC1_SPI1_BUS_QCH_BUSY_FLAG1_Pos                                 13U
#define PCC_REG_QCH_BUSY_FLAG1_PROC1_SPI1_BUS_QCH_BUSY_FLAG1_Msk                                 (0x1UL << PCC_REG_QCH_BUSY_FLAG1_PROC1_SPI1_BUS_QCH_BUSY_FLAG1_Pos)

#define PCC_REG_QCH_BUSY_FLAG1_PROC1_SPI1_QCH_BUSY_FLAG1_Pos                                     14U
#define PCC_REG_QCH_BUSY_FLAG1_PROC1_SPI1_QCH_BUSY_FLAG1_Msk                                     (0x1UL << PCC_REG_QCH_BUSY_FLAG1_PROC1_SPI1_QCH_BUSY_FLAG1_Pos)

#define PCC_REG_QCH_BUSY_FLAG1_PROC1_SPI0_HS_BUS_QCH_BUSY_FLAG1_Pos                              15U
#define PCC_REG_QCH_BUSY_FLAG1_PROC1_SPI0_HS_BUS_QCH_BUSY_FLAG1_Msk                              (0x1UL << PCC_REG_QCH_BUSY_FLAG1_PROC1_SPI0_HS_BUS_QCH_BUSY_FLAG1_Pos)

#define PCC_REG_QCH_BUSY_FLAG1_PROC1_SPI0_PWR_QCH_BUSY_FLAG1_Pos                                 16U
#define PCC_REG_QCH_BUSY_FLAG1_PROC1_SPI0_PWR_QCH_BUSY_FLAG1_Msk                                 (0x1UL << PCC_REG_QCH_BUSY_FLAG1_PROC1_SPI0_PWR_QCH_BUSY_FLAG1_Pos)

#define PCC_REG_QCH_BUSY_FLAG1_PROC1_SPI0_BUS_QCH_BUSY_FLAG1_Pos                                 17U
#define PCC_REG_QCH_BUSY_FLAG1_PROC1_SPI0_BUS_QCH_BUSY_FLAG1_Msk                                 (0x1UL << PCC_REG_QCH_BUSY_FLAG1_PROC1_SPI0_BUS_QCH_BUSY_FLAG1_Pos)

#define PCC_REG_QCH_BUSY_FLAG1_PROC1_SPI0_QCH_BUSY_FLAG1_Pos                                     18U
#define PCC_REG_QCH_BUSY_FLAG1_PROC1_SPI0_QCH_BUSY_FLAG1_Msk                                     (0x1UL << PCC_REG_QCH_BUSY_FLAG1_PROC1_SPI0_QCH_BUSY_FLAG1_Pos)

#define PCC_REG_QCH_BUSY_FLAG1_PROC1_SHA256_BUS_QCH_BUSY_FLAG1_Pos                               19U
#define PCC_REG_QCH_BUSY_FLAG1_PROC1_SHA256_BUS_QCH_BUSY_FLAG1_Msk                               (0x1UL << PCC_REG_QCH_BUSY_FLAG1_PROC1_SHA256_BUS_QCH_BUSY_FLAG1_Pos)

#define PCC_REG_QCH_BUSY_FLAG1_PROC1_RNG_BUS_QCH_BUSY_FLAG1_Pos                                  20U
#define PCC_REG_QCH_BUSY_FLAG1_PROC1_RNG_BUS_QCH_BUSY_FLAG1_Msk                                  (0x1UL << PCC_REG_QCH_BUSY_FLAG1_PROC1_RNG_BUS_QCH_BUSY_FLAG1_Pos)

#define PCC_REG_QCH_BUSY_FLAG1_PROC1_RNG_QCH_BUSY_FLAG1_Pos                                      21U
#define PCC_REG_QCH_BUSY_FLAG1_PROC1_RNG_QCH_BUSY_FLAG1_Msk                                      (0x1UL << PCC_REG_QCH_BUSY_FLAG1_PROC1_RNG_QCH_BUSY_FLAG1_Pos)

#define PCC_REG_QCH_BUSY_FLAG1_PROC1_RXI300_QCH_BUSY_FLAG1_Pos                                   22U
#define PCC_REG_QCH_BUSY_FLAG1_PROC1_RXI300_QCH_BUSY_FLAG1_Msk                                   (0x1UL << PCC_REG_QCH_BUSY_FLAG1_PROC1_RXI300_QCH_BUSY_FLAG1_Pos)

#define PCC_REG_QCH_BUSY_FLAG1_PROC1_KEYSCAN_BUS_QCH_BUSY_FLAG1_Pos                              23U
#define PCC_REG_QCH_BUSY_FLAG1_PROC1_KEYSCAN_BUS_QCH_BUSY_FLAG1_Msk                              (0x1UL << PCC_REG_QCH_BUSY_FLAG1_PROC1_KEYSCAN_BUS_QCH_BUSY_FLAG1_Pos)

#define PCC_REG_QCH_BUSY_FLAG1_PROC1_KEYSCAN_QCH_BUSY_FLAG1_Pos                                  24U
#define PCC_REG_QCH_BUSY_FLAG1_PROC1_KEYSCAN_QCH_BUSY_FLAG1_Msk                                  (0x1UL << PCC_REG_QCH_BUSY_FLAG1_PROC1_KEYSCAN_QCH_BUSY_FLAG1_Pos)

#define PCC_REG_QCH_BUSY_FLAG1_PROC1_IRRC_PWR_QCH_BUSY_FLAG1_Pos                                 25U
#define PCC_REG_QCH_BUSY_FLAG1_PROC1_IRRC_PWR_QCH_BUSY_FLAG1_Msk                                 (0x1UL << PCC_REG_QCH_BUSY_FLAG1_PROC1_IRRC_PWR_QCH_BUSY_FLAG1_Pos)

#define PCC_REG_QCH_BUSY_FLAG1_PROC1_IRRC_BUS_QCH_BUSY_FLAG1_Pos                                 26U
#define PCC_REG_QCH_BUSY_FLAG1_PROC1_IRRC_BUS_QCH_BUSY_FLAG1_Msk                                 (0x1UL << PCC_REG_QCH_BUSY_FLAG1_PROC1_IRRC_BUS_QCH_BUSY_FLAG1_Pos)

#define PCC_REG_QCH_BUSY_FLAG1_PROC1_IRRC_QCH_BUSY_FLAG1_Pos                                     27U
#define PCC_REG_QCH_BUSY_FLAG1_PROC1_IRRC_QCH_BUSY_FLAG1_Msk                                     (0x1UL << PCC_REG_QCH_BUSY_FLAG1_PROC1_IRRC_QCH_BUSY_FLAG1_Pos)

#define PCC_REG_QCH_BUSY_FLAG1_PROC1_I2C1_PWR_QCH_BUSY_FLAG1_Pos                                 28U
#define PCC_REG_QCH_BUSY_FLAG1_PROC1_I2C1_PWR_QCH_BUSY_FLAG1_Msk                                 (0x1UL << PCC_REG_QCH_BUSY_FLAG1_PROC1_I2C1_PWR_QCH_BUSY_FLAG1_Pos)

#define PCC_REG_QCH_BUSY_FLAG1_PROC1_I2C1_BUS_QCH_BUSY_FLAG1_Pos                                 29U
#define PCC_REG_QCH_BUSY_FLAG1_PROC1_I2C1_BUS_QCH_BUSY_FLAG1_Msk                                 (0x1UL << PCC_REG_QCH_BUSY_FLAG1_PROC1_I2C1_BUS_QCH_BUSY_FLAG1_Pos)

#define PCC_REG_QCH_BUSY_FLAG1_PROC1_I2C1_QCH_BUSY_FLAG1_Pos                                     30U
#define PCC_REG_QCH_BUSY_FLAG1_PROC1_I2C1_QCH_BUSY_FLAG1_Msk                                     (0x1UL << PCC_REG_QCH_BUSY_FLAG1_PROC1_I2C1_QCH_BUSY_FLAG1_Pos)

