rtkconnectivity/hal_realtek_mainline/bee/soc/inc/rtl87x2j/pcc_reg.h
#define PCC_REG_QCH_BUSY_FLAG1_PROC1_I2C0_PWR_QCH_BUSY_FLAG1_Pos                                 31U
#define PCC_REG_QCH_BUSY_FLAG1_PROC1_I2C0_PWR_QCH_BUSY_FLAG1_Msk                                 (0x1UL << PCC_REG_QCH_BUSY_FLAG1_PROC1_I2C0_PWR_QCH_BUSY_FLAG1_Pos)

/* 0x390    0x4000_0390
    0       R       USB_PWR_QCH_BUSY_FLAG1                          1'b0
    1       R       USB_BUS_QCH_BUSY_FLAG1                          1'b0
    2       R       USB_QCH_BUSY_FLAG1                              1'b0
    3       R       PCSM_VCORE_OP1_QCH_BUSY_FLAG1                   1'b0
    4       R       VDREG_QCH_BUSY_FLAG1                            1'b0
    5       R       UART3_PWR_QCH_BUSY_FLAG1                        1'b0
    6       R       UART3_BUS_QCH_BUSY_FLAG1                        1'b0
    7       R       UART3_QCH_BUSY_FLAG1                            1'b0
    8       R       UART2_PWR_QCH_BUSY_FLAG1                        1'b0
    9       R       UART2_BUS_QCH_BUSY_FLAG1                        1'b0
    10      R       UART2_QCH_BUSY_FLAG1                            1'b0
    11      R       UART1_PWR_QCH_BUSY_FLAG1                        1'b0
    12      R       UART1_BUS_QCH_BUSY_FLAG1                        1'b0
    13      R       UART1_QCH_BUSY_FLAG1                            1'b0
    14      R       UART0_PWR_QCH_BUSY_FLAG1                        1'b0
    15      R       UART0_BUS_QCH_BUSY_FLAG1                        1'b0
    16      R       UART0_QCH_BUSY_FLAG1                            1'b0
    17      R       TMETER_BUS_QCH_BUSY_FLAG1                       1'b0
    18      R       TMETER_QCH_BUSY_FLAG1                           1'b0
    19      R       TIMER11_PWM_QCH_BUSY_FLAG1                      1'b0
    20      R       TIMER11_QCH_BUSY_FLAG1                          1'b0
    21      R       TIMER10_PWM_QCH_BUSY_FLAG1                      1'b0
    22      R       TIMER10_QCH_BUSY_FLAG1                          1'b0
    23      R       TIMER9_PCLK_QCH_BUSY_FLAG1                      1'b0
    24      R       TIMER9_PWM_QCH_BUSY_FLAG1                       1'b0
    25      R       TIMER9_BUS_QCH_BUSY_FLAG1                       1'b0
    26      R       TIMER9_QCH_BUSY_FLAG1                           1'b0
    27      R       TIMER8_QCH_BUSY_FLAG1                           1'b0
    28      R       TIMER7_QCH_BUSY_FLAG1                           1'b0
    29      R       TIMER6_QCH_BUSY_FLAG1                           1'b0
    30      R       TIMER5_QCH_BUSY_FLAG1                           1'b0
    31      R       TIMER4_QCH_BUSY_FLAG1                           1'b0
 */
typedef union _PCC_REG_QCH_BUSY_FLAG1_PROC2_TYPE
{
    uint32_t d32;
    struct
    {
        uint32_t USB_PWR_QCH_BUSY_FLAG1: 1;
        uint32_t USB_BUS_QCH_BUSY_FLAG1: 1;
        uint32_t USB_QCH_BUSY_FLAG1: 1;
        uint32_t PCSM_VCORE_OP1_QCH_BUSY_FLAG1: 1;
        uint32_t VDREG_QCH_BUSY_FLAG1: 1;
        uint32_t UART3_PWR_QCH_BUSY_FLAG1: 1;
        uint32_t UART3_BUS_QCH_BUSY_FLAG1: 1;
        uint32_t UART3_QCH_BUSY_FLAG1: 1;
        uint32_t UART2_PWR_QCH_BUSY_FLAG1: 1;
        uint32_t UART2_BUS_QCH_BUSY_FLAG1: 1;
        uint32_t UART2_QCH_BUSY_FLAG1: 1;
        uint32_t UART1_PWR_QCH_BUSY_FLAG1: 1;
        uint32_t UART1_BUS_QCH_BUSY_FLAG1: 1;
        uint32_t UART1_QCH_BUSY_FLAG1: 1;
        uint32_t UART0_PWR_QCH_BUSY_FLAG1: 1;
        uint32_t UART0_BUS_QCH_BUSY_FLAG1: 1;
        uint32_t UART0_QCH_BUSY_FLAG1: 1;
        uint32_t TMETER_BUS_QCH_BUSY_FLAG1: 1;
        uint32_t TMETER_QCH_BUSY_FLAG1: 1;
        uint32_t TIMER11_PWM_QCH_BUSY_FLAG1: 1;
        uint32_t TIMER11_QCH_BUSY_FLAG1: 1;
        uint32_t TIMER10_PWM_QCH_BUSY_FLAG1: 1;
        uint32_t TIMER10_QCH_BUSY_FLAG1: 1;
        uint32_t TIMER9_PCLK_QCH_BUSY_FLAG1: 1;
        uint32_t TIMER9_PWM_QCH_BUSY_FLAG1: 1;
        uint32_t TIMER9_BUS_QCH_BUSY_FLAG1: 1;
        uint32_t TIMER9_QCH_BUSY_FLAG1: 1;
        uint32_t TIMER8_QCH_BUSY_FLAG1: 1;
        uint32_t TIMER7_QCH_BUSY_FLAG1: 1;
        uint32_t TIMER6_QCH_BUSY_FLAG1: 1;
        uint32_t TIMER5_QCH_BUSY_FLAG1: 1;
        uint32_t TIMER4_QCH_BUSY_FLAG1: 1;
    };
} PCC_REG_QCH_BUSY_FLAG1_PROC2_TYPE;

/*0x4000_0390 PCC_REG_QCH_BUSY_FLAG1_PROC2*/
#define PCC_REG_QCH_BUSY_FLAG1_PROC2_USB_PWR_QCH_BUSY_FLAG1_Pos                                  0U
#define PCC_REG_QCH_BUSY_FLAG1_PROC2_USB_PWR_QCH_BUSY_FLAG1_Msk                                  (0x1UL << PCC_REG_QCH_BUSY_FLAG1_PROC2_USB_PWR_QCH_BUSY_FLAG1_Pos)

#define PCC_REG_QCH_BUSY_FLAG1_PROC2_USB_BUS_QCH_BUSY_FLAG1_Pos                                  1U
#define PCC_REG_QCH_BUSY_FLAG1_PROC2_USB_BUS_QCH_BUSY_FLAG1_Msk                                  (0x1UL << PCC_REG_QCH_BUSY_FLAG1_PROC2_USB_BUS_QCH_BUSY_FLAG1_Pos)

#define PCC_REG_QCH_BUSY_FLAG1_PROC2_USB_QCH_BUSY_FLAG1_Pos                                      2U
#define PCC_REG_QCH_BUSY_FLAG1_PROC2_USB_QCH_BUSY_FLAG1_Msk                                      (0x1UL << PCC_REG_QCH_BUSY_FLAG1_PROC2_USB_QCH_BUSY_FLAG1_Pos)

#define PCC_REG_QCH_BUSY_FLAG1_PROC2_PCSM_VCORE_OP1_QCH_BUSY_FLAG1_Pos                           3U
#define PCC_REG_QCH_BUSY_FLAG1_PROC2_PCSM_VCORE_OP1_QCH_BUSY_FLAG1_Msk                           (0x1UL << PCC_REG_QCH_BUSY_FLAG1_PROC2_PCSM_VCORE_OP1_QCH_BUSY_FLAG1_Pos)

#define PCC_REG_QCH_BUSY_FLAG1_PROC2_VDREG_QCH_BUSY_FLAG1_Pos                                    4U
#define PCC_REG_QCH_BUSY_FLAG1_PROC2_VDREG_QCH_BUSY_FLAG1_Msk                                    (0x1UL << PCC_REG_QCH_BUSY_FLAG1_PROC2_VDREG_QCH_BUSY_FLAG1_Pos)

#define PCC_REG_QCH_BUSY_FLAG1_PROC2_UART3_PWR_QCH_BUSY_FLAG1_Pos                                5U
#define PCC_REG_QCH_BUSY_FLAG1_PROC2_UART3_PWR_QCH_BUSY_FLAG1_Msk                                (0x1UL << PCC_REG_QCH_BUSY_FLAG1_PROC2_UART3_PWR_QCH_BUSY_FLAG1_Pos)

#define PCC_REG_QCH_BUSY_FLAG1_PROC2_UART3_BUS_QCH_BUSY_FLAG1_Pos                                6U
#define PCC_REG_QCH_BUSY_FLAG1_PROC2_UART3_BUS_QCH_BUSY_FLAG1_Msk                                (0x1UL << PCC_REG_QCH_BUSY_FLAG1_PROC2_UART3_BUS_QCH_BUSY_FLAG1_Pos)

