rtkconnectivity/hal_realtek_mainline/bee/soc/inc/rtl87x2j/pcc_reg.h
/* 0x394    0x4000_0394
    0       R       I2C0_BUS_QCH_BUSY_FLAG0                         1'b1
    1       R       I2C0_QCH_BUSY_FLAG0                             1'b1
    2       R       GPIO_DBNC_QCH_BUSY_FLAG0                        1'b1
    3       R       GPIO_BUS_QCH_BUSY_FLAG0                         1'b1
    4       R       GPIO_QCH_BUSY_FLAG0                             1'b1
    5       R       GDMA_BUS_QCH_BUSY_FLAG0                         1'b1
    6       R       ETIMER_PCLK_QCH_BUSY_FLAG0                      1'b1
    7       R       ETIMER_PWM_QCH_BUSY_FLAG0                       1'b1
    8       R       ETIMER_BUS_QCH_BUSY_FLAG0                       1'b1
    9       R       ETIMER_QCH_BUSY_FLAG0                           1'b1
    10      R       EFLASH_BUS_QCH_BUSY_FLAG0                       1'b1
    11      R       EFLASH_QCH_BUSY_FLAG0                           1'b1
    12      R       CPU_BUS_QCH_BUSY_FLAG0                          1'b1
    13      R       CAN_LP_QCH_BUSY_FLAG0                           1'b1
    14      R       CAN_BUS_QCH_BUSY_FLAG0                          1'b1
    15      R       CAN_PWR_QCH_BUSY_FLAG0                          1'b1
    16      R       CAN_QCH_BUSY_FLAG0                              1'b1
    17      R       AES_QCH_BUSY_FLAG0                              1'b1
    31:18   R       RESERVED                                        14'd0
 */
typedef union _PCC_REG_QCH_BUSY_FLAG0_PROC0_TYPE
{
    uint32_t d32;
    struct
    {
        uint32_t I2C0_BUS_QCH_BUSY_FLAG0: 1;
        uint32_t I2C0_QCH_BUSY_FLAG0: 1;
        uint32_t GPIO_DBNC_QCH_BUSY_FLAG0: 1;
        uint32_t GPIO_BUS_QCH_BUSY_FLAG0: 1;
        uint32_t GPIO_QCH_BUSY_FLAG0: 1;
        uint32_t GDMA_BUS_QCH_BUSY_FLAG0: 1;
        uint32_t ETIMER_PCLK_QCH_BUSY_FLAG0: 1;
        uint32_t ETIMER_PWM_QCH_BUSY_FLAG0: 1;
        uint32_t ETIMER_BUS_QCH_BUSY_FLAG0: 1;
        uint32_t ETIMER_QCH_BUSY_FLAG0: 1;
        uint32_t EFLASH_BUS_QCH_BUSY_FLAG0: 1;
        uint32_t EFLASH_QCH_BUSY_FLAG0: 1;
        uint32_t CPU_BUS_QCH_BUSY_FLAG0: 1;
        uint32_t CAN_LP_QCH_BUSY_FLAG0: 1;
        uint32_t CAN_BUS_QCH_BUSY_FLAG0: 1;
        uint32_t CAN_PWR_QCH_BUSY_FLAG0: 1;
        uint32_t CAN_QCH_BUSY_FLAG0: 1;
        uint32_t AES_QCH_BUSY_FLAG0: 1;
        uint32_t RESERVED: 14;
    };
} PCC_REG_QCH_BUSY_FLAG0_PROC0_TYPE;

/*0x4000_0394 PCC_REG_QCH_BUSY_FLAG0_PROC0*/
#define PCC_REG_QCH_BUSY_FLAG0_PROC0_I2C0_BUS_QCH_BUSY_FLAG0_Pos                                 0U
#define PCC_REG_QCH_BUSY_FLAG0_PROC0_I2C0_BUS_QCH_BUSY_FLAG0_Msk                                 (0x1UL << PCC_REG_QCH_BUSY_FLAG0_PROC0_I2C0_BUS_QCH_BUSY_FLAG0_Pos)

#define PCC_REG_QCH_BUSY_FLAG0_PROC0_I2C0_QCH_BUSY_FLAG0_Pos                                     1U
#define PCC_REG_QCH_BUSY_FLAG0_PROC0_I2C0_QCH_BUSY_FLAG0_Msk                                     (0x1UL << PCC_REG_QCH_BUSY_FLAG0_PROC0_I2C0_QCH_BUSY_FLAG0_Pos)

#define PCC_REG_QCH_BUSY_FLAG0_PROC0_GPIO_DBNC_QCH_BUSY_FLAG0_Pos                                2U
#define PCC_REG_QCH_BUSY_FLAG0_PROC0_GPIO_DBNC_QCH_BUSY_FLAG0_Msk                                (0x1UL << PCC_REG_QCH_BUSY_FLAG0_PROC0_GPIO_DBNC_QCH_BUSY_FLAG0_Pos)

#define PCC_REG_QCH_BUSY_FLAG0_PROC0_GPIO_BUS_QCH_BUSY_FLAG0_Pos                                 3U
#define PCC_REG_QCH_BUSY_FLAG0_PROC0_GPIO_BUS_QCH_BUSY_FLAG0_Msk                                 (0x1UL << PCC_REG_QCH_BUSY_FLAG0_PROC0_GPIO_BUS_QCH_BUSY_FLAG0_Pos)

#define PCC_REG_QCH_BUSY_FLAG0_PROC0_GPIO_QCH_BUSY_FLAG0_Pos                                     4U
#define PCC_REG_QCH_BUSY_FLAG0_PROC0_GPIO_QCH_BUSY_FLAG0_Msk                                     (0x1UL << PCC_REG_QCH_BUSY_FLAG0_PROC0_GPIO_QCH_BUSY_FLAG0_Pos)

#define PCC_REG_QCH_BUSY_FLAG0_PROC0_GDMA_BUS_QCH_BUSY_FLAG0_Pos                                 5U
#define PCC_REG_QCH_BUSY_FLAG0_PROC0_GDMA_BUS_QCH_BUSY_FLAG0_Msk                                 (0x1UL << PCC_REG_QCH_BUSY_FLAG0_PROC0_GDMA_BUS_QCH_BUSY_FLAG0_Pos)

#define PCC_REG_QCH_BUSY_FLAG0_PROC0_ETIMER_PCLK_QCH_BUSY_FLAG0_Pos                              6U
#define PCC_REG_QCH_BUSY_FLAG0_PROC0_ETIMER_PCLK_QCH_BUSY_FLAG0_Msk                              (0x1UL << PCC_REG_QCH_BUSY_FLAG0_PROC0_ETIMER_PCLK_QCH_BUSY_FLAG0_Pos)

#define PCC_REG_QCH_BUSY_FLAG0_PROC0_ETIMER_PWM_QCH_BUSY_FLAG0_Pos                               7U
#define PCC_REG_QCH_BUSY_FLAG0_PROC0_ETIMER_PWM_QCH_BUSY_FLAG0_Msk                               (0x1UL << PCC_REG_QCH_BUSY_FLAG0_PROC0_ETIMER_PWM_QCH_BUSY_FLAG0_Pos)

#define PCC_REG_QCH_BUSY_FLAG0_PROC0_ETIMER_BUS_QCH_BUSY_FLAG0_Pos                               8U
#define PCC_REG_QCH_BUSY_FLAG0_PROC0_ETIMER_BUS_QCH_BUSY_FLAG0_Msk                               (0x1UL << PCC_REG_QCH_BUSY_FLAG0_PROC0_ETIMER_BUS_QCH_BUSY_FLAG0_Pos)

#define PCC_REG_QCH_BUSY_FLAG0_PROC0_ETIMER_QCH_BUSY_FLAG0_Pos                                   9U
#define PCC_REG_QCH_BUSY_FLAG0_PROC0_ETIMER_QCH_BUSY_FLAG0_Msk                                   (0x1UL << PCC_REG_QCH_BUSY_FLAG0_PROC0_ETIMER_QCH_BUSY_FLAG0_Pos)

#define PCC_REG_QCH_BUSY_FLAG0_PROC0_EFLASH_BUS_QCH_BUSY_FLAG0_Pos                               10U
#define PCC_REG_QCH_BUSY_FLAG0_PROC0_EFLASH_BUS_QCH_BUSY_FLAG0_Msk                               (0x1UL << PCC_REG_QCH_BUSY_FLAG0_PROC0_EFLASH_BUS_QCH_BUSY_FLAG0_Pos)

#define PCC_REG_QCH_BUSY_FLAG0_PROC0_EFLASH_QCH_BUSY_FLAG0_Pos                                   11U
#define PCC_REG_QCH_BUSY_FLAG0_PROC0_EFLASH_QCH_BUSY_FLAG0_Msk                                   (0x1UL << PCC_REG_QCH_BUSY_FLAG0_PROC0_EFLASH_QCH_BUSY_FLAG0_Pos)

#define PCC_REG_QCH_BUSY_FLAG0_PROC0_CPU_BUS_QCH_BUSY_FLAG0_Pos                                  12U
#define PCC_REG_QCH_BUSY_FLAG0_PROC0_CPU_BUS_QCH_BUSY_FLAG0_Msk                                  (0x1UL << PCC_REG_QCH_BUSY_FLAG0_PROC0_CPU_BUS_QCH_BUSY_FLAG0_Pos)

#define PCC_REG_QCH_BUSY_FLAG0_PROC0_CAN_LP_QCH_BUSY_FLAG0_Pos                                   13U
#define PCC_REG_QCH_BUSY_FLAG0_PROC0_CAN_LP_QCH_BUSY_FLAG0_Msk                                   (0x1UL << PCC_REG_QCH_BUSY_FLAG0_PROC0_CAN_LP_QCH_BUSY_FLAG0_Pos)

#define PCC_REG_QCH_BUSY_FLAG0_PROC0_CAN_BUS_QCH_BUSY_FLAG0_Pos                                  14U
#define PCC_REG_QCH_BUSY_FLAG0_PROC0_CAN_BUS_QCH_BUSY_FLAG0_Msk                                  (0x1UL << PCC_REG_QCH_BUSY_FLAG0_PROC0_CAN_BUS_QCH_BUSY_FLAG0_Pos)

#define PCC_REG_QCH_BUSY_FLAG0_PROC0_CAN_PWR_QCH_BUSY_FLAG0_Pos                                  15U
#define PCC_REG_QCH_BUSY_FLAG0_PROC0_CAN_PWR_QCH_BUSY_FLAG0_Msk                                  (0x1UL << PCC_REG_QCH_BUSY_FLAG0_PROC0_CAN_PWR_QCH_BUSY_FLAG0_Pos)

