rtkconnectivity/hal_realtek_mainline/bee/soc/inc/rtl87x2j/pcc_reg.h
#define PCC_REG_QCH_BUSY_FLAG0_PROC0_CAN_QCH_BUSY_FLAG0_Pos                                      16U
#define PCC_REG_QCH_BUSY_FLAG0_PROC0_CAN_QCH_BUSY_FLAG0_Msk                                      (0x1UL << PCC_REG_QCH_BUSY_FLAG0_PROC0_CAN_QCH_BUSY_FLAG0_Pos)

#define PCC_REG_QCH_BUSY_FLAG0_PROC0_AES_QCH_BUSY_FLAG0_Pos                                      17U
#define PCC_REG_QCH_BUSY_FLAG0_PROC0_AES_QCH_BUSY_FLAG0_Msk                                      (0x1UL << PCC_REG_QCH_BUSY_FLAG0_PROC0_AES_QCH_BUSY_FLAG0_Pos)

#define PCC_REG_QCH_BUSY_FLAG0_PROC0_RESERVED_Pos                                                18U
#define PCC_REG_QCH_BUSY_FLAG0_PROC0_RESERVED_Msk                                                (0x3FFFUL << PCC_REG_QCH_BUSY_FLAG0_PROC0_RESERVED_Pos)

/* 0x398    0x4000_0398
    0       R       TIMER3_QCH_BUSY_FLAG0                           1'b1
    1       R       TIMER2_QCH_BUSY_FLAG0                           1'b1
    2       R       TIMER1_PCLK_QCH_BUSY_FLAG0                      1'b1
    3       R       TIMER1_BUS_QCH_BUSY_FLAG0                       1'b1
    4       R       TIMER1_QCH_BUSY_FLAG0                           1'b1
    5       R       SPIC0_QCH_BUSY_FLAG0                            1'b1
    6       R       SPI3W_BUS_QCH_BUSY_FLAG0                        1'b1
    7       R       SPI3W_QCH_BUSY_FLAG0                            1'b1
    8       R       SPI2_PWR_QCH_BUSY_FLAG0                         1'b1
    9       R       SPI2_BUS_QCH_BUSY_FLAG0                         1'b1
    10      R       SPI2_QCH_BUSY_FLAG0                             1'b1
    11      R       SPI1_HS_BUS_QCH_BUSY_FLAG0                      1'b1
    12      R       SPI1_PWR_QCH_BUSY_FLAG0                         1'b1
    13      R       SPI1_BUS_QCH_BUSY_FLAG0                         1'b1
    14      R       SPI1_QCH_BUSY_FLAG0                             1'b1
    15      R       SPI0_HS_BUS_QCH_BUSY_FLAG0                      1'b1
    16      R       SPI0_PWR_QCH_BUSY_FLAG0                         1'b1
    17      R       SPI0_BUS_QCH_BUSY_FLAG0                         1'b1
    18      R       SPI0_QCH_BUSY_FLAG0                             1'b1
    19      R       SHA256_BUS_QCH_BUSY_FLAG0                       1'b1
    20      R       RNG_BUS_QCH_BUSY_FLAG0                          1'b1
    21      R       RNG_QCH_BUSY_FLAG0                              1'b1
    22      R       RXI300_QCH_BUSY_FLAG0                           1'b1
    23      R       KEYSCAN_BUS_QCH_BUSY_FLAG0                      1'b1
    24      R       KEYSCAN_QCH_BUSY_FLAG0                          1'b1
    25      R       IRRC_PWR_QCH_BUSY_FLAG0                         1'b1
    26      R       IRRC_BUS_QCH_BUSY_FLAG0                         1'b1
    27      R       IRRC_QCH_BUSY_FLAG0                             1'b1
    28      R       I2C1_PWR_QCH_BUSY_FLAG0                         1'b1
    29      R       I2C1_BUS_QCH_BUSY_FLAG0                         1'b1
    30      R       I2C1_QCH_BUSY_FLAG0                             1'b1
    31      R       I2C0_PWR_QCH_BUSY_FLAG0                         1'b1
 */
typedef union _PCC_REG_QCH_BUSY_FLAG0_PROC1_TYPE
{
    uint32_t d32;
    struct
    {
        uint32_t TIMER3_QCH_BUSY_FLAG0: 1;
        uint32_t TIMER2_QCH_BUSY_FLAG0: 1;
        uint32_t TIMER1_PCLK_QCH_BUSY_FLAG0: 1;
        uint32_t TIMER1_BUS_QCH_BUSY_FLAG0: 1;
        uint32_t TIMER1_QCH_BUSY_FLAG0: 1;
        uint32_t SPIC0_QCH_BUSY_FLAG0: 1;
        uint32_t SPI3W_BUS_QCH_BUSY_FLAG0: 1;
        uint32_t SPI3W_QCH_BUSY_FLAG0: 1;
        uint32_t SPI2_PWR_QCH_BUSY_FLAG0: 1;
        uint32_t SPI2_BUS_QCH_BUSY_FLAG0: 1;
        uint32_t SPI2_QCH_BUSY_FLAG0: 1;
        uint32_t SPI1_HS_BUS_QCH_BUSY_FLAG0: 1;
        uint32_t SPI1_PWR_QCH_BUSY_FLAG0: 1;
        uint32_t SPI1_BUS_QCH_BUSY_FLAG0: 1;
        uint32_t SPI1_QCH_BUSY_FLAG0: 1;
        uint32_t SPI0_HS_BUS_QCH_BUSY_FLAG0: 1;
        uint32_t SPI0_PWR_QCH_BUSY_FLAG0: 1;
        uint32_t SPI0_BUS_QCH_BUSY_FLAG0: 1;
        uint32_t SPI0_QCH_BUSY_FLAG0: 1;
        uint32_t SHA256_BUS_QCH_BUSY_FLAG0: 1;
        uint32_t RNG_BUS_QCH_BUSY_FLAG0: 1;
        uint32_t RNG_QCH_BUSY_FLAG0: 1;
        uint32_t RXI300_QCH_BUSY_FLAG0: 1;
        uint32_t KEYSCAN_BUS_QCH_BUSY_FLAG0: 1;
        uint32_t KEYSCAN_QCH_BUSY_FLAG0: 1;
        uint32_t IRRC_PWR_QCH_BUSY_FLAG0: 1;
        uint32_t IRRC_BUS_QCH_BUSY_FLAG0: 1;
        uint32_t IRRC_QCH_BUSY_FLAG0: 1;
        uint32_t I2C1_PWR_QCH_BUSY_FLAG0: 1;
        uint32_t I2C1_BUS_QCH_BUSY_FLAG0: 1;
        uint32_t I2C1_QCH_BUSY_FLAG0: 1;
        uint32_t I2C0_PWR_QCH_BUSY_FLAG0: 1;
    };
} PCC_REG_QCH_BUSY_FLAG0_PROC1_TYPE;

/*0x4000_0398 PCC_REG_QCH_BUSY_FLAG0_PROC1*/
#define PCC_REG_QCH_BUSY_FLAG0_PROC1_TIMER3_QCH_BUSY_FLAG0_Pos                                   0U
#define PCC_REG_QCH_BUSY_FLAG0_PROC1_TIMER3_QCH_BUSY_FLAG0_Msk                                   (0x1UL << PCC_REG_QCH_BUSY_FLAG0_PROC1_TIMER3_QCH_BUSY_FLAG0_Pos)

#define PCC_REG_QCH_BUSY_FLAG0_PROC1_TIMER2_QCH_BUSY_FLAG0_Pos                                   1U
#define PCC_REG_QCH_BUSY_FLAG0_PROC1_TIMER2_QCH_BUSY_FLAG0_Msk                                   (0x1UL << PCC_REG_QCH_BUSY_FLAG0_PROC1_TIMER2_QCH_BUSY_FLAG0_Pos)

#define PCC_REG_QCH_BUSY_FLAG0_PROC1_TIMER1_PCLK_QCH_BUSY_FLAG0_Pos                              2U
#define PCC_REG_QCH_BUSY_FLAG0_PROC1_TIMER1_PCLK_QCH_BUSY_FLAG0_Msk                              (0x1UL << PCC_REG_QCH_BUSY_FLAG0_PROC1_TIMER1_PCLK_QCH_BUSY_FLAG0_Pos)

#define PCC_REG_QCH_BUSY_FLAG0_PROC1_TIMER1_BUS_QCH_BUSY_FLAG0_Pos                               3U
#define PCC_REG_QCH_BUSY_FLAG0_PROC1_TIMER1_BUS_QCH_BUSY_FLAG0_Msk                               (0x1UL << PCC_REG_QCH_BUSY_FLAG0_PROC1_TIMER1_BUS_QCH_BUSY_FLAG0_Pos)

#define PCC_REG_QCH_BUSY_FLAG0_PROC1_TIMER1_QCH_BUSY_FLAG0_Pos                                   4U
#define PCC_REG_QCH_BUSY_FLAG0_PROC1_TIMER1_QCH_BUSY_FLAG0_Msk                                   (0x1UL << PCC_REG_QCH_BUSY_FLAG0_PROC1_TIMER1_QCH_BUSY_FLAG0_Pos)

#define PCC_REG_QCH_BUSY_FLAG0_PROC1_SPIC0_QCH_BUSY_FLAG0_Pos                                    5U
#define PCC_REG_QCH_BUSY_FLAG0_PROC1_SPIC0_QCH_BUSY_FLAG0_Msk                                    (0x1UL << PCC_REG_QCH_BUSY_FLAG0_PROC1_SPIC0_QCH_BUSY_FLAG0_Pos)

#define PCC_REG_QCH_BUSY_FLAG0_PROC1_SPI3W_BUS_QCH_BUSY_FLAG0_Pos                                6U
#define PCC_REG_QCH_BUSY_FLAG0_PROC1_SPI3W_BUS_QCH_BUSY_FLAG0_Msk                                (0x1UL << PCC_REG_QCH_BUSY_FLAG0_PROC1_SPI3W_BUS_QCH_BUSY_FLAG0_Pos)

#define PCC_REG_QCH_BUSY_FLAG0_PROC1_SPI3W_QCH_BUSY_FLAG0_Pos                                    7U
#define PCC_REG_QCH_BUSY_FLAG0_PROC1_SPI3W_QCH_BUSY_FLAG0_Msk                                    (0x1UL << PCC_REG_QCH_BUSY_FLAG0_PROC1_SPI3W_QCH_BUSY_FLAG0_Pos)

#define PCC_REG_QCH_BUSY_FLAG0_PROC1_SPI2_PWR_QCH_BUSY_FLAG0_Pos                                 8U
#define PCC_REG_QCH_BUSY_FLAG0_PROC1_SPI2_PWR_QCH_BUSY_FLAG0_Msk                                 (0x1UL << PCC_REG_QCH_BUSY_FLAG0_PROC1_SPI2_PWR_QCH_BUSY_FLAG0_Pos)

#define PCC_REG_QCH_BUSY_FLAG0_PROC1_SPI2_BUS_QCH_BUSY_FLAG0_Pos                                 9U
#define PCC_REG_QCH_BUSY_FLAG0_PROC1_SPI2_BUS_QCH_BUSY_FLAG0_Msk                                 (0x1UL << PCC_REG_QCH_BUSY_FLAG0_PROC1_SPI2_BUS_QCH_BUSY_FLAG0_Pos)

#define PCC_REG_QCH_BUSY_FLAG0_PROC1_SPI2_QCH_BUSY_FLAG0_Pos                                     10U
#define PCC_REG_QCH_BUSY_FLAG0_PROC1_SPI2_QCH_BUSY_FLAG0_Msk                                     (0x1UL << PCC_REG_QCH_BUSY_FLAG0_PROC1_SPI2_QCH_BUSY_FLAG0_Pos)

#define PCC_REG_QCH_BUSY_FLAG0_PROC1_SPI1_HS_BUS_QCH_BUSY_FLAG0_Pos                              11U
#define PCC_REG_QCH_BUSY_FLAG0_PROC1_SPI1_HS_BUS_QCH_BUSY_FLAG0_Msk                              (0x1UL << PCC_REG_QCH_BUSY_FLAG0_PROC1_SPI1_HS_BUS_QCH_BUSY_FLAG0_Pos)

#define PCC_REG_QCH_BUSY_FLAG0_PROC1_SPI1_PWR_QCH_BUSY_FLAG0_Pos                                 12U
#define PCC_REG_QCH_BUSY_FLAG0_PROC1_SPI1_PWR_QCH_BUSY_FLAG0_Msk                                 (0x1UL << PCC_REG_QCH_BUSY_FLAG0_PROC1_SPI1_PWR_QCH_BUSY_FLAG0_Pos)

