rtkconnectivity/hal_realtek_mainline/bee/soc/inc/rtl87x2j/pcc_reg.h
#define PCC_REG_QCH_BUSY_FLAG0_PROC1_SPI1_BUS_QCH_BUSY_FLAG0_Pos                                 13U
#define PCC_REG_QCH_BUSY_FLAG0_PROC1_SPI1_BUS_QCH_BUSY_FLAG0_Msk                                 (0x1UL << PCC_REG_QCH_BUSY_FLAG0_PROC1_SPI1_BUS_QCH_BUSY_FLAG0_Pos)

#define PCC_REG_QCH_BUSY_FLAG0_PROC1_SPI1_QCH_BUSY_FLAG0_Pos                                     14U
#define PCC_REG_QCH_BUSY_FLAG0_PROC1_SPI1_QCH_BUSY_FLAG0_Msk                                     (0x1UL << PCC_REG_QCH_BUSY_FLAG0_PROC1_SPI1_QCH_BUSY_FLAG0_Pos)

#define PCC_REG_QCH_BUSY_FLAG0_PROC1_SPI0_HS_BUS_QCH_BUSY_FLAG0_Pos                              15U
#define PCC_REG_QCH_BUSY_FLAG0_PROC1_SPI0_HS_BUS_QCH_BUSY_FLAG0_Msk                              (0x1UL << PCC_REG_QCH_BUSY_FLAG0_PROC1_SPI0_HS_BUS_QCH_BUSY_FLAG0_Pos)

#define PCC_REG_QCH_BUSY_FLAG0_PROC1_SPI0_PWR_QCH_BUSY_FLAG0_Pos                                 16U
#define PCC_REG_QCH_BUSY_FLAG0_PROC1_SPI0_PWR_QCH_BUSY_FLAG0_Msk                                 (0x1UL << PCC_REG_QCH_BUSY_FLAG0_PROC1_SPI0_PWR_QCH_BUSY_FLAG0_Pos)

#define PCC_REG_QCH_BUSY_FLAG0_PROC1_SPI0_BUS_QCH_BUSY_FLAG0_Pos                                 17U
#define PCC_REG_QCH_BUSY_FLAG0_PROC1_SPI0_BUS_QCH_BUSY_FLAG0_Msk                                 (0x1UL << PCC_REG_QCH_BUSY_FLAG0_PROC1_SPI0_BUS_QCH_BUSY_FLAG0_Pos)

#define PCC_REG_QCH_BUSY_FLAG0_PROC1_SPI0_QCH_BUSY_FLAG0_Pos                                     18U
#define PCC_REG_QCH_BUSY_FLAG0_PROC1_SPI0_QCH_BUSY_FLAG0_Msk                                     (0x1UL << PCC_REG_QCH_BUSY_FLAG0_PROC1_SPI0_QCH_BUSY_FLAG0_Pos)

#define PCC_REG_QCH_BUSY_FLAG0_PROC1_SHA256_BUS_QCH_BUSY_FLAG0_Pos                               19U
#define PCC_REG_QCH_BUSY_FLAG0_PROC1_SHA256_BUS_QCH_BUSY_FLAG0_Msk                               (0x1UL << PCC_REG_QCH_BUSY_FLAG0_PROC1_SHA256_BUS_QCH_BUSY_FLAG0_Pos)

#define PCC_REG_QCH_BUSY_FLAG0_PROC1_RNG_BUS_QCH_BUSY_FLAG0_Pos                                  20U
#define PCC_REG_QCH_BUSY_FLAG0_PROC1_RNG_BUS_QCH_BUSY_FLAG0_Msk                                  (0x1UL << PCC_REG_QCH_BUSY_FLAG0_PROC1_RNG_BUS_QCH_BUSY_FLAG0_Pos)

#define PCC_REG_QCH_BUSY_FLAG0_PROC1_RNG_QCH_BUSY_FLAG0_Pos                                      21U
#define PCC_REG_QCH_BUSY_FLAG0_PROC1_RNG_QCH_BUSY_FLAG0_Msk                                      (0x1UL << PCC_REG_QCH_BUSY_FLAG0_PROC1_RNG_QCH_BUSY_FLAG0_Pos)

#define PCC_REG_QCH_BUSY_FLAG0_PROC1_RXI300_QCH_BUSY_FLAG0_Pos                                   22U
#define PCC_REG_QCH_BUSY_FLAG0_PROC1_RXI300_QCH_BUSY_FLAG0_Msk                                   (0x1UL << PCC_REG_QCH_BUSY_FLAG0_PROC1_RXI300_QCH_BUSY_FLAG0_Pos)

#define PCC_REG_QCH_BUSY_FLAG0_PROC1_KEYSCAN_BUS_QCH_BUSY_FLAG0_Pos                              23U
#define PCC_REG_QCH_BUSY_FLAG0_PROC1_KEYSCAN_BUS_QCH_BUSY_FLAG0_Msk                              (0x1UL << PCC_REG_QCH_BUSY_FLAG0_PROC1_KEYSCAN_BUS_QCH_BUSY_FLAG0_Pos)

#define PCC_REG_QCH_BUSY_FLAG0_PROC1_KEYSCAN_QCH_BUSY_FLAG0_Pos                                  24U
#define PCC_REG_QCH_BUSY_FLAG0_PROC1_KEYSCAN_QCH_BUSY_FLAG0_Msk                                  (0x1UL << PCC_REG_QCH_BUSY_FLAG0_PROC1_KEYSCAN_QCH_BUSY_FLAG0_Pos)

#define PCC_REG_QCH_BUSY_FLAG0_PROC1_IRRC_PWR_QCH_BUSY_FLAG0_Pos                                 25U
#define PCC_REG_QCH_BUSY_FLAG0_PROC1_IRRC_PWR_QCH_BUSY_FLAG0_Msk                                 (0x1UL << PCC_REG_QCH_BUSY_FLAG0_PROC1_IRRC_PWR_QCH_BUSY_FLAG0_Pos)

#define PCC_REG_QCH_BUSY_FLAG0_PROC1_IRRC_BUS_QCH_BUSY_FLAG0_Pos                                 26U
#define PCC_REG_QCH_BUSY_FLAG0_PROC1_IRRC_BUS_QCH_BUSY_FLAG0_Msk                                 (0x1UL << PCC_REG_QCH_BUSY_FLAG0_PROC1_IRRC_BUS_QCH_BUSY_FLAG0_Pos)

#define PCC_REG_QCH_BUSY_FLAG0_PROC1_IRRC_QCH_BUSY_FLAG0_Pos                                     27U
#define PCC_REG_QCH_BUSY_FLAG0_PROC1_IRRC_QCH_BUSY_FLAG0_Msk                                     (0x1UL << PCC_REG_QCH_BUSY_FLAG0_PROC1_IRRC_QCH_BUSY_FLAG0_Pos)

#define PCC_REG_QCH_BUSY_FLAG0_PROC1_I2C1_PWR_QCH_BUSY_FLAG0_Pos                                 28U
#define PCC_REG_QCH_BUSY_FLAG0_PROC1_I2C1_PWR_QCH_BUSY_FLAG0_Msk                                 (0x1UL << PCC_REG_QCH_BUSY_FLAG0_PROC1_I2C1_PWR_QCH_BUSY_FLAG0_Pos)

#define PCC_REG_QCH_BUSY_FLAG0_PROC1_I2C1_BUS_QCH_BUSY_FLAG0_Pos                                 29U
#define PCC_REG_QCH_BUSY_FLAG0_PROC1_I2C1_BUS_QCH_BUSY_FLAG0_Msk                                 (0x1UL << PCC_REG_QCH_BUSY_FLAG0_PROC1_I2C1_BUS_QCH_BUSY_FLAG0_Pos)

#define PCC_REG_QCH_BUSY_FLAG0_PROC1_I2C1_QCH_BUSY_FLAG0_Pos                                     30U
#define PCC_REG_QCH_BUSY_FLAG0_PROC1_I2C1_QCH_BUSY_FLAG0_Msk                                     (0x1UL << PCC_REG_QCH_BUSY_FLAG0_PROC1_I2C1_QCH_BUSY_FLAG0_Pos)

#define PCC_REG_QCH_BUSY_FLAG0_PROC1_I2C0_PWR_QCH_BUSY_FLAG0_Pos                                 31U
#define PCC_REG_QCH_BUSY_FLAG0_PROC1_I2C0_PWR_QCH_BUSY_FLAG0_Msk                                 (0x1UL << PCC_REG_QCH_BUSY_FLAG0_PROC1_I2C0_PWR_QCH_BUSY_FLAG0_Pos)

/* 0x39C    0x4000_039c
    0       R       USB_PWR_QCH_BUSY_FLAG0                          1'b1
    1       R       USB_BUS_QCH_BUSY_FLAG0                          1'b1
    2       R       USB_QCH_BUSY_FLAG0                              1'b1
    3       R       PCSM_VCORE_OP1_QCH_BUSY_FLAG0                   1'b1
    4       R       VDREG_QCH_BUSY_FLAG0                            1'b1
    5       R       UART3_PWR_QCH_BUSY_FLAG0                        1'b1
    6       R       UART3_BUS_QCH_BUSY_FLAG0                        1'b1
    7       R       UART3_QCH_BUSY_FLAG0                            1'b1
    8       R       UART2_PWR_QCH_BUSY_FLAG0                        1'b1
    9       R       UART2_BUS_QCH_BUSY_FLAG0                        1'b1
    10      R       UART2_QCH_BUSY_FLAG0                            1'b1
    11      R       UART1_PWR_QCH_BUSY_FLAG0                        1'b1
    12      R       UART1_BUS_QCH_BUSY_FLAG0                        1'b1
    13      R       UART1_QCH_BUSY_FLAG0                            1'b1
    14      R       UART0_PWR_QCH_BUSY_FLAG0                        1'b1
    15      R       UART0_BUS_QCH_BUSY_FLAG0                        1'b1
    16      R       UART0_QCH_BUSY_FLAG0                            1'b1
    17      R       TMETER_BUS_QCH_BUSY_FLAG0                       1'b1
    18      R       TMETER_QCH_BUSY_FLAG0                           1'b1
    19      R       TIMER11_PWM_QCH_BUSY_FLAG0                      1'b1
    20      R       TIMER11_QCH_BUSY_FLAG0                          1'b1
    21      R       TIMER10_PWM_QCH_BUSY_FLAG0                      1'b1
    22      R       TIMER10_QCH_BUSY_FLAG0                          1'b1
    23      R       TIMER9_PCLK_QCH_BUSY_FLAG0                      1'b1
    24      R       TIMER9_PWM_QCH_BUSY_FLAG0                       1'b1
    25      R       TIMER9_BUS_QCH_BUSY_FLAG0                       1'b1
    26      R       TIMER9_QCH_BUSY_FLAG0                           1'b1
    27      R       TIMER8_QCH_BUSY_FLAG0                           1'b1
    28      R       TIMER7_QCH_BUSY_FLAG0                           1'b1
    29      R       TIMER6_QCH_BUSY_FLAG0                           1'b1
    30      R       TIMER5_QCH_BUSY_FLAG0                           1'b1
    31      R       TIMER4_QCH_BUSY_FLAG0                           1'b1
 */
typedef union _PCC_REG_QCH_BUSY_FLAG0_PROC2_TYPE
{
    uint32_t d32;
    struct
    {
        uint32_t USB_PWR_QCH_BUSY_FLAG0: 1;
        uint32_t USB_BUS_QCH_BUSY_FLAG0: 1;
        uint32_t USB_QCH_BUSY_FLAG0: 1;
        uint32_t PCSM_VCORE_OP1_QCH_BUSY_FLAG0: 1;
        uint32_t VDREG_QCH_BUSY_FLAG0: 1;
        uint32_t UART3_PWR_QCH_BUSY_FLAG0: 1;
        uint32_t UART3_BUS_QCH_BUSY_FLAG0: 1;
        uint32_t UART3_QCH_BUSY_FLAG0: 1;
        uint32_t UART2_PWR_QCH_BUSY_FLAG0: 1;
        uint32_t UART2_BUS_QCH_BUSY_FLAG0: 1;
        uint32_t UART2_QCH_BUSY_FLAG0: 1;
        uint32_t UART1_PWR_QCH_BUSY_FLAG0: 1;
        uint32_t UART1_BUS_QCH_BUSY_FLAG0: 1;
        uint32_t UART1_QCH_BUSY_FLAG0: 1;
        uint32_t UART0_PWR_QCH_BUSY_FLAG0: 1;
        uint32_t UART0_BUS_QCH_BUSY_FLAG0: 1;
        uint32_t UART0_QCH_BUSY_FLAG0: 1;
        uint32_t TMETER_BUS_QCH_BUSY_FLAG0: 1;
        uint32_t TMETER_QCH_BUSY_FLAG0: 1;
        uint32_t TIMER11_PWM_QCH_BUSY_FLAG0: 1;
        uint32_t TIMER11_QCH_BUSY_FLAG0: 1;
        uint32_t TIMER10_PWM_QCH_BUSY_FLAG0: 1;
        uint32_t TIMER10_QCH_BUSY_FLAG0: 1;
        uint32_t TIMER9_PCLK_QCH_BUSY_FLAG0: 1;
        uint32_t TIMER9_PWM_QCH_BUSY_FLAG0: 1;
        uint32_t TIMER9_BUS_QCH_BUSY_FLAG0: 1;
        uint32_t TIMER9_QCH_BUSY_FLAG0: 1;
        uint32_t TIMER8_QCH_BUSY_FLAG0: 1;
        uint32_t TIMER7_QCH_BUSY_FLAG0: 1;
        uint32_t TIMER6_QCH_BUSY_FLAG0: 1;
        uint32_t TIMER5_QCH_BUSY_FLAG0: 1;
        uint32_t TIMER4_QCH_BUSY_FLAG0: 1;
    };
} PCC_REG_QCH_BUSY_FLAG0_PROC2_TYPE;

/*0x4000_039c PCC_REG_QCH_BUSY_FLAG0_PROC2*/
#define PCC_REG_QCH_BUSY_FLAG0_PROC2_USB_PWR_QCH_BUSY_FLAG0_Pos                                  0U
#define PCC_REG_QCH_BUSY_FLAG0_PROC2_USB_PWR_QCH_BUSY_FLAG0_Msk                                  (0x1UL << PCC_REG_QCH_BUSY_FLAG0_PROC2_USB_PWR_QCH_BUSY_FLAG0_Pos)

#define PCC_REG_QCH_BUSY_FLAG0_PROC2_USB_BUS_QCH_BUSY_FLAG0_Pos                                  1U
#define PCC_REG_QCH_BUSY_FLAG0_PROC2_USB_BUS_QCH_BUSY_FLAG0_Msk                                  (0x1UL << PCC_REG_QCH_BUSY_FLAG0_PROC2_USB_BUS_QCH_BUSY_FLAG0_Pos)

#define PCC_REG_QCH_BUSY_FLAG0_PROC2_USB_QCH_BUSY_FLAG0_Pos                                      2U
#define PCC_REG_QCH_BUSY_FLAG0_PROC2_USB_QCH_BUSY_FLAG0_Msk                                      (0x1UL << PCC_REG_QCH_BUSY_FLAG0_PROC2_USB_QCH_BUSY_FLAG0_Pos)

#define PCC_REG_QCH_BUSY_FLAG0_PROC2_PCSM_VCORE_OP1_QCH_BUSY_FLAG0_Pos                           3U
#define PCC_REG_QCH_BUSY_FLAG0_PROC2_PCSM_VCORE_OP1_QCH_BUSY_FLAG0_Msk                           (0x1UL << PCC_REG_QCH_BUSY_FLAG0_PROC2_PCSM_VCORE_OP1_QCH_BUSY_FLAG0_Pos)

#define PCC_REG_QCH_BUSY_FLAG0_PROC2_VDREG_QCH_BUSY_FLAG0_Pos                                    4U
#define PCC_REG_QCH_BUSY_FLAG0_PROC2_VDREG_QCH_BUSY_FLAG0_Msk                                    (0x1UL << PCC_REG_QCH_BUSY_FLAG0_PROC2_VDREG_QCH_BUSY_FLAG0_Pos)

#define PCC_REG_QCH_BUSY_FLAG0_PROC2_UART3_PWR_QCH_BUSY_FLAG0_Pos                                5U
#define PCC_REG_QCH_BUSY_FLAG0_PROC2_UART3_PWR_QCH_BUSY_FLAG0_Msk                                (0x1UL << PCC_REG_QCH_BUSY_FLAG0_PROC2_UART3_PWR_QCH_BUSY_FLAG0_Pos)

