rtkconnectivity/hal_realtek_mainline/bee/soc/inc/rtl87x2j/pcc_reg.h
#define PCC_REG_QCH_BUSY_FLAG0_PROC2_UART3_BUS_QCH_BUSY_FLAG0_Pos                                6U
#define PCC_REG_QCH_BUSY_FLAG0_PROC2_UART3_BUS_QCH_BUSY_FLAG0_Msk                                (0x1UL << PCC_REG_QCH_BUSY_FLAG0_PROC2_UART3_BUS_QCH_BUSY_FLAG0_Pos)

#define PCC_REG_QCH_BUSY_FLAG0_PROC2_UART3_QCH_BUSY_FLAG0_Pos                                    7U
#define PCC_REG_QCH_BUSY_FLAG0_PROC2_UART3_QCH_BUSY_FLAG0_Msk                                    (0x1UL << PCC_REG_QCH_BUSY_FLAG0_PROC2_UART3_QCH_BUSY_FLAG0_Pos)

#define PCC_REG_QCH_BUSY_FLAG0_PROC2_UART2_PWR_QCH_BUSY_FLAG0_Pos                                8U
#define PCC_REG_QCH_BUSY_FLAG0_PROC2_UART2_PWR_QCH_BUSY_FLAG0_Msk                                (0x1UL << PCC_REG_QCH_BUSY_FLAG0_PROC2_UART2_PWR_QCH_BUSY_FLAG0_Pos)

#define PCC_REG_QCH_BUSY_FLAG0_PROC2_UART2_BUS_QCH_BUSY_FLAG0_Pos                                9U
#define PCC_REG_QCH_BUSY_FLAG0_PROC2_UART2_BUS_QCH_BUSY_FLAG0_Msk                                (0x1UL << PCC_REG_QCH_BUSY_FLAG0_PROC2_UART2_BUS_QCH_BUSY_FLAG0_Pos)

#define PCC_REG_QCH_BUSY_FLAG0_PROC2_UART2_QCH_BUSY_FLAG0_Pos                                    10U
#define PCC_REG_QCH_BUSY_FLAG0_PROC2_UART2_QCH_BUSY_FLAG0_Msk                                    (0x1UL << PCC_REG_QCH_BUSY_FLAG0_PROC2_UART2_QCH_BUSY_FLAG0_Pos)

#define PCC_REG_QCH_BUSY_FLAG0_PROC2_UART1_PWR_QCH_BUSY_FLAG0_Pos                                11U
#define PCC_REG_QCH_BUSY_FLAG0_PROC2_UART1_PWR_QCH_BUSY_FLAG0_Msk                                (0x1UL << PCC_REG_QCH_BUSY_FLAG0_PROC2_UART1_PWR_QCH_BUSY_FLAG0_Pos)

#define PCC_REG_QCH_BUSY_FLAG0_PROC2_UART1_BUS_QCH_BUSY_FLAG0_Pos                                12U
#define PCC_REG_QCH_BUSY_FLAG0_PROC2_UART1_BUS_QCH_BUSY_FLAG0_Msk                                (0x1UL << PCC_REG_QCH_BUSY_FLAG0_PROC2_UART1_BUS_QCH_BUSY_FLAG0_Pos)

#define PCC_REG_QCH_BUSY_FLAG0_PROC2_UART1_QCH_BUSY_FLAG0_Pos                                    13U
#define PCC_REG_QCH_BUSY_FLAG0_PROC2_UART1_QCH_BUSY_FLAG0_Msk                                    (0x1UL << PCC_REG_QCH_BUSY_FLAG0_PROC2_UART1_QCH_BUSY_FLAG0_Pos)

#define PCC_REG_QCH_BUSY_FLAG0_PROC2_UART0_PWR_QCH_BUSY_FLAG0_Pos                                14U
#define PCC_REG_QCH_BUSY_FLAG0_PROC2_UART0_PWR_QCH_BUSY_FLAG0_Msk                                (0x1UL << PCC_REG_QCH_BUSY_FLAG0_PROC2_UART0_PWR_QCH_BUSY_FLAG0_Pos)

#define PCC_REG_QCH_BUSY_FLAG0_PROC2_UART0_BUS_QCH_BUSY_FLAG0_Pos                                15U
#define PCC_REG_QCH_BUSY_FLAG0_PROC2_UART0_BUS_QCH_BUSY_FLAG0_Msk                                (0x1UL << PCC_REG_QCH_BUSY_FLAG0_PROC2_UART0_BUS_QCH_BUSY_FLAG0_Pos)

#define PCC_REG_QCH_BUSY_FLAG0_PROC2_UART0_QCH_BUSY_FLAG0_Pos                                    16U
#define PCC_REG_QCH_BUSY_FLAG0_PROC2_UART0_QCH_BUSY_FLAG0_Msk                                    (0x1UL << PCC_REG_QCH_BUSY_FLAG0_PROC2_UART0_QCH_BUSY_FLAG0_Pos)

#define PCC_REG_QCH_BUSY_FLAG0_PROC2_TMETER_BUS_QCH_BUSY_FLAG0_Pos                               17U
#define PCC_REG_QCH_BUSY_FLAG0_PROC2_TMETER_BUS_QCH_BUSY_FLAG0_Msk                               (0x1UL << PCC_REG_QCH_BUSY_FLAG0_PROC2_TMETER_BUS_QCH_BUSY_FLAG0_Pos)

#define PCC_REG_QCH_BUSY_FLAG0_PROC2_TMETER_QCH_BUSY_FLAG0_Pos                                   18U
#define PCC_REG_QCH_BUSY_FLAG0_PROC2_TMETER_QCH_BUSY_FLAG0_Msk                                   (0x1UL << PCC_REG_QCH_BUSY_FLAG0_PROC2_TMETER_QCH_BUSY_FLAG0_Pos)

#define PCC_REG_QCH_BUSY_FLAG0_PROC2_TIMER11_PWM_QCH_BUSY_FLAG0_Pos                              19U
#define PCC_REG_QCH_BUSY_FLAG0_PROC2_TIMER11_PWM_QCH_BUSY_FLAG0_Msk                              (0x1UL << PCC_REG_QCH_BUSY_FLAG0_PROC2_TIMER11_PWM_QCH_BUSY_FLAG0_Pos)

#define PCC_REG_QCH_BUSY_FLAG0_PROC2_TIMER11_QCH_BUSY_FLAG0_Pos                                  20U
#define PCC_REG_QCH_BUSY_FLAG0_PROC2_TIMER11_QCH_BUSY_FLAG0_Msk                                  (0x1UL << PCC_REG_QCH_BUSY_FLAG0_PROC2_TIMER11_QCH_BUSY_FLAG0_Pos)

#define PCC_REG_QCH_BUSY_FLAG0_PROC2_TIMER10_PWM_QCH_BUSY_FLAG0_Pos                              21U
#define PCC_REG_QCH_BUSY_FLAG0_PROC2_TIMER10_PWM_QCH_BUSY_FLAG0_Msk                              (0x1UL << PCC_REG_QCH_BUSY_FLAG0_PROC2_TIMER10_PWM_QCH_BUSY_FLAG0_Pos)

#define PCC_REG_QCH_BUSY_FLAG0_PROC2_TIMER10_QCH_BUSY_FLAG0_Pos                                  22U
#define PCC_REG_QCH_BUSY_FLAG0_PROC2_TIMER10_QCH_BUSY_FLAG0_Msk                                  (0x1UL << PCC_REG_QCH_BUSY_FLAG0_PROC2_TIMER10_QCH_BUSY_FLAG0_Pos)

#define PCC_REG_QCH_BUSY_FLAG0_PROC2_TIMER9_PCLK_QCH_BUSY_FLAG0_Pos                              23U
#define PCC_REG_QCH_BUSY_FLAG0_PROC2_TIMER9_PCLK_QCH_BUSY_FLAG0_Msk                              (0x1UL << PCC_REG_QCH_BUSY_FLAG0_PROC2_TIMER9_PCLK_QCH_BUSY_FLAG0_Pos)

#define PCC_REG_QCH_BUSY_FLAG0_PROC2_TIMER9_PWM_QCH_BUSY_FLAG0_Pos                               24U
#define PCC_REG_QCH_BUSY_FLAG0_PROC2_TIMER9_PWM_QCH_BUSY_FLAG0_Msk                               (0x1UL << PCC_REG_QCH_BUSY_FLAG0_PROC2_TIMER9_PWM_QCH_BUSY_FLAG0_Pos)

#define PCC_REG_QCH_BUSY_FLAG0_PROC2_TIMER9_BUS_QCH_BUSY_FLAG0_Pos                               25U
#define PCC_REG_QCH_BUSY_FLAG0_PROC2_TIMER9_BUS_QCH_BUSY_FLAG0_Msk                               (0x1UL << PCC_REG_QCH_BUSY_FLAG0_PROC2_TIMER9_BUS_QCH_BUSY_FLAG0_Pos)

#define PCC_REG_QCH_BUSY_FLAG0_PROC2_TIMER9_QCH_BUSY_FLAG0_Pos                                   26U
#define PCC_REG_QCH_BUSY_FLAG0_PROC2_TIMER9_QCH_BUSY_FLAG0_Msk                                   (0x1UL << PCC_REG_QCH_BUSY_FLAG0_PROC2_TIMER9_QCH_BUSY_FLAG0_Pos)

#define PCC_REG_QCH_BUSY_FLAG0_PROC2_TIMER8_QCH_BUSY_FLAG0_Pos                                   27U
#define PCC_REG_QCH_BUSY_FLAG0_PROC2_TIMER8_QCH_BUSY_FLAG0_Msk                                   (0x1UL << PCC_REG_QCH_BUSY_FLAG0_PROC2_TIMER8_QCH_BUSY_FLAG0_Pos)

#define PCC_REG_QCH_BUSY_FLAG0_PROC2_TIMER7_QCH_BUSY_FLAG0_Pos                                   28U
#define PCC_REG_QCH_BUSY_FLAG0_PROC2_TIMER7_QCH_BUSY_FLAG0_Msk                                   (0x1UL << PCC_REG_QCH_BUSY_FLAG0_PROC2_TIMER7_QCH_BUSY_FLAG0_Pos)

#define PCC_REG_QCH_BUSY_FLAG0_PROC2_TIMER6_QCH_BUSY_FLAG0_Pos                                   29U
#define PCC_REG_QCH_BUSY_FLAG0_PROC2_TIMER6_QCH_BUSY_FLAG0_Msk                                   (0x1UL << PCC_REG_QCH_BUSY_FLAG0_PROC2_TIMER6_QCH_BUSY_FLAG0_Pos)

