rtkconnectivity/hal_realtek_mainline/bee/soc/inc/rtl87x2j/pcc_reg.h
#define PCC_REG_QCH_BUSY_FLAG0_PROC2_TIMER5_QCH_BUSY_FLAG0_Pos                                   30U
#define PCC_REG_QCH_BUSY_FLAG0_PROC2_TIMER5_QCH_BUSY_FLAG0_Msk                                   (0x1UL << PCC_REG_QCH_BUSY_FLAG0_PROC2_TIMER5_QCH_BUSY_FLAG0_Pos)

#define PCC_REG_QCH_BUSY_FLAG0_PROC2_TIMER4_QCH_BUSY_FLAG0_Pos                                   31U
#define PCC_REG_QCH_BUSY_FLAG0_PROC2_TIMER4_QCH_BUSY_FLAG0_Msk                                   (0x1UL << PCC_REG_QCH_BUSY_FLAG0_PROC2_TIMER4_QCH_BUSY_FLAG0_Pos)

/* 0x3A0    0x4000_03a0
    0       R       SPORT_BUS_QCH_BUSY_FLAG1                        1'b0
    1       R       SPORT_QCH_BUSY_FLAG1                            1'b0
    2       R       RFC_QCH_BUSY_FLAG1                              1'b0
    3       R       PRO24G_QCH_BUSY_FLAG1                           1'b0
    4       R       PCC_BUS_QCH_BUSY_FLAG1                          1'b0
    5       R       MODEM_BUS_QCH_BUSY_FLAG1                        1'b0
    6       R       MODEM_QCH_BUSY_FLAG1                            1'b0
    7       R       CAL80M_OSC_QCH_BUSY_FLAG1                       1'b0
    8       R       CAL80M_BUS_QCH_BUSY_FLAG1                       1'b0
    9       R       CAL80M_QCH_BUSY_FLAG1                           1'b0
    10      R       CAL32K_AON_BUS_QCH_BUSY_FLAG1                   1'b0
    11      R       CAL32K_AON_QCH_BUSY_FLAG1                       1'b0
    12      R       CAL32K_QCH_BUSY_FLAG1                           1'b0
    13      R       CAL10M_OSC_BUS_QCH_BUSY_FLAG1                   1'b0
    14      R       CAL10M_BUS_QCH_BUSY_FLAG1                       1'b0
    15      R       CAL10M_QCH_BUSY_FLAG1                           1'b0
    16      R       BTMAC_BUS_QCH_BUSY_FLAG1                        1'b0
    17      R       BTMAC_QCH_BUSY_FLAG1                            1'b0
    18      R       BT_VEN_BUS_QCH_BUSY_FLAG1                       1'b0
    19      R       AUDIO_BUS_BUS_QCH_BUSY_FLAG1                    1'b0
    20      R       AUDIO_QCH_BUSY_FLAG1                            1'b0
    21      R       ADC_PWR_QCH_BUSY_FLAG1                          1'b0
    22      R       ADC_BUS_QCH_BUSY_FLAG1                          1'b0
    23      R       ADC_QCH_BUSY_FLAG1                              1'b0
    24      R       AACK_QCH_BUSY_FLAG1                             1'b0
    31:25   R       RESERVED                                        7'd0
 */
typedef union _PCC_REG_QCH_BUSY_FLAG1_TYPE
{
    uint32_t d32;
    struct
    {
        uint32_t SPORT_BUS_QCH_BUSY_FLAG1: 1;
        uint32_t SPORT_QCH_BUSY_FLAG1: 1;
        uint32_t RFC_QCH_BUSY_FLAG1: 1;
        uint32_t PRO24G_QCH_BUSY_FLAG1: 1;
        uint32_t PCC_BUS_QCH_BUSY_FLAG1: 1;
        uint32_t MODEM_BUS_QCH_BUSY_FLAG1: 1;
        uint32_t MODEM_QCH_BUSY_FLAG1: 1;
        uint32_t CAL80M_OSC_QCH_BUSY_FLAG1: 1;
        uint32_t CAL80M_BUS_QCH_BUSY_FLAG1: 1;
        uint32_t CAL80M_QCH_BUSY_FLAG1: 1;
        uint32_t CAL32K_AON_BUS_QCH_BUSY_FLAG1: 1;
        uint32_t CAL32K_AON_QCH_BUSY_FLAG1: 1;
        uint32_t CAL32K_QCH_BUSY_FLAG1: 1;
        uint32_t CAL10M_OSC_BUS_QCH_BUSY_FLAG1: 1;
        uint32_t CAL10M_BUS_QCH_BUSY_FLAG1: 1;
        uint32_t CAL10M_QCH_BUSY_FLAG1: 1;
        uint32_t BTMAC_BUS_QCH_BUSY_FLAG1: 1;
        uint32_t BTMAC_QCH_BUSY_FLAG1: 1;
        uint32_t BT_VEN_BUS_QCH_BUSY_FLAG1: 1;
        uint32_t AUDIO_BUS_BUS_QCH_BUSY_FLAG1: 1;
        uint32_t AUDIO_QCH_BUSY_FLAG1: 1;
        uint32_t ADC_PWR_QCH_BUSY_FLAG1: 1;
        uint32_t ADC_BUS_QCH_BUSY_FLAG1: 1;
        uint32_t ADC_QCH_BUSY_FLAG1: 1;
        uint32_t AACK_QCH_BUSY_FLAG1: 1;
        uint32_t RESERVED: 7;
    };
} PCC_REG_QCH_BUSY_FLAG1_TYPE;

/*0x4000_03a0 PCC_REG_QCH_BUSY_FLAG1*/
#define PCC_REG_QCH_BUSY_FLAG1_SPORT_BUS_QCH_BUSY_FLAG1_Pos                                      0U
#define PCC_REG_QCH_BUSY_FLAG1_SPORT_BUS_QCH_BUSY_FLAG1_Msk                                      (0x1UL << PCC_REG_QCH_BUSY_FLAG1_SPORT_BUS_QCH_BUSY_FLAG1_Pos)

#define PCC_REG_QCH_BUSY_FLAG1_SPORT_QCH_BUSY_FLAG1_Pos                                          1U
#define PCC_REG_QCH_BUSY_FLAG1_SPORT_QCH_BUSY_FLAG1_Msk                                          (0x1UL << PCC_REG_QCH_BUSY_FLAG1_SPORT_QCH_BUSY_FLAG1_Pos)

#define PCC_REG_QCH_BUSY_FLAG1_RFC_QCH_BUSY_FLAG1_Pos                                            2U
#define PCC_REG_QCH_BUSY_FLAG1_RFC_QCH_BUSY_FLAG1_Msk                                            (0x1UL << PCC_REG_QCH_BUSY_FLAG1_RFC_QCH_BUSY_FLAG1_Pos)

#define PCC_REG_QCH_BUSY_FLAG1_PRO24G_QCH_BUSY_FLAG1_Pos                                         3U
#define PCC_REG_QCH_BUSY_FLAG1_PRO24G_QCH_BUSY_FLAG1_Msk                                         (0x1UL << PCC_REG_QCH_BUSY_FLAG1_PRO24G_QCH_BUSY_FLAG1_Pos)

#define PCC_REG_QCH_BUSY_FLAG1_PCC_BUS_QCH_BUSY_FLAG1_Pos                                        4U
#define PCC_REG_QCH_BUSY_FLAG1_PCC_BUS_QCH_BUSY_FLAG1_Msk                                        (0x1UL << PCC_REG_QCH_BUSY_FLAG1_PCC_BUS_QCH_BUSY_FLAG1_Pos)

#define PCC_REG_QCH_BUSY_FLAG1_MODEM_BUS_QCH_BUSY_FLAG1_Pos                                      5U
#define PCC_REG_QCH_BUSY_FLAG1_MODEM_BUS_QCH_BUSY_FLAG1_Msk                                      (0x1UL << PCC_REG_QCH_BUSY_FLAG1_MODEM_BUS_QCH_BUSY_FLAG1_Pos)

#define PCC_REG_QCH_BUSY_FLAG1_MODEM_QCH_BUSY_FLAG1_Pos                                          6U
#define PCC_REG_QCH_BUSY_FLAG1_MODEM_QCH_BUSY_FLAG1_Msk                                          (0x1UL << PCC_REG_QCH_BUSY_FLAG1_MODEM_QCH_BUSY_FLAG1_Pos)

#define PCC_REG_QCH_BUSY_FLAG1_CAL80M_OSC_QCH_BUSY_FLAG1_Pos                                     7U
#define PCC_REG_QCH_BUSY_FLAG1_CAL80M_OSC_QCH_BUSY_FLAG1_Msk                                     (0x1UL << PCC_REG_QCH_BUSY_FLAG1_CAL80M_OSC_QCH_BUSY_FLAG1_Pos)

#define PCC_REG_QCH_BUSY_FLAG1_CAL80M_BUS_QCH_BUSY_FLAG1_Pos                                     8U
#define PCC_REG_QCH_BUSY_FLAG1_CAL80M_BUS_QCH_BUSY_FLAG1_Msk                                     (0x1UL << PCC_REG_QCH_BUSY_FLAG1_CAL80M_BUS_QCH_BUSY_FLAG1_Pos)

#define PCC_REG_QCH_BUSY_FLAG1_CAL80M_QCH_BUSY_FLAG1_Pos                                         9U
#define PCC_REG_QCH_BUSY_FLAG1_CAL80M_QCH_BUSY_FLAG1_Msk                                         (0x1UL << PCC_REG_QCH_BUSY_FLAG1_CAL80M_QCH_BUSY_FLAG1_Pos)

#define PCC_REG_QCH_BUSY_FLAG1_CAL32K_AON_BUS_QCH_BUSY_FLAG1_Pos                                 10U
#define PCC_REG_QCH_BUSY_FLAG1_CAL32K_AON_BUS_QCH_BUSY_FLAG1_Msk                                 (0x1UL << PCC_REG_QCH_BUSY_FLAG1_CAL32K_AON_BUS_QCH_BUSY_FLAG1_Pos)

#define PCC_REG_QCH_BUSY_FLAG1_CAL32K_AON_QCH_BUSY_FLAG1_Pos                                     11U
#define PCC_REG_QCH_BUSY_FLAG1_CAL32K_AON_QCH_BUSY_FLAG1_Msk                                     (0x1UL << PCC_REG_QCH_BUSY_FLAG1_CAL32K_AON_QCH_BUSY_FLAG1_Pos)

#define PCC_REG_QCH_BUSY_FLAG1_CAL32K_QCH_BUSY_FLAG1_Pos                                         12U
#define PCC_REG_QCH_BUSY_FLAG1_CAL32K_QCH_BUSY_FLAG1_Msk                                         (0x1UL << PCC_REG_QCH_BUSY_FLAG1_CAL32K_QCH_BUSY_FLAG1_Pos)

#define PCC_REG_QCH_BUSY_FLAG1_CAL10M_OSC_BUS_QCH_BUSY_FLAG1_Pos                                 13U
#define PCC_REG_QCH_BUSY_FLAG1_CAL10M_OSC_BUS_QCH_BUSY_FLAG1_Msk                                 (0x1UL << PCC_REG_QCH_BUSY_FLAG1_CAL10M_OSC_BUS_QCH_BUSY_FLAG1_Pos)

#define PCC_REG_QCH_BUSY_FLAG1_CAL10M_BUS_QCH_BUSY_FLAG1_Pos                                     14U
#define PCC_REG_QCH_BUSY_FLAG1_CAL10M_BUS_QCH_BUSY_FLAG1_Msk                                     (0x1UL << PCC_REG_QCH_BUSY_FLAG1_CAL10M_BUS_QCH_BUSY_FLAG1_Pos)

#define PCC_REG_QCH_BUSY_FLAG1_CAL10M_QCH_BUSY_FLAG1_Pos                                         15U
#define PCC_REG_QCH_BUSY_FLAG1_CAL10M_QCH_BUSY_FLAG1_Msk                                         (0x1UL << PCC_REG_QCH_BUSY_FLAG1_CAL10M_QCH_BUSY_FLAG1_Pos)

#define PCC_REG_QCH_BUSY_FLAG1_BTMAC_BUS_QCH_BUSY_FLAG1_Pos                                      16U
#define PCC_REG_QCH_BUSY_FLAG1_BTMAC_BUS_QCH_BUSY_FLAG1_Msk                                      (0x1UL << PCC_REG_QCH_BUSY_FLAG1_BTMAC_BUS_QCH_BUSY_FLAG1_Pos)

#define PCC_REG_QCH_BUSY_FLAG1_BTMAC_QCH_BUSY_FLAG1_Pos                                          17U
#define PCC_REG_QCH_BUSY_FLAG1_BTMAC_QCH_BUSY_FLAG1_Msk                                          (0x1UL << PCC_REG_QCH_BUSY_FLAG1_BTMAC_QCH_BUSY_FLAG1_Pos)

#define PCC_REG_QCH_BUSY_FLAG1_BT_VEN_BUS_QCH_BUSY_FLAG1_Pos                                     18U
#define PCC_REG_QCH_BUSY_FLAG1_BT_VEN_BUS_QCH_BUSY_FLAG1_Msk                                     (0x1UL << PCC_REG_QCH_BUSY_FLAG1_BT_VEN_BUS_QCH_BUSY_FLAG1_Pos)

#define PCC_REG_QCH_BUSY_FLAG1_AUDIO_BUS_BUS_QCH_BUSY_FLAG1_Pos                                  19U
#define PCC_REG_QCH_BUSY_FLAG1_AUDIO_BUS_BUS_QCH_BUSY_FLAG1_Msk                                  (0x1UL << PCC_REG_QCH_BUSY_FLAG1_AUDIO_BUS_BUS_QCH_BUSY_FLAG1_Pos)

#define PCC_REG_QCH_BUSY_FLAG1_AUDIO_QCH_BUSY_FLAG1_Pos                                          20U
#define PCC_REG_QCH_BUSY_FLAG1_AUDIO_QCH_BUSY_FLAG1_Msk                                          (0x1UL << PCC_REG_QCH_BUSY_FLAG1_AUDIO_QCH_BUSY_FLAG1_Pos)

#define PCC_REG_QCH_BUSY_FLAG1_ADC_PWR_QCH_BUSY_FLAG1_Pos                                        21U
#define PCC_REG_QCH_BUSY_FLAG1_ADC_PWR_QCH_BUSY_FLAG1_Msk                                        (0x1UL << PCC_REG_QCH_BUSY_FLAG1_ADC_PWR_QCH_BUSY_FLAG1_Pos)

#define PCC_REG_QCH_BUSY_FLAG1_ADC_BUS_QCH_BUSY_FLAG1_Pos                                        22U
#define PCC_REG_QCH_BUSY_FLAG1_ADC_BUS_QCH_BUSY_FLAG1_Msk                                        (0x1UL << PCC_REG_QCH_BUSY_FLAG1_ADC_BUS_QCH_BUSY_FLAG1_Pos)

