rtkconnectivity/hal_realtek_mainline/bee/soc/inc/rtl87x2j/pcc_reg.h
#define PCC_REG_QCH_BUSY_FLAG1_ADC_QCH_BUSY_FLAG1_Pos                                            23U
#define PCC_REG_QCH_BUSY_FLAG1_ADC_QCH_BUSY_FLAG1_Msk                                            (0x1UL << PCC_REG_QCH_BUSY_FLAG1_ADC_QCH_BUSY_FLAG1_Pos)

#define PCC_REG_QCH_BUSY_FLAG1_AACK_QCH_BUSY_FLAG1_Pos                                           24U
#define PCC_REG_QCH_BUSY_FLAG1_AACK_QCH_BUSY_FLAG1_Msk                                           (0x1UL << PCC_REG_QCH_BUSY_FLAG1_AACK_QCH_BUSY_FLAG1_Pos)

#define PCC_REG_QCH_BUSY_FLAG1_RESERVED_Pos                                                      25U
#define PCC_REG_QCH_BUSY_FLAG1_RESERVED_Msk                                                      (0x7FUL << PCC_REG_QCH_BUSY_FLAG1_RESERVED_Pos)

/* 0x3A4    0x4000_03a4
    0       R       SPORT_BUS_QCH_BUSY_FLAG0                        1'b1
    1       R       SPORT_QCH_BUSY_FLAG0                            1'b1
    2       R       RFC_QCH_BUSY_FLAG0                              1'b1
    3       R       PRO24G_QCH_BUSY_FLAG0                           1'b1
    4       R       PCC_BUS_QCH_BUSY_FLAG0                          1'b1
    5       R       MODEM_BUS_QCH_BUSY_FLAG0                        1'b1
    6       R       MODEM_QCH_BUSY_FLAG0                            1'b1
    7       R       CAL80M_OSC_QCH_BUSY_FLAG0                       1'b1
    8       R       CAL80M_BUS_QCH_BUSY_FLAG0                       1'b1
    9       R       CAL80M_QCH_BUSY_FLAG0                           1'b1
    10      R       CAL32K_AON_BUS_QCH_BUSY_FLAG0                   1'b1
    11      R       CAL32K_AON_QCH_BUSY_FLAG0                       1'b1
    12      R       CAL32K_QCH_BUSY_FLAG0                           1'b1
    13      R       CAL10M_OSC_BUS_QCH_BUSY_FLAG0                   1'b1
    14      R       CAL10M_BUS_QCH_BUSY_FLAG0                       1'b1
    15      R       CAL10M_QCH_BUSY_FLAG0                           1'b1
    16      R       BTMAC_BUS_QCH_BUSY_FLAG0                        1'b1
    17      R       BTMAC_QCH_BUSY_FLAG0                            1'b1
    18      R       BT_VEN_BUS_QCH_BUSY_FLAG0                       1'b1
    19      R       AUDIO_BUS_BUS_QCH_BUSY_FLAG0                    1'b1
    20      R       AUDIO_QCH_BUSY_FLAG0                            1'b1
    21      R       ADC_PWR_QCH_BUSY_FLAG0                          1'b1
    22      R       ADC_BUS_QCH_BUSY_FLAG0                          1'b1
    23      R       ADC_QCH_BUSY_FLAG0                              1'b1
    24      R       AACK_QCH_BUSY_FLAG0                             1'b1
    30:25   R       RESERVED                                        6'd0
    31      R/W1C   DBG_QCH_BUSY_FLAG_W1C                           1'b0
 */
typedef union _PCC_REG_QCH_BUSY_FLAG0_TYPE
{
    uint32_t d32;
    struct
    {
        uint32_t SPORT_BUS_QCH_BUSY_FLAG0: 1;
        uint32_t SPORT_QCH_BUSY_FLAG0: 1;
        uint32_t RFC_QCH_BUSY_FLAG0: 1;
        uint32_t PRO24G_QCH_BUSY_FLAG0: 1;
        uint32_t PCC_BUS_QCH_BUSY_FLAG0: 1;
        uint32_t MODEM_BUS_QCH_BUSY_FLAG0: 1;
        uint32_t MODEM_QCH_BUSY_FLAG0: 1;
        uint32_t CAL80M_OSC_QCH_BUSY_FLAG0: 1;
        uint32_t CAL80M_BUS_QCH_BUSY_FLAG0: 1;
        uint32_t CAL80M_QCH_BUSY_FLAG0: 1;
        uint32_t CAL32K_AON_BUS_QCH_BUSY_FLAG0: 1;
        uint32_t CAL32K_AON_QCH_BUSY_FLAG0: 1;
        uint32_t CAL32K_QCH_BUSY_FLAG0: 1;
        uint32_t CAL10M_OSC_BUS_QCH_BUSY_FLAG0: 1;
        uint32_t CAL10M_BUS_QCH_BUSY_FLAG0: 1;
        uint32_t CAL10M_QCH_BUSY_FLAG0: 1;
        uint32_t BTMAC_BUS_QCH_BUSY_FLAG0: 1;
        uint32_t BTMAC_QCH_BUSY_FLAG0: 1;
        uint32_t BT_VEN_BUS_QCH_BUSY_FLAG0: 1;
        uint32_t AUDIO_BUS_BUS_QCH_BUSY_FLAG0: 1;
        uint32_t AUDIO_QCH_BUSY_FLAG0: 1;
        uint32_t ADC_PWR_QCH_BUSY_FLAG0: 1;
        uint32_t ADC_BUS_QCH_BUSY_FLAG0: 1;
        uint32_t ADC_QCH_BUSY_FLAG0: 1;
        uint32_t AACK_QCH_BUSY_FLAG0: 1;
        uint32_t RESERVED: 6;
        uint32_t DBG_QCH_BUSY_FLAG_W1C: 1;
    };
} PCC_REG_QCH_BUSY_FLAG0_TYPE;

/*0x4000_03a4 PCC_REG_QCH_BUSY_FLAG0*/
#define PCC_REG_QCH_BUSY_FLAG0_SPORT_BUS_QCH_BUSY_FLAG0_Pos                                      0U
#define PCC_REG_QCH_BUSY_FLAG0_SPORT_BUS_QCH_BUSY_FLAG0_Msk                                      (0x1UL << PCC_REG_QCH_BUSY_FLAG0_SPORT_BUS_QCH_BUSY_FLAG0_Pos)

#define PCC_REG_QCH_BUSY_FLAG0_SPORT_QCH_BUSY_FLAG0_Pos                                          1U
#define PCC_REG_QCH_BUSY_FLAG0_SPORT_QCH_BUSY_FLAG0_Msk                                          (0x1UL << PCC_REG_QCH_BUSY_FLAG0_SPORT_QCH_BUSY_FLAG0_Pos)

#define PCC_REG_QCH_BUSY_FLAG0_RFC_QCH_BUSY_FLAG0_Pos                                            2U
#define PCC_REG_QCH_BUSY_FLAG0_RFC_QCH_BUSY_FLAG0_Msk                                            (0x1UL << PCC_REG_QCH_BUSY_FLAG0_RFC_QCH_BUSY_FLAG0_Pos)

#define PCC_REG_QCH_BUSY_FLAG0_PRO24G_QCH_BUSY_FLAG0_Pos                                         3U
#define PCC_REG_QCH_BUSY_FLAG0_PRO24G_QCH_BUSY_FLAG0_Msk                                         (0x1UL << PCC_REG_QCH_BUSY_FLAG0_PRO24G_QCH_BUSY_FLAG0_Pos)

#define PCC_REG_QCH_BUSY_FLAG0_PCC_BUS_QCH_BUSY_FLAG0_Pos                                        4U
#define PCC_REG_QCH_BUSY_FLAG0_PCC_BUS_QCH_BUSY_FLAG0_Msk                                        (0x1UL << PCC_REG_QCH_BUSY_FLAG0_PCC_BUS_QCH_BUSY_FLAG0_Pos)

#define PCC_REG_QCH_BUSY_FLAG0_MODEM_BUS_QCH_BUSY_FLAG0_Pos                                      5U
#define PCC_REG_QCH_BUSY_FLAG0_MODEM_BUS_QCH_BUSY_FLAG0_Msk                                      (0x1UL << PCC_REG_QCH_BUSY_FLAG0_MODEM_BUS_QCH_BUSY_FLAG0_Pos)

#define PCC_REG_QCH_BUSY_FLAG0_MODEM_QCH_BUSY_FLAG0_Pos                                          6U
#define PCC_REG_QCH_BUSY_FLAG0_MODEM_QCH_BUSY_FLAG0_Msk                                          (0x1UL << PCC_REG_QCH_BUSY_FLAG0_MODEM_QCH_BUSY_FLAG0_Pos)

#define PCC_REG_QCH_BUSY_FLAG0_CAL80M_OSC_QCH_BUSY_FLAG0_Pos                                     7U
#define PCC_REG_QCH_BUSY_FLAG0_CAL80M_OSC_QCH_BUSY_FLAG0_Msk                                     (0x1UL << PCC_REG_QCH_BUSY_FLAG0_CAL80M_OSC_QCH_BUSY_FLAG0_Pos)

#define PCC_REG_QCH_BUSY_FLAG0_CAL80M_BUS_QCH_BUSY_FLAG0_Pos                                     8U
#define PCC_REG_QCH_BUSY_FLAG0_CAL80M_BUS_QCH_BUSY_FLAG0_Msk                                     (0x1UL << PCC_REG_QCH_BUSY_FLAG0_CAL80M_BUS_QCH_BUSY_FLAG0_Pos)

