rtkconnectivity/hal_realtek_mainline/bee/soc/inc/rtl87x2j/pcc_reg.h
#define PCC_REG_QCH_BUSY_FLAG0_CAL80M_QCH_BUSY_FLAG0_Pos                                         9U
#define PCC_REG_QCH_BUSY_FLAG0_CAL80M_QCH_BUSY_FLAG0_Msk                                         (0x1UL << PCC_REG_QCH_BUSY_FLAG0_CAL80M_QCH_BUSY_FLAG0_Pos)

#define PCC_REG_QCH_BUSY_FLAG0_CAL32K_AON_BUS_QCH_BUSY_FLAG0_Pos                                 10U
#define PCC_REG_QCH_BUSY_FLAG0_CAL32K_AON_BUS_QCH_BUSY_FLAG0_Msk                                 (0x1UL << PCC_REG_QCH_BUSY_FLAG0_CAL32K_AON_BUS_QCH_BUSY_FLAG0_Pos)

#define PCC_REG_QCH_BUSY_FLAG0_CAL32K_AON_QCH_BUSY_FLAG0_Pos                                     11U
#define PCC_REG_QCH_BUSY_FLAG0_CAL32K_AON_QCH_BUSY_FLAG0_Msk                                     (0x1UL << PCC_REG_QCH_BUSY_FLAG0_CAL32K_AON_QCH_BUSY_FLAG0_Pos)

#define PCC_REG_QCH_BUSY_FLAG0_CAL32K_QCH_BUSY_FLAG0_Pos                                         12U
#define PCC_REG_QCH_BUSY_FLAG0_CAL32K_QCH_BUSY_FLAG0_Msk                                         (0x1UL << PCC_REG_QCH_BUSY_FLAG0_CAL32K_QCH_BUSY_FLAG0_Pos)

#define PCC_REG_QCH_BUSY_FLAG0_CAL10M_OSC_BUS_QCH_BUSY_FLAG0_Pos                                 13U
#define PCC_REG_QCH_BUSY_FLAG0_CAL10M_OSC_BUS_QCH_BUSY_FLAG0_Msk                                 (0x1UL << PCC_REG_QCH_BUSY_FLAG0_CAL10M_OSC_BUS_QCH_BUSY_FLAG0_Pos)

#define PCC_REG_QCH_BUSY_FLAG0_CAL10M_BUS_QCH_BUSY_FLAG0_Pos                                     14U
#define PCC_REG_QCH_BUSY_FLAG0_CAL10M_BUS_QCH_BUSY_FLAG0_Msk                                     (0x1UL << PCC_REG_QCH_BUSY_FLAG0_CAL10M_BUS_QCH_BUSY_FLAG0_Pos)

#define PCC_REG_QCH_BUSY_FLAG0_CAL10M_QCH_BUSY_FLAG0_Pos                                         15U
#define PCC_REG_QCH_BUSY_FLAG0_CAL10M_QCH_BUSY_FLAG0_Msk                                         (0x1UL << PCC_REG_QCH_BUSY_FLAG0_CAL10M_QCH_BUSY_FLAG0_Pos)

#define PCC_REG_QCH_BUSY_FLAG0_BTMAC_BUS_QCH_BUSY_FLAG0_Pos                                      16U
#define PCC_REG_QCH_BUSY_FLAG0_BTMAC_BUS_QCH_BUSY_FLAG0_Msk                                      (0x1UL << PCC_REG_QCH_BUSY_FLAG0_BTMAC_BUS_QCH_BUSY_FLAG0_Pos)

#define PCC_REG_QCH_BUSY_FLAG0_BTMAC_QCH_BUSY_FLAG0_Pos                                          17U
#define PCC_REG_QCH_BUSY_FLAG0_BTMAC_QCH_BUSY_FLAG0_Msk                                          (0x1UL << PCC_REG_QCH_BUSY_FLAG0_BTMAC_QCH_BUSY_FLAG0_Pos)

#define PCC_REG_QCH_BUSY_FLAG0_BT_VEN_BUS_QCH_BUSY_FLAG0_Pos                                     18U
#define PCC_REG_QCH_BUSY_FLAG0_BT_VEN_BUS_QCH_BUSY_FLAG0_Msk                                     (0x1UL << PCC_REG_QCH_BUSY_FLAG0_BT_VEN_BUS_QCH_BUSY_FLAG0_Pos)

#define PCC_REG_QCH_BUSY_FLAG0_AUDIO_BUS_BUS_QCH_BUSY_FLAG0_Pos                                  19U
#define PCC_REG_QCH_BUSY_FLAG0_AUDIO_BUS_BUS_QCH_BUSY_FLAG0_Msk                                  (0x1UL << PCC_REG_QCH_BUSY_FLAG0_AUDIO_BUS_BUS_QCH_BUSY_FLAG0_Pos)

#define PCC_REG_QCH_BUSY_FLAG0_AUDIO_QCH_BUSY_FLAG0_Pos                                          20U
#define PCC_REG_QCH_BUSY_FLAG0_AUDIO_QCH_BUSY_FLAG0_Msk                                          (0x1UL << PCC_REG_QCH_BUSY_FLAG0_AUDIO_QCH_BUSY_FLAG0_Pos)

#define PCC_REG_QCH_BUSY_FLAG0_ADC_PWR_QCH_BUSY_FLAG0_Pos                                        21U
#define PCC_REG_QCH_BUSY_FLAG0_ADC_PWR_QCH_BUSY_FLAG0_Msk                                        (0x1UL << PCC_REG_QCH_BUSY_FLAG0_ADC_PWR_QCH_BUSY_FLAG0_Pos)

#define PCC_REG_QCH_BUSY_FLAG0_ADC_BUS_QCH_BUSY_FLAG0_Pos                                        22U
#define PCC_REG_QCH_BUSY_FLAG0_ADC_BUS_QCH_BUSY_FLAG0_Msk                                        (0x1UL << PCC_REG_QCH_BUSY_FLAG0_ADC_BUS_QCH_BUSY_FLAG0_Pos)

#define PCC_REG_QCH_BUSY_FLAG0_ADC_QCH_BUSY_FLAG0_Pos                                            23U
#define PCC_REG_QCH_BUSY_FLAG0_ADC_QCH_BUSY_FLAG0_Msk                                            (0x1UL << PCC_REG_QCH_BUSY_FLAG0_ADC_QCH_BUSY_FLAG0_Pos)

#define PCC_REG_QCH_BUSY_FLAG0_AACK_QCH_BUSY_FLAG0_Pos                                           24U
#define PCC_REG_QCH_BUSY_FLAG0_AACK_QCH_BUSY_FLAG0_Msk                                           (0x1UL << PCC_REG_QCH_BUSY_FLAG0_AACK_QCH_BUSY_FLAG0_Pos)

#define PCC_REG_QCH_BUSY_FLAG0_RESERVED_Pos                                                      25U
#define PCC_REG_QCH_BUSY_FLAG0_RESERVED_Msk                                                      (0x3FUL << PCC_REG_QCH_BUSY_FLAG0_RESERVED_Pos)

#define PCC_REG_QCH_BUSY_FLAG0_DBG_QCH_BUSY_FLAG_W1C_Pos                                         31U
#define PCC_REG_QCH_BUSY_FLAG0_DBG_QCH_BUSY_FLAG_W1C_Msk                                         (0x1UL << PCC_REG_QCH_BUSY_FLAG0_DBG_QCH_BUSY_FLAG_W1C_Pos)

/* 0x3A8    0x4000_03a8
    0       R/W     R_PDN09                                         1'b0
    1       R/W     UA33PC_EN                                       1'b0
    2       R/W     RSVD_2                                          1'b0
    3       R/W     POW_MBIAS                                       1'b0
    4       R/W     RSVD_1                                          1'b0
    5       R/W     ISO_LV_0                                        1'b1
    6       R/W     POW_BC_L                                        1'b0
    7       R/W     UA33PC_BC_EN                                    1'b0
    8       R/W     ISO_UA2USB                                      1'b0
    9       R/W     USB_BUS_CLK_EN                                  1'b0
    10      R/W     REG_FORCE_DP                                    1'b0
    11      R/W     REG_DP_MODE                                     1'b0
    12      R/W     REG_LDOPW                                       1'b0
    13      R/W     RES1M_EN_L                                      1'b0
    31:14   R/W     RSVD                                            18'b0
 */
typedef union _PCC_REG_USB_POW_TYPE
{
    uint32_t d32;
    struct
    {
        uint32_t R_PDN09: 1;
        uint32_t UA33PC_EN: 1;
        uint32_t RSVD_2: 1;
        uint32_t POW_MBIAS: 1;
        uint32_t RSVD_1: 1;
        uint32_t ISO_LV_0: 1;
        uint32_t POW_BC_L: 1;
        uint32_t UA33PC_BC_EN: 1;
        uint32_t ISO_UA2USB: 1;
        uint32_t USB_BUS_CLK_EN: 1;
        uint32_t REG_FORCE_DP: 1;
        uint32_t REG_DP_MODE: 1;
        uint32_t REG_LDOPW: 1;
        uint32_t RES1M_EN_L: 1;
        uint32_t RSVD: 18;
    };
} PCC_REG_USB_POW_TYPE;

/*0x4000_03a8 PCC_REG_USB_POW*/
#define PCC_REG_USB_POW_R_PDN09_Pos                                                              0U
#define PCC_REG_USB_POW_R_PDN09_Msk                                                              (0x1UL << PCC_REG_USB_POW_R_PDN09_Pos)

#define PCC_REG_USB_POW_UA33PC_EN_Pos                                                            1U
#define PCC_REG_USB_POW_UA33PC_EN_Msk                                                            (0x1UL << PCC_REG_USB_POW_UA33PC_EN_Pos)

#define PCC_REG_USB_POW_RSVD_2_Pos                                                               2U
#define PCC_REG_USB_POW_RSVD_2_Msk                                                               (0x1UL << PCC_REG_USB_POW_RSVD_2_Pos)

#define PCC_REG_USB_POW_POW_MBIAS_Pos                                                            3U
#define PCC_REG_USB_POW_POW_MBIAS_Msk                                                            (0x1UL << PCC_REG_USB_POW_POW_MBIAS_Pos)

#define PCC_REG_USB_POW_RSVD_1_Pos                                                               4U
#define PCC_REG_USB_POW_RSVD_1_Msk                                                               (0x1UL << PCC_REG_USB_POW_RSVD_1_Pos)

#define PCC_REG_USB_POW_ISO_LV_0_Pos                                                             5U
#define PCC_REG_USB_POW_ISO_LV_0_Msk                                                             (0x1UL << PCC_REG_USB_POW_ISO_LV_0_Pos)

#define PCC_REG_USB_POW_POW_BC_L_Pos                                                             6U
#define PCC_REG_USB_POW_POW_BC_L_Msk                                                             (0x1UL << PCC_REG_USB_POW_POW_BC_L_Pos)

#define PCC_REG_USB_POW_UA33PC_BC_EN_Pos                                                         7U
#define PCC_REG_USB_POW_UA33PC_BC_EN_Msk                                                         (0x1UL << PCC_REG_USB_POW_UA33PC_BC_EN_Pos)

#define PCC_REG_USB_POW_ISO_UA2USB_Pos                                                           8U
#define PCC_REG_USB_POW_ISO_UA2USB_Msk                                                           (0x1UL << PCC_REG_USB_POW_ISO_UA2USB_Pos)

#define PCC_REG_USB_POW_USB_BUS_CLK_EN_Pos                                                       9U
#define PCC_REG_USB_POW_USB_BUS_CLK_EN_Msk                                                       (0x1UL << PCC_REG_USB_POW_USB_BUS_CLK_EN_Pos)

#define PCC_REG_USB_POW_REG_FORCE_DP_Pos                                                         10U
#define PCC_REG_USB_POW_REG_FORCE_DP_Msk                                                         (0x1UL << PCC_REG_USB_POW_REG_FORCE_DP_Pos)

