rtkconnectivity/hal_realtek_mainline/bee/soc/inc/rtl87x2j/pcc_reg.h
#define PCC_REG_USB_POW_REG_DP_MODE_Pos                                                          11U
#define PCC_REG_USB_POW_REG_DP_MODE_Msk                                                          (0x1UL << PCC_REG_USB_POW_REG_DP_MODE_Pos)

#define PCC_REG_USB_POW_REG_LDOPW_Pos                                                            12U
#define PCC_REG_USB_POW_REG_LDOPW_Msk                                                            (0x1UL << PCC_REG_USB_POW_REG_LDOPW_Pos)

#define PCC_REG_USB_POW_RES1M_EN_L_Pos                                                           13U
#define PCC_REG_USB_POW_RES1M_EN_L_Msk                                                           (0x1UL << PCC_REG_USB_POW_RES1M_EN_L_Pos)

#define PCC_REG_USB_POW_RSVD_Pos                                                                 14U
#define PCC_REG_USB_POW_RSVD_Msk                                                                 (0x3FFFFUL << PCC_REG_USB_POW_RSVD_Pos)

/* 0x3AC    0x4000_03ac
    31:0    R       RSVD                                            32'd0
 */
typedef union _PCC_REG_DUMMY_3AC_TYPE
{
    uint32_t d32;
    struct
    {
        uint32_t RSVD;
    };
} PCC_REG_DUMMY_3AC_TYPE;

/*0x4000_03ac PCC_REG_DUMMY_3AC*/
#define PCC_REG_DUMMY_3AC_RSVD_Pos                                                               0U
#define PCC_REG_DUMMY_3AC_RSVD_Msk                                                               (0xFFFFFFFFUL << PCC_REG_DUMMY_3AC_RSVD_Pos)

/* 0x3B0    0x4000_03b0
    31:0    R       RSVD                                            32'd0
 */
typedef union _PCC_REG_DUMMY_3B0_TYPE
{
    uint32_t d32;
    struct
    {
        uint32_t RSVD;
    };
} PCC_REG_DUMMY_3B0_TYPE;

/*0x4000_03b0 PCC_REG_DUMMY_3B0*/
#define PCC_REG_DUMMY_3B0_RSVD_Pos                                                               0U
#define PCC_REG_DUMMY_3B0_RSVD_Msk                                                               (0xFFFFFFFFUL << PCC_REG_DUMMY_3B0_RSVD_Pos)

/* 0x3B4    0x4000_03b4
    31:0    R       RSVD                                            32'd0
 */
typedef union _PCC_REG_DUMMY_3B4_TYPE
{
    uint32_t d32;
    struct
    {
        uint32_t RSVD;
    };
} PCC_REG_DUMMY_3B4_TYPE;

/*0x4000_03b4 PCC_REG_DUMMY_3B4*/
#define PCC_REG_DUMMY_3B4_RSVD_Pos                                                               0U
#define PCC_REG_DUMMY_3B4_RSVD_Msk                                                               (0xFFFFFFFFUL << PCC_REG_DUMMY_3B4_RSVD_Pos)

/* 0x3B8    0x4000_03b8
    31:0    R       DEBUG_PCK_VCORE                                 32'd0
 */
typedef union _PCC_REG_DBG_MUX_PCK_TYPE
{
    uint32_t d32;
    struct
    {
        uint32_t DEBUG_PCK_VCORE;
    };
} PCC_REG_DBG_MUX_PCK_TYPE;

/*0x4000_03b8 PCC_REG_DBG_MUX_PCK*/
#define PCC_REG_DBG_MUX_PCK_DEBUG_PCK_VCORE_Pos                                                  0U
#define PCC_REG_DBG_MUX_PCK_DEBUG_PCK_VCORE_Msk                                                  (0xFFFFFFFFUL << PCC_REG_DBG_MUX_PCK_DEBUG_PCK_VCORE_Pos)

/* 0x3BC    0x4000_03bc
    2:0     R/W     R_DBG_MUX_GRP_SEL0                              3'd0
    3       R       RSVD_7                                          1'd0
    6:4     R/W     R_DBG_MUX_GRP_SEL1                              3'd0
    7       R       RSVD_6                                          1'd0
    10:8    R/W     R_DBG_MUX_GRP_SEL2                              3'd0
    11      R       RSVD_5                                          1'd0
    14:12   R/W     R_DBG_MUX_GRP_SEL3                              3'd0
    15      R       RSVD_4                                          1'd0
    18:16   R/W     R_DBG_MUX_GRP_SEL4                              3'd0
    19      R       RSVD_3                                          1'd0
    22:20   R/W     R_DBG_MUX_GRP_SEL5                              3'd0
    23      R       RSVD_2                                          1'd0
    26:24   R/W     R_DBG_MUX_GRP_SEL6                              3'd0
    27      R       RSVD_1                                          1'd0
    30:28   R/W     R_DBG_MUX_GRP_SEL7                              3'd0
    31      R       RSVD                                            1'd0
 */
typedef union _PCC_REG_DBG_MUX_GRP_CFG0_TYPE
{
    uint32_t d32;
    struct
    {
        uint32_t R_DBG_MUX_GRP_SEL0: 3;
        uint32_t RSVD_7: 1;
        uint32_t R_DBG_MUX_GRP_SEL1: 3;
        uint32_t RSVD_6: 1;
        uint32_t R_DBG_MUX_GRP_SEL2: 3;
        uint32_t RSVD_5: 1;
        uint32_t R_DBG_MUX_GRP_SEL3: 3;
        uint32_t RSVD_4: 1;
        uint32_t R_DBG_MUX_GRP_SEL4: 3;
        uint32_t RSVD_3: 1;
        uint32_t R_DBG_MUX_GRP_SEL5: 3;
        uint32_t RSVD_2: 1;
        uint32_t R_DBG_MUX_GRP_SEL6: 3;
        uint32_t RSVD_1: 1;
        uint32_t R_DBG_MUX_GRP_SEL7: 3;
        uint32_t RSVD: 1;
    };
} PCC_REG_DBG_MUX_GRP_CFG0_TYPE;

/*0x4000_03bc PCC_REG_DBG_MUX_GRP_CFG0*/
#define PCC_REG_DBG_MUX_GRP_CFG0_R_DBG_MUX_GRP_SEL0_Pos                                          0U
#define PCC_REG_DBG_MUX_GRP_CFG0_R_DBG_MUX_GRP_SEL0_Msk                                          (0x7UL << PCC_REG_DBG_MUX_GRP_CFG0_R_DBG_MUX_GRP_SEL0_Pos)

#define PCC_REG_DBG_MUX_GRP_CFG0_RSVD_7_Pos                                                      3U
#define PCC_REG_DBG_MUX_GRP_CFG0_RSVD_7_Msk                                                      (0x1UL << PCC_REG_DBG_MUX_GRP_CFG0_RSVD_7_Pos)

#define PCC_REG_DBG_MUX_GRP_CFG0_R_DBG_MUX_GRP_SEL1_Pos                                          4U
#define PCC_REG_DBG_MUX_GRP_CFG0_R_DBG_MUX_GRP_SEL1_Msk                                          (0x7UL << PCC_REG_DBG_MUX_GRP_CFG0_R_DBG_MUX_GRP_SEL1_Pos)

#define PCC_REG_DBG_MUX_GRP_CFG0_RSVD_6_Pos                                                      7U
#define PCC_REG_DBG_MUX_GRP_CFG0_RSVD_6_Msk                                                      (0x1UL << PCC_REG_DBG_MUX_GRP_CFG0_RSVD_6_Pos)

#define PCC_REG_DBG_MUX_GRP_CFG0_R_DBG_MUX_GRP_SEL2_Pos                                          8U
#define PCC_REG_DBG_MUX_GRP_CFG0_R_DBG_MUX_GRP_SEL2_Msk                                          (0x7UL << PCC_REG_DBG_MUX_GRP_CFG0_R_DBG_MUX_GRP_SEL2_Pos)

#define PCC_REG_DBG_MUX_GRP_CFG0_RSVD_5_Pos                                                      11U
#define PCC_REG_DBG_MUX_GRP_CFG0_RSVD_5_Msk                                                      (0x1UL << PCC_REG_DBG_MUX_GRP_CFG0_RSVD_5_Pos)

#define PCC_REG_DBG_MUX_GRP_CFG0_R_DBG_MUX_GRP_SEL3_Pos                                          12U
#define PCC_REG_DBG_MUX_GRP_CFG0_R_DBG_MUX_GRP_SEL3_Msk                                          (0x7UL << PCC_REG_DBG_MUX_GRP_CFG0_R_DBG_MUX_GRP_SEL3_Pos)

#define PCC_REG_DBG_MUX_GRP_CFG0_RSVD_4_Pos                                                      15U
#define PCC_REG_DBG_MUX_GRP_CFG0_RSVD_4_Msk                                                      (0x1UL << PCC_REG_DBG_MUX_GRP_CFG0_RSVD_4_Pos)

#define PCC_REG_DBG_MUX_GRP_CFG0_R_DBG_MUX_GRP_SEL4_Pos                                          16U
#define PCC_REG_DBG_MUX_GRP_CFG0_R_DBG_MUX_GRP_SEL4_Msk                                          (0x7UL << PCC_REG_DBG_MUX_GRP_CFG0_R_DBG_MUX_GRP_SEL4_Pos)

#define PCC_REG_DBG_MUX_GRP_CFG0_RSVD_3_Pos                                                      19U
#define PCC_REG_DBG_MUX_GRP_CFG0_RSVD_3_Msk                                                      (0x1UL << PCC_REG_DBG_MUX_GRP_CFG0_RSVD_3_Pos)

#define PCC_REG_DBG_MUX_GRP_CFG0_R_DBG_MUX_GRP_SEL5_Pos                                          20U
#define PCC_REG_DBG_MUX_GRP_CFG0_R_DBG_MUX_GRP_SEL5_Msk                                          (0x7UL << PCC_REG_DBG_MUX_GRP_CFG0_R_DBG_MUX_GRP_SEL5_Pos)

