rtkconnectivity/hal_realtek_mainline/bee/soc/inc/rtl87x2j/pcc_reg.h
#define PCC_REG_DBG_MUX_GRP_CFG0_RSVD_2_Pos                                                      23U
#define PCC_REG_DBG_MUX_GRP_CFG0_RSVD_2_Msk                                                      (0x1UL << PCC_REG_DBG_MUX_GRP_CFG0_RSVD_2_Pos)

#define PCC_REG_DBG_MUX_GRP_CFG0_R_DBG_MUX_GRP_SEL6_Pos                                          24U
#define PCC_REG_DBG_MUX_GRP_CFG0_R_DBG_MUX_GRP_SEL6_Msk                                          (0x7UL << PCC_REG_DBG_MUX_GRP_CFG0_R_DBG_MUX_GRP_SEL6_Pos)

#define PCC_REG_DBG_MUX_GRP_CFG0_RSVD_1_Pos                                                      27U
#define PCC_REG_DBG_MUX_GRP_CFG0_RSVD_1_Msk                                                      (0x1UL << PCC_REG_DBG_MUX_GRP_CFG0_RSVD_1_Pos)

#define PCC_REG_DBG_MUX_GRP_CFG0_R_DBG_MUX_GRP_SEL7_Pos                                          28U
#define PCC_REG_DBG_MUX_GRP_CFG0_R_DBG_MUX_GRP_SEL7_Msk                                          (0x7UL << PCC_REG_DBG_MUX_GRP_CFG0_R_DBG_MUX_GRP_SEL7_Pos)

#define PCC_REG_DBG_MUX_GRP_CFG0_RSVD_Pos                                                        31U
#define PCC_REG_DBG_MUX_GRP_CFG0_RSVD_Msk                                                        (0x1UL << PCC_REG_DBG_MUX_GRP_CFG0_RSVD_Pos)

/* 0x3C0    0x4000_03c0
    2:0     R/W     R_DBG_MUX_GRP_SEL8                              3'd0
    3       R       RSVD_3                                          1'd0
    6:4     R/W     R_DBG_MUX_GRP_SEL9                              3'd0
    7       R       RSVD_2                                          1'd0
    10:8    R/W     R_DBG_MUX_GRP_SEL10                             3'd0
    11      R       RSVD_1                                          1'd0
    14:12   R/W     R_DBG_MUX_GRP_SEL11                             3'd0
    31:15   R       RSVD                                            1'd0
 */
typedef union _PCC_REG_DBG_MUX_GRP_CFG1_TYPE
{
    uint32_t d32;
    struct
    {
        uint32_t R_DBG_MUX_GRP_SEL8: 3;
        uint32_t RSVD_3: 1;
        uint32_t R_DBG_MUX_GRP_SEL9: 3;
        uint32_t RSVD_2: 1;
        uint32_t R_DBG_MUX_GRP_SEL10: 3;
        uint32_t RSVD_1: 1;
        uint32_t R_DBG_MUX_GRP_SEL11: 3;
        uint32_t RSVD: 17;
    };
} PCC_REG_DBG_MUX_GRP_CFG1_TYPE;

/*0x4000_03c0 PCC_REG_DBG_MUX_GRP_CFG1*/
#define PCC_REG_DBG_MUX_GRP_CFG1_R_DBG_MUX_GRP_SEL8_Pos                                          0U
#define PCC_REG_DBG_MUX_GRP_CFG1_R_DBG_MUX_GRP_SEL8_Msk                                          (0x7UL << PCC_REG_DBG_MUX_GRP_CFG1_R_DBG_MUX_GRP_SEL8_Pos)

#define PCC_REG_DBG_MUX_GRP_CFG1_RSVD_3_Pos                                                      3U
#define PCC_REG_DBG_MUX_GRP_CFG1_RSVD_3_Msk                                                      (0x1UL << PCC_REG_DBG_MUX_GRP_CFG1_RSVD_3_Pos)

#define PCC_REG_DBG_MUX_GRP_CFG1_R_DBG_MUX_GRP_SEL9_Pos                                          4U
#define PCC_REG_DBG_MUX_GRP_CFG1_R_DBG_MUX_GRP_SEL9_Msk                                          (0x7UL << PCC_REG_DBG_MUX_GRP_CFG1_R_DBG_MUX_GRP_SEL9_Pos)

#define PCC_REG_DBG_MUX_GRP_CFG1_RSVD_2_Pos                                                      7U
#define PCC_REG_DBG_MUX_GRP_CFG1_RSVD_2_Msk                                                      (0x1UL << PCC_REG_DBG_MUX_GRP_CFG1_RSVD_2_Pos)

#define PCC_REG_DBG_MUX_GRP_CFG1_R_DBG_MUX_GRP_SEL10_Pos                                         8U
#define PCC_REG_DBG_MUX_GRP_CFG1_R_DBG_MUX_GRP_SEL10_Msk                                         (0x7UL << PCC_REG_DBG_MUX_GRP_CFG1_R_DBG_MUX_GRP_SEL10_Pos)

#define PCC_REG_DBG_MUX_GRP_CFG1_RSVD_1_Pos                                                      11U
#define PCC_REG_DBG_MUX_GRP_CFG1_RSVD_1_Msk                                                      (0x1UL << PCC_REG_DBG_MUX_GRP_CFG1_RSVD_1_Pos)

#define PCC_REG_DBG_MUX_GRP_CFG1_R_DBG_MUX_GRP_SEL11_Pos                                         12U
#define PCC_REG_DBG_MUX_GRP_CFG1_R_DBG_MUX_GRP_SEL11_Msk                                         (0x7UL << PCC_REG_DBG_MUX_GRP_CFG1_R_DBG_MUX_GRP_SEL11_Pos)

#define PCC_REG_DBG_MUX_GRP_CFG1_RSVD_Pos                                                        15U
#define PCC_REG_DBG_MUX_GRP_CFG1_RSVD_Msk                                                        (0x1FFFFUL << PCC_REG_DBG_MUX_GRP_CFG1_RSVD_Pos)


#define PCC_REG_BASE 0x40000000

#define PCC_REG_READ(Offset)\
    ((uint32_t)*((volatile uint32_t*)(PCC_REG_BASE+(Offset))))

#define PCC_REG_WRITE(Offset, Value)\
    ((*((volatile uint32_t*)(PCC_REG_BASE + (Offset)))) = (Value))

#define PCC_REG_UPDATE(Offset, Mask, Value) \
    do {\
        uint32_t temp;\
        temp = PCC_REG_READ(Offset) & ~(Mask);\
        PCC_REG_WRITE(Offset, (temp | ((Value) & (Mask))));\
    } while(0)

#define PCC_REG_READ_BITFIELD(Offset, Bitfield)                   \
    (((Offset##_TYPE)PCC_REG_READ(Offset)).Bitfield)

#define PCC_REG_WRITE_BITFIELD(Offset, Bitfield, Value)           \
    do {                                                        \
        Offset##_TYPE temp = {.d32 = PCC_REG_READ(Offset)};       \
        temp.Bitfield = Value;                                         \
        PCC_REG_WRITE(Offset, temp.d32);                          \
    } while(0)

#endif //#define PCC_REG_H
